export default [
    {
        title: "古诗词", data: [
            {
                author: "李白",
                article: [
                    {
                        name: "侠客行·李白",
                        content:
                            "赵客缦胡缨，吴钩霜雪明。银鞍照白马，飒沓如流星。十步杀一人，千里不留行。事了拂衣去，深藏身与名。闲过信陵饮，脱剑膝前横。将炙啖朱亥，持觞劝侯嬴。三杯吐然诺，五岳倒为轻。眼花耳热后，意气素霓生。救赵挥金槌，邯郸先震惊。千秋二壮士，烜赫大梁城。纵死侠骨香，不惭世上英。谁能书阁下，白首太玄经。",
                    },
                    {
                        name: "赠从兄襄阳少府皓·李白",
                        content: "结发未识事，所交尽豪雄。却秦不受赏，击晋宁为功。托身白刃里，杀人红尘中。当朝揖高义，举世称英雄。小节岂足言，退耕舂陵东。归来无产业，生事如转蓬。一朝乌裘敝，百镒黄金空。弹剑徒激昂，出门悲路穷。吾兄青云士，然诺闻诸公。所以陈片言，片言贵情通。棣华倘不接，甘与秋草同。"
                    },
                    {
                        name: "经乱离后天恩流夜郎忆旧游书怀赠江夏韦太守良宰·李白",
                        content: "天上白玉京，十二楼五城。仙人抚我顶，结发受长生。误逐世间乐，颇穷理乱情。九十六圣君，浮云挂空名。天地赌一掷，未能忘战争。试涉霸王略，将期轩冕荣。时命乃大谬，弃之海上行。学剑翻自哂，为文竟何成。剑非万人敌，文窃四海声。儿戏不足道，五噫出西京。临当欲去时，慷慨泪沾缨。叹君倜傥才，标举冠群英。开筵引祖帐，慰此远徂征。鞍马若浮云，送余骠骑亭。歌钟不尽意，白日落昆明。十月到幽州，戈鋋若罗星。君王弃北海，扫地借长鲸。呼吸走百川，燕然可摧倾。心知不得语，却欲栖蓬瀛。弯弧惧天狼，挟矢不敢张。揽涕黄金台，呼天哭昭王。无人贵骏骨，騄耳空腾骧。乐毅倘再生，于今亦奔亡。蹉跎不得意，驱马还贵乡。逢君听弦歌，肃穆坐华堂。百里独太古，陶然卧羲皇。征乐昌乐馆，开筵列壶觞。贤豪间青娥，对烛俨成行。醉舞纷绮席，清歌绕飞梁。欢娱未终朝，秩满归咸阳。祖道拥万人，供帐遥相望。一别隔千里，荣枯异炎凉。炎凉几度改，九土中横溃。汉甲连胡兵，沙尘暗云海。草木摇杀气，星辰无光彩。白骨成丘山，苍生竟何罪。函关壮帝居，国命悬哥舒。长戟三十万，开门纳凶渠。公卿如犬羊，忠谠醢与菹。二圣出游豫，两京遂丘墟。帝子许专征，秉旄控强楚。节制非桓文，军师拥熊虎。人心失去就，贼势腾风雨。惟君固房陵，诚节冠终古。仆卧香炉顶，餐霞漱瑶泉。门开九江转，枕下五湖连。半夜水军来，浔阳满旌旃。空名适自误，迫胁上楼船。徒赐五百金，弃之若浮烟。辞官不受赏，翻谪夜郎天。夜郎万里道，西上令人老。扫荡六合清，仍为负霜草。日月无偏照，何由诉苍昊。良牧称神明，深仁恤交道。一忝青云客，三登黄鹤楼。顾惭祢处士，虚对鹦鹉洲。樊山霸气尽，寥落天地秋。江带峨眉雪，川横三峡流。万舸此中来，连帆过扬州。送此万里目，旷然散我愁。纱窗倚天开，水树绿如发。窥日畏衔山，促酒喜得月。吴娃与越艳，窈窕夸铅红。呼来上云梯，含笑出帘栊。对客小垂手，罗衣舞春风。宾跪请休息，主人情未极。览君荆山作，江鲍堪动色。清水出芙蓉，天然去雕饰。逸兴横素襟，无时不招寻。朱门拥虎士，列戟何森森。剪凿竹石开，萦流涨清深。登台坐水阁，吐论多英音。片辞贵白璧，一诺轻黄金。谓我不愧君，青鸟明丹心。五色云间鹊，飞鸣天上来。传闻赦书至，却放夜郎回。暖气变寒谷，炎烟生死灰。君登凤池去，忽弃贾生才。桀犬尚吠尧，匈奴笑千秋。中夜四五叹，常为大国忧。旌旆夹两山，黄河当中流。连鸡不得进，饮马空夷犹。安得羿善射，一箭落旄头。"
                    },
                    {
                        name: "行路难·其一·李白",
                        content: "金樽清酒斗十千，玉盘珍羞直万钱。停杯投箸不能食，拔剑四顾心茫然。欲渡黄河冰塞川，将登太行雪满山。闲来垂钓碧溪上，忽复乘舟梦日边。行路难，行路难，多歧路，今安在？长风破浪会有时，直挂云帆济沧海。"
                    },
                    {
                        name: "行路难·其二·李白",
                        content: "大道如青天，我独不得出。羞逐长安社中儿，赤鸡白雉赌梨栗。弹剑作歌奏苦声，曳裾王门不称情。淮阴市井笑韩信，汉朝公卿忌贾生。君不见昔时燕家重郭隗，拥篲折节无嫌猜。剧辛乐毅感恩分，输肝剖胆效英才。昭王白骨萦蔓草，谁人更扫黄金台？行路难，归去来！"
                    },
                    {
                        name: "行路难·其三·李白",
                        content: "有耳莫洗颍川水，有口莫食首阳蕨。含光混世贵无名，何用孤高比云月？吾观自古贤达人，功成不退皆殒身。子胥既弃吴江上，屈原终投湘水滨。陆机雄才岂自保？李斯税驾苦不早。华亭鹤唳讵可闻？上蔡苍鹰何足道？君不见吴中张翰称达生，秋风忽忆江东行。且乐生前一杯酒，何须身后千载名？"
                    },
                    {
                        name: "将进酒·李白",
                        content: "君不见黄河之水天上来，奔流到海不复回。君不见高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯。岑夫子，丹丘生，将进酒，杯莫停。与君歌一曲，请君为我倾耳听。钟鼓馔玉不足贵，但愿长醉不愿醒。古来圣贤皆寂寞，惟有饮者留其名。陈王昔时宴平乐，斗酒十千恣欢谑。主人何为言少钱，径须沽取对君酌。五花马、千金裘，呼儿将出换美酒，与尔同销万古愁。"
                    },
                    {
                        name: "上李邕·李白",
                        content: "大鹏一日同风起，扶摇直上九万里。假令风歇时下来，犹能簸却沧溟水。世人见我恒殊调，闻余大言皆冷笑。宣父犹能畏后生，丈夫未可轻年少。"
                    },
                    {
                        name: "短歌行·李白",
                        content: "白日何短短，百年苦易满。苍穹浩茫茫，万劫太极长。麻姑垂两鬓，一半已成霜。天公见玉女，大笑亿千场。吾欲揽六龙，回车挂扶桑。北斗酌美酒，劝龙各一觞。富贵非所愿，与人驻颜光。"
                    },
                    {
                        name: "梦游天姥吟留别·李白",
                        content: "海客谈瀛洲，烟涛微茫信难求；越人语天姥，云霞明灭或可睹。天姥连天向天横，势拔五岳掩赤城。天台四万八千丈，对此欲倒东南倾。我欲因之梦吴越，一夜飞度镜湖月。湖月照我影，送我至剡溪。谢公宿处今尚在，渌水荡漾清猿啼。脚著谢公屐，身登青云梯。半壁见海日，空中闻天鸡。千岩万转路不定，迷花倚石忽已暝。熊咆龙吟殷岩泉，栗深林兮惊层巅。云青青兮欲雨，水澹澹兮生烟。列缺霹雳，丘峦崩摧。洞天石扉，訇然中开。青冥浩荡不见底，日月照耀金银台。霓为衣兮风为马，云之君兮纷纷而来下。虎鼓瑟兮鸾回车，仙之人兮列如麻。忽魂悸以魄动，恍惊起而长嗟。惟觉时之枕席，失向来之烟霞。世间行乐亦如此，古来万事东流水。别君去兮何时还？且放白鹿青崖间，须行即骑访名山。安能摧眉折腰事权贵，使我不得开心颜！"
                    },
                    {
                        name: "清平调·其一·李白",
                        content: "云想衣裳花想容，春风拂槛露华浓。若非群玉山头见，会向瑶台月下逢。"
                    },
                    {
                        name: "清平调·其二·李白",
                        content: "一枝秾艳露凝香，云雨巫山枉断肠。借问汉宫谁得似，可怜飞燕倚新妆。"
                    },
                    {
                        name: "清平调·其三·李白",
                        content: "名花倾国两相欢，长得君王带笑看。解释春风无限恨，沉香亭北倚阑干。"
                    },
                    {
                        name: "蜀道难·李白",
                        content: "噫吁嚱，危乎高哉！蜀道之难，难于上青天！蚕丛及鱼凫，开国何茫然！尔来四万八千岁，不与秦塞通人烟。西当太白有鸟道，可以横绝峨眉巅。地崩山摧壮士死，然后天梯石栈相钩连。上有六龙回日之高标，下有冲波逆折之回川。黄鹤之飞尚不得过，猿猱欲度愁攀援。青泥何盘盘，百步九折萦岩峦。扪参历井仰胁息，以手抚膺坐长叹。问君西游何时还？畏途巉岩不可攀。但见悲鸟号古木，雄飞雌从绕林间。又闻子规啼夜月，愁空山。蜀道之难，难于上青天，使人听此凋朱颜！连峰去天不盈尺，枯松倒挂倚绝壁。飞湍瀑流争喧豗，砯崖转石万壑雷。其险也如此，嗟尔远道之人胡为乎来哉！剑阁峥嵘而崔嵬，一夫当关，万夫莫开。所守或匪亲，化为狼与豺。朝避猛虎，夕避长蛇，磨牙吮血，杀人如麻。锦城虽云乐，不如早还家。蜀道之难，难于上青天，侧身西望长咨嗟！"
                    },
                    {
                        name: "三五七言·李白",
                        content: "秋风清，秋月明，落叶聚还散，寒鸦栖复惊。相思相见知何日？此时此夜难为情！"
                    },
                    {
                        name: "宣州谢朓楼饯别校书叔云·李白",
                        content: "弃我去者，昨日之日不可留；乱我心者，今日之日多烦忧。长风万里送秋雁，对此可以酣高楼。蓬莱文章建安骨，中间小谢又清发。俱怀逸兴壮思飞，欲上青天揽明月。抽刀断水水更流，举杯消愁愁更愁。人生在世不称意，明朝散发弄扁舟。"
                    },
                    {
                        name: "月下独酌·其一·李白",
                        content: "花间一壶酒，独酌无相亲。举杯邀明月，对影成三人。月既不解饮，影徒随我身。暂伴月将影，行乐须及春。我歌月徘徊，我舞影零乱。醒时同交欢，醉后各分散。永结无情游，相期邈云汉。"
                    },
                    {
                        name: "月下独酌·其二·李白",
                        content: "天若不爱酒，酒星不在天。地若不爱酒，地应无酒泉。天地既爱酒，爱酒不愧天。已闻清比圣，复道浊如贤。贤圣既已饮，何必求神仙。三杯通大道，一斗合自然。但得酒中趣，勿为醒者传。"
                    },
                    {
                        name: "月下独酌·其三·李白",
                        content: "三月咸阳城，千花昼如锦。谁能春独愁，对此径须饮。穷通与修短，造化夙所禀。一樽齐死生，万事固难审。醉後失天地，兀然就孤枕。不知有吾身，此乐最为甚。"
                    },
                    {
                        name: "月下独酌·其四·李白",
                        content: "穷愁千万端，美酒三百杯。愁多酒虽少，酒倾愁不来。所以知酒圣，酒酣心自开。辞粟卧首阳，屡空饥颜回。当代不乐饮，虚名安用哉。蟹螯即金液，糟丘是蓬莱。且须饮美酒，乘月醉高台。"
                    },
                    {
                        name: "临江王节士歌·李白",
                        content: "洞庭白波木叶稀，燕鸿始入吴云飞。吴云寒，燕鸿苦。风号沙宿潇湘浦，节士悲秋泪如雨。白日当天心，照之可以事明主。壮士愤，雄风生。安得倚天剑，跨海斩长鲸。"
                    },
                    {
                        name: "司马将军歌·李白",
                        content: "狂风吹古月，窃弄章华台。北落明星动光彩，南征猛将如云雷。手中电曳倚天剑，直斩长鲸海水开。我见楼船壮心目，颇似龙骧下三蜀。扬兵习战张虎旗，江中白浪如银屋。身居玉帐临河魁，紫髯若戟冠崔嵬，细柳开营揖天子，始知灞上为婴孩。羌笛横吹阿亸回，向月楼中吹落梅。将军自起舞长剑，壮士呼声动九垓。功成献凯见明主，丹青画像麒麟台。"
                    },
                    {
                        name: "早发白帝城·李白",
                        content: "朝辞白帝彩云间，千里江陵一日还。两岸猿声啼不住，轻舟已过万重山。"
                    },
                    {
                        name: "夜宿山寺·李白",
                        content: "危楼高百尺，手可摘星辰。不敢高声语，恐惊天上人。"
                    },
                    {
                        name: "把酒问月·故人贾淳令予问之·李白",
                        content: "青天有月来几时？我今停杯一问之。人攀明月不可得，月行却与人相随。皎如飞镜临丹阙，绿烟灭尽清辉发。但见宵从海上来，宁知晓向云间没。白兔捣药秋复春，嫦娥孤栖与谁邻？今人不见古时月，今月曾经照古人。古人今人若流水，共看明月皆如此。唯愿当歌对酒时，月光长照金樽里。"
                    },
                    {
                        name: "登金陵凤凰台·李白",
                        content: "凤凰台上凤凰游，凤去台空江自流。吴宫花草埋幽径，晋代衣冠成古丘。三山半落青天外，二水中分白鹭洲。总为浮云能蔽日，长安不见使人愁"
                    },
                    {
                        name: "峨眉山月歌·李白",
                        content: "峨眉山月半轮秋，影入平羌江水流。夜发清溪向三峡，思君不见下渝州。"
                    },
                    {
                        name: "南陵别儿童入京·李白",
                        content: "白酒新熟山中归，黄鸡啄黍秋正肥。呼童烹鸡酌白酒，儿女嬉笑牵人衣。高歌取醉欲自慰，起舞落日争光辉。游说万乘苦不早，著鞭跨马涉远道。会稽愚妇轻买臣，余亦辞家西入秦。仰天大笑出门去，我辈岂是蓬蒿人。"
                    },
                    {
                        name: "庐山谣寄卢侍御虚舟·李白",
                        content: "我本楚狂人，凤歌笑孔丘。手持绿玉杖，朝别黄鹤楼。五岳寻仙不辞远，一生好入名山游。庐山秀出南斗傍，屏风九叠云锦张，影落明湖青黛光。金阙前开二峰长，银河倒挂三石梁，香炉瀑布遥相望，回崖沓嶂凌苍苍。翠影红霞映朝日，鸟飞不到吴天长。登高壮观天地间，大江茫茫去不还。黄云万里动风色，白波九道流雪山。好为庐山谣，兴因庐山发。闲窥石镜清我心，谢公行处苍苔没。早服还丹无世情，琴心三叠道初成。遥见仙人彩云里，手把芙蓉朝玉京。先期汗漫九垓上，愿接卢敖游太清。"
                    },
                    {
                        name: "塞下曲六首·其一·李白",
                        content: "五月天山雪，无花只有寒。笛中闻折柳，春色未曾看。晓战随金鼓，宵眠抱玉鞍。愿将腰下剑，直为斩楼兰。"
                    },
                    {
                        name: "关山月·李白",
                        content: "明月出天山，苍茫云海间。长风几万里，吹度玉门关。汉下白登道，胡窥青海湾。由来征战地，不见有人还。戍客望边邑，思归多苦颜。高楼当此夜，叹息未应闲。"
                    },
                    {
                        name: "山中与幽人对酌·李白",
                        content: "两人对酌山花开，一杯一杯复一杯。我醉欲眠卿且去，明朝有意抱琴来。"
                    },
                    {
                        name: "春夜宴从弟桃花园序·李白",
                        content: "夫天地者万物之逆旅也；光阴者百代之过客也。而浮生若梦，为欢几何？古人秉烛夜游，良有以也。况阳春召我以烟景，大块假我以文章。会桃花之芳园，序天伦之乐事。群季俊秀，皆为惠连；吾人咏歌，独惭康乐。幽赏未已，高谈转清。开琼筵以坐花，飞羽觞而醉月。不有佳咏，何伸雅怀？如诗不成，罚依金谷酒数。"
                    },
                    {
                        name: "妾薄命·李白",
                        content: "汉帝重阿娇，贮之黄金屋。咳唾落九天，随风生珠玉。宠极爱还歇，妒深情却疏。长门一步地，不肯暂回车。雨落不上天，水覆难再收。君情与妾意，各自东西流。昔日芙蓉花，今成断根草。以色事他人，能得几时好。"
                    },
                    {
                        name: "黄鹤楼送孟浩然之广陵·李白",
                        content: "故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，唯见长江天际流。"
                    },
                    {
                        name: "春夜洛城闻笛·李白",
                        content: "谁家玉笛暗飞声，散入春风满洛城。此夜曲中闻折柳，何人不起故园情。"
                    },
                    {
                        name: "江夏别宋之悌·李白",
                        content: "楚水清若空，遥将碧海通。人分千里外，兴在一杯中。谷鸟吟晴日，江猿啸晚风。平生不下泪，于此泣无穷。"
                    },
                    {
                        name: "访戴天山道士不遇·李白",
                        content: "犬吠水声中，桃花带露浓。树深时见鹿，溪午不闻钟。野竹分青霭，飞泉挂碧峰。无人知所去，愁倚两三松。"
                    },
                    {
                        name: "怨情·李白",
                        content: "美人卷珠帘，深坐蹙蛾眉。但见泪痕湿，不知心恨谁。"
                    },
                    {
                        name: "长相思·其一·李白",
                        content: "长相思，在长安。络纬秋啼金井阑，微霜凄凄簟色寒。孤灯不明思欲绝，卷帷望月空长叹。美人如花隔云端！上有青冥之长天，下有渌水之波澜。天长路远魂飞苦，梦魂不到关山难。长相思，摧心肝！"
                    },
                    {
                        name: "长相思·其二·李白",
                        content: "日色欲尽花含烟，月明如素愁不眠。赵瑟初停凤凰柱，蜀琴欲奏鸳鸯弦。此曲有意无人传，愿随春风寄燕然。忆君迢迢隔青天。昔日横波目，今作流泪泉。不信妾断肠，归来看取明镜前。"
                    },
                    {
                        name: "送友人·李白",
                        content: "青山横北郭，白水绕东城。此地一为别，孤蓬万里征。浮云游子意，落日故人情。挥手自兹去，萧萧班马鸣。"
                    },
                    {
                        name: "金陵酒肆留别·李白",
                        content: "风吹柳花满店香，吴姬压酒劝客尝。金陵子弟来相送，欲行不行各尽觞。请君试问东流水，别意与之谁短长？"
                    },
                    {
                        name: "白马篇·李白",
                        content: "龙马花雪毛，金鞍五陵豪。秋霜切玉剑，落日明珠袍。斗鸡事万乘，轩盖一何高。弓摧南山虎，手接太行猱。酒后竞风采，三杯弄宝刀。杀人如剪草，剧孟同游遨。发愤去函谷，从军向临洮。叱咤经百战，匈奴尽奔逃。归来使酒气，未肯拜萧曹。羞入原宪室，荒径隐蓬蒿。"
                    },
                ]
            },
            {
                author:"苏轼",
                article:[
                    {
                        name: "赤壁赋·苏轼",
                        content: "壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞。’此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。"
                    },
                    {
                        name: "念奴娇·赤壁怀古·苏轼",
                        content:
                            "大江东去，浪淘尽，千古风流人物。故垒西边，人道是，三国周郎赤壁。乱石穿空，惊涛拍岸，卷起千堆雪。江山如画，一时多少豪杰。遥想公瑾当年，小乔初嫁了，雄姿英发。羽扇纶巾，谈笑间，樯橹灰飞烟灭。故国神游，多情应笑我，早生华发。人生如梦，一尊还酹江月。",
                    },
                    {
                        name: "江城子·密州出猎·苏轼",
                        content: "老夫聊发少年狂，左牵黄，右擎苍，锦帽貂裘，千骑卷平冈。为报倾城随太守，亲射虎，看孙郎。酒酣胸胆尚开张。鬓微霜，又何妨！持节云中，何日遣冯唐？会挽雕弓如满月，西北望，射天狼。"
                    },
                    {
                        name: "江城子·乙卯正月二十日夜记梦·苏轼",
                        content: "十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈。"
                    },
                    {
                        name: "定风波·莫听穿林打叶声·苏轼",
                        content: "三月七日，沙湖道中遇雨，雨具先去，同行皆狼狈，余独不觉。已而遂晴，莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。料峭春风吹酒醒，微冷，山头斜照却相迎。回首向来萧瑟处，归去，也无风雨也无晴。"
                    },
                    {
                        name: "定风波·南海归赠王定国侍人寓娘·苏轼",
                        content: "王定国歌儿曰柔奴，姓宇文氏，眉目娟丽，善应对，家世住京师。定国南迁归，余问柔：“广南风土， 应是不好？”柔对曰：“此心安处，便是吾乡。”因为缀词云。常羡人间琢玉郎，天应乞与点酥娘。尽道清歌传皓齿，风起，雪飞炎海变清凉。万里归来颜愈少。微笑，笑时犹带岭梅香。试问岭南应不好，却道：此心安处是吾乡。"
                    },
                    {
                        name: "望江南·超然台作·苏轼",
                        content: "春未老，风细柳斜斜。试上超然台上看，半壕春水一城花。烟雨暗千家。寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶。诗酒趁年华。"
                    },
                    {
                        name: "水调歌头·明月几时有·苏轼",
                        content: "丙辰中秋，欢饮达旦，大醉，作此篇，兼怀子由。明月几时有？把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间。转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。"
                    },
                    {
                        name: "水调歌头·黄州快哉亭赠张偓佺·苏轼",
                        content: "落日绣帘卷，亭下水连空。知君为我新作，窗户湿青红。长记平山堂上，欹枕江南烟雨，杳杳没孤鸿。认得醉翁语，山色有无中。一千顷，都镜净，倒碧峰。忽然浪起，掀舞一叶白头翁。堪笑兰台公子，未解庄生天籁，刚道有雌雄。一点浩然气，千里快哉风。"
                    },
                    {
                        name: "临江仙·送钱穆父·苏轼",
                        content: "一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。惆怅孤帆连夜发，送行淡月微云。尊前不用翠眉颦。人生如逆旅，我亦是行人。"
                    },
                    {
                        name: "临江仙·夜归临皋·苏轼",
                        content: "夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。"
                    },
                    {
                        name: "蝶恋花·春景·苏轼",
                        content: "花褪残红青杏小，燕子飞时，绿水人家绕。枝上柳绵吹又少，天涯何处无芳草。墙里秋千墙外道，墙外行人，墙里佳人笑。笑渐不闻声渐悄，多情却被无情恼。"
                    },
                    {
                        name: "饮湖上初晴后雨·其一·苏轼",
                        content: "朝曦迎客艳重冈，晚雨留人入醉乡。此意自佳君不会，一杯当属水仙王。"
                    },
                    {
                        name: "饮湖上初晴后雨·其二·苏轼",
                        content: "水光潋滟晴方好，山色空蒙雨亦奇。欲把西湖比西子，淡妆浓抹总相宜。"
                    },
                    {
                        name: "浣溪沙·游蕲水清泉寺·苏轼",
                        content: "游蕲水清泉寺，寺临兰溪，溪水西流。山下兰芽短浸溪，松间沙路净无泥，萧萧暮雨子规啼。谁道人生无再少？门前流水尚能西！休将白发唱黄鸡。"
                    },
                    {
                        name: "浣溪沙·渔父·苏轼",
                        content: "西塞山边白鹭飞，散花洲外片帆微。桃花流水鳜鱼肥。自庇一身青箬笠，相随到处绿蓑衣。斜风细雨不须归。"
                    },
                    {
                        name: "卜算子·黄州定慧院寓居作·苏轼",
                        content: "缺月挂疏桐，漏断人初静。谁见幽人独往来，缥缈孤鸿影。惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。"
                    },
                    {
                        name: "西江月·世事一场大梦·苏轼",
                        content: "世事一场大梦，人生几度秋凉？夜来风叶已鸣廊。看取眉头鬓上。酒贱常愁客少，月明多被云妨。中秋谁与共孤光。把盏凄然北望。"
                    },
                    {
                        name: "惠崇春江晚景·其一·苏轼",
                        content: "竹外桃花三两枝，春江水暖鸭先知。蒌蒿满地芦芽短，正是河豚欲上时。"
                    },
                    {
                        name: "惠崇春江晚景·其二·苏轼",
                        content: "两两归鸿欲破群，依依还似北归人。遥知朔漠多风雪，更待江南半月春。"
                    },
                    {
                        name: "春宵·苏轼",
                        content: "春宵一刻值千金，花有清香月有阴。歌管楼台声细细，秋千院落夜沉沉。"
                    },
                    {
                        name: "和子由渑池怀旧·苏轼",
                        content: "人生到处知何似，应似飞鸿踏雪泥。泥上偶然留指爪，鸿飞那复计东西。老僧已死成新塔，坏壁无由见旧题。往日崎岖还记否，路长人困蹇驴嘶。"
                    },
                    {
                        name: "和董传留别·苏轼",
                        content: "粗缯大布裹生涯，腹有诗书气自华。厌伴老儒烹瓠叶，强随举子踏槐花。囊空不办寻春马，眼乱行看择婿车。得意犹堪夸世俗，诏黄新湿字如鸦。"
                    },
                ]
            },
            {
                author:"杜甫",
                article:[
                    {
                        name: "茅屋为秋风所破歌·杜甫",
                        content: "八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼。公然抱茅入竹去，唇焦口燥呼不得，归来倚杖自叹息。俄顷风定云墨色，秋天漠漠向昏黑。布衾多年冷似铁，娇儿恶卧踏里裂。床头屋漏无干处，雨脚如麻未断绝。自经丧乱少睡眠，长夜沾湿何由彻！安得广厦千万间，大庇天下寒士俱欢颜！风雨不动安如山。呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！"
                    },
                    {
                        name: "春望·杜甫",
                        content: "国破山河在，城春草木深。感时花溅泪，恨别鸟惊心。烽火连三月，家书抵万金。白头搔更短，浑欲不胜簪。"
                    },
                    {
                        name: "蜀相·杜甫",
                        content: "丞相祠堂何处寻？锦官城外柏森森。映阶碧草自春色，隔叶黄鹂空好音。三顾频烦天下计，两朝开济老臣心。出师未捷身先死，长使英雄泪满襟。"
                    },
                    {
                        name: "石壕吏·杜甫",
                        content: "暮投石壕村，有吏夜捉人。老翁逾墙走，老妇出门看。吏呼一何怒！妇啼一何苦！听妇前致词：三男邺城戍。一男附书至，二男新战死。存者且偷生，死者长已矣！室中更无人，惟有乳下孙。有孙母未去，出入无完裙。老妪力虽衰，请从吏夜归。急应河阳役，犹得备晨炊。夜久语声绝，如闻泣幽咽。天明登前途，独与老翁别。"
                    },
                    {
                        name: "赠卫八处士·杜甫",
                        content: "人生不相见，动如参与商。今夕复何夕，共此灯烛光。少壮能几时，鬓发各已苍。访旧半为鬼，惊呼热中肠。焉知二十载，重上君子堂。昔别君未婚，儿女忽成行。怡然敬父执，问我来何方。问答乃未已，驱儿罗酒浆。夜雨剪春韭，新炊间黄粱。主称会面难，一举累十觞。十觞亦不醉，感子故意长。明日隔山岳，世事两茫茫。"
                    },
                    {
                        name: "登高·杜甫",
                        content: "风急天高猿啸哀，渚清沙白鸟飞回。无边落木萧萧下，不尽长江滚滚来。万里悲秋常作客，百年多病独登台。艰难苦恨繁霜鬓，潦倒新停浊酒杯。"
                    },
                    {
                        name: "春夜喜雨·杜甫",
                        content: "好雨知时节，当春乃发生。随风潜入夜，润物细无声。野径云俱黑，江船火独明。晓看红湿处，花重锦官城。"
                    },
                    {
                        name: "望岳·杜甫",
                        content: "岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。荡胸生曾云，决眦入归鸟。会当凌绝顶，一览众山小。"
                    },
                    {
                        name: "闻官军收河南河北·杜甫",
                        content: "剑外忽传收蓟北，初闻涕泪满衣裳。却看妻子愁何在，漫卷诗书喜欲狂。白日放歌须纵酒，青春作伴好还乡。即从巴峡穿巫峡，便下襄阳向洛阳。"
                    },
                    {
                        name: "春日忆李白·杜甫",
                        content: "白也诗无敌，飘然思不群。清新庾开府，俊逸鲍参军。渭北春天树，江东日暮云。何时一樽酒，重与细论文。"
                    },
                    {
                        name: "梦李白二首·其一·杜甫",
                        content: "死别已吞声，生别常恻恻。江南瘴疠地，逐客无消息。故人入我梦，明我长相忆。君今在罗网，何以有羽翼？恐非平生魂，路远不可测。魂来枫林青，魂返关塞黑。落月满屋梁，犹疑照颜色。水深波浪阔，无使蛟龙得。"
                    },
                    {
                        name: "梦李白二首·其二·杜甫",
                        content: "浮云终日行，游子久不至。三夜频梦君，情亲见君意。告归常局促，苦道来不易。江湖多风波，舟楫恐失坠。出门搔白首，若负平生志。冠盖满京华，斯人独憔悴。孰云网恢恢，将老身反累。千秋万岁名，寂寞身后事。"
                    },
                    {
                        name: "江南逢李龟年·杜甫",
                        content: "岐王宅里寻常见，崔九堂前几度闻。正是江南好风景，落花时节又逢君。"
                    },
                    {
                        name: "八阵图·杜甫",
                        content: "功盖三分国，名成八阵图。江流石不转，遗恨失吞吴。"
                    },
                    {
                        name: "饮中八仙歌·杜甫",
                        content: "知章骑马似乘船，眼花落井水底眠。汝阳三斗始朝天，道逢麴车口流涎，恨不移封向酒泉。左相日兴费万钱，饮如长鲸吸百川，衔杯乐圣称避贤。宗之潇洒美少年，举觞白眼望青天，皎如玉树临风前。苏晋长斋绣佛前，醉中往往爱逃禅。李白斗酒诗百篇，长安市上酒家眠，天子呼来不上船，自称臣是酒中仙。张旭三杯草圣传，脱帽露顶王公前，挥毫落纸如云烟。焦遂五斗方卓然，高谈雄辩惊四筵。"
                    },
                    {
                        name: "前出塞九首·其六·杜甫",
                        content: "挽弓当挽强，用箭当用长。射人先射马，擒贼先擒王。杀人亦有限，列国自有疆。苟能制侵陵，岂在多杀伤。"
                    },
                    {
                        name: "奉赠韦左丞丈二十二韵·杜甫",
                        content: "纨绔不饿死，儒冠多误身。丈人试静听，贱子请具陈。甫昔少年日，早充观国宾。读书破万卷，下笔如有神。赋料扬雄敌，诗看子建亲。李邕求识面，王翰愿卜邻。自谓颇挺出，立登要路津。致君尧舜上，再使风俗淳。此意竟萧条，行歌非隐沦。骑驴十三载，旅食京华春。朝扣富儿门，暮随肥马尘。残杯与冷炙，到处潜悲辛。主上顷见征，欻然欲求伸。青冥却垂翅，蹭蹬无纵鳞。甚愧丈人厚，甚知丈人真。每于百僚上，猥诵佳句新。窃效贡公喜，难甘原宪贫。焉能心怏怏，只是走踆踆。今欲东入海，即将西去秦。尚怜终南山，回首清渭滨。常拟报一饭，况怀辞大臣。白鸥没浩荡，万里谁能驯？"
                    },
                    {
                        name: "狂夫·杜甫",
                        content: "万里桥西一草堂，百花潭水即沧浪。风含翠篠娟娟净，雨裛红蕖冉冉香。厚禄故人书断绝，恒饥稚子色凄凉。欲填沟壑唯疏放，自笑狂夫老更狂。"
                    },
                    {
                        name: "江畔独步寻花七绝句·杜甫",
                        content: "江上被花恼不彻，无处告诉只颠狂。走觅南邻爱酒伴，经旬出饮独空床。稠花乱蕊畏江滨，行步欹危实怕春。诗酒尚堪驱使在，未须料理白头人。江深竹静两三家，多事红花映白花。报答春光知有处，应须美酒送生涯。东望少城花满烟，百花高楼更可怜。谁能载酒开金盏，唤取佳人舞绣筵。黄师塔前江水东，春光懒困倚微风。桃花一簇开无主，可爱深红爱浅红？黄四娘家花满蹊，千朵万朵压枝低。留连戏蝶时时舞，自在娇莺恰恰啼。不是爱花即欲死，只恐花尽老相催。繁枝容易纷纷落，嫩蕊商量细细开。"
                    },
                    {
                        name: "佳人·杜甫",
                        content: "绝代有佳人，幽居在空谷。自云良家子，零落依草木。关中昔丧乱，兄弟遭杀戮。官高何足论，不得收骨肉。世情恶衰歇，万事随转烛。夫婿轻薄儿，新人美如玉。合昏尚知时，鸳鸯不独宿。但见新人笑，那闻旧人哭。在山泉水清，出山泉水浊。侍婢卖珠回，牵萝补茅屋。摘花不插发，采柏动盈掬。天寒翠袖薄，日暮倚修竹。"
                    },
                    {
                        name: "绝句·其一·杜甫",
                        content: "迟日江山丽，春风花草香。泥融飞燕子，沙暖睡鸳鸯。"
                    },
                    {
                        name: "绝句·其二·杜甫",
                        content: "江碧鸟逾白，山青花欲燃。今春看又过，何日是归年。"
                    },
                    {
                        name: "月夜忆舍弟·杜甫",
                        content: "戍鼓断人行，边秋一雁声。露从今夜白，月是故乡明。有弟皆分散，无家问死生。寄书长不达，况乃未休兵。"
                    },
                    {
                        name: "自京赴奉先县咏怀五百字·杜甫",
                        content: "杜陵有布衣，老大意转拙。许身一何愚，窃比稷与契。居然成濩落，白首甘契阔。盖棺事则已，此志常觊豁。穷年忧黎元，叹息肠内热。取笑同学翁，浩歌弥激烈。非无江海志，潇洒送日月。生逢尧舜君，不忍便永诀。当今廊庙具，构厦岂云缺。葵藿倾太阳，物性固难夺。顾惟蝼蚁辈，但自求其穴。胡为慕大鲸，辄拟偃溟渤。以兹误生理，独耻事干谒。兀兀遂至今，忍为尘埃没。终愧巢与由，未能易其节。沉饮聊自遣，放歌破愁绝。岁暮百草零，疾风高冈裂。天衢阴峥嵘，客子中夜发。霜严衣带断，指直不得结。凌晨过骊山，御榻在嵽嵲。蚩尤塞寒空，蹴蹋崖谷滑。瑶池气郁律，羽林相摩戛。君臣留欢娱，乐动殷胶葛。赐浴皆长缨，与宴非短褐。彤庭所分帛，本自寒女出。鞭挞其夫家，聚敛贡城阙。圣人筐篚恩，实欲邦国活。臣如忽至理，君岂弃此物。多士盈朝廷，仁者宜战栗。况闻内金盘，尽在卫霍室。中堂舞神仙，烟雾散玉质。煖客貂鼠裘，悲管逐清瑟。劝客驼蹄羹，霜橙压香橘。朱门酒肉臭，路有冻死骨。荣枯咫尺异，惆怅难再述。北辕就泾渭，官渡又改辙。群冰从西下，极目高崒兀。疑是崆峒来，恐触天柱折。河梁幸未坼，枝撑声窸窣。行旅相攀援，川广不可越。老妻寄异县，十口隔风雪。谁能久不顾，庶往共饥渴。入门闻号啕，幼子饥已卒。吾宁舍一哀，里巷亦呜咽。所愧为人父，无食致夭折。岂知秋禾登，贫窭有仓卒。生常免租税，名不隶征伐。抚迹犹酸辛，平人固骚屑。默思失业徒，因念远戍卒。忧端齐终南，澒洞不可掇。"
                    },
                ]
            },
            {
                author:"辛弃疾",
                article:[
                    {
                        name: "破阵子·为陈同甫赋壮词以寄之·辛弃疾",
                        content: "醉里挑灯看剑，梦回吹角连营。八百里分麾下炙，五十弦翻塞外声，沙场秋点兵。马作的卢飞快，弓如霹雳弦惊。了却君王天下事，赢得生前身后名。可怜白发生！"
                    },
                    {
                        name: "破阵子·掷地刘郎玉斗·辛弃疾",
                        content: "为范南伯寿。时南伯为张南轩辟宰泸溪，南伯迟迟未行。因作此词以勉之。掷地刘郎玉斗，挂帆西子扁舟。千古风流今在此，万里功名莫放休。君王三百州。燕雀岂知鸿鹄，貂蝉元出兜鍪。却笑泸溪如斗大，肯把牛刀试手不？寿君双玉瓯。"
                    },
                    {
                        name: "青玉案·元夕·辛弃疾",
                        content: "东风夜放花千树，更吹落、星如雨。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。"
                    },
                    {
                        name: "丑奴儿·书博山道中壁·辛弃疾",
                        content: "少年不识愁滋味，爱上层楼。爱上层楼，为赋新词强说愁。而今识尽愁滋味，欲说还休。欲说还休，却道“天凉好个秋”！"
                    },
                    {
                        name: "永遇乐·京口北固亭怀古·辛弃疾",
                        content: "千古江山，英雄无觅孙仲谋处。舞榭歌台，风流总被雨打风吹去。斜阳草树，寻常巷陌，人道寄奴曾住。想当年，金戈铁马，气吞万里如虎。元嘉草草，封狼居胥，赢得仓皇北顾。四十三年，望中犹记，烽火扬州路。可堪回首，佛狸祠下，一片神鸦社鼓。凭谁问：廉颇老矣，尚能饭否？"
                    },
                    {
                        name: "南乡子·登京口北固亭有怀·辛弃疾",
                        content: "何处望神州？满眼风光北固楼。千古兴亡多少事？悠悠。不尽长江滚滚流。年少万兜鍪，坐断东南战未休。天下英雄谁敌手？曹刘。生子当如孙仲谋。"
                    },
                    {
                        name: "西江月·夜行黄沙道中·辛弃疾",
                        content: "明月别枝惊鹊，清风半夜鸣蝉。稻花香里说丰年，听取蛙声一片。七八个星天外，两三点雨山前。旧时茅店社林边，路转溪桥忽见。"
                    },
                    {
                        name: "鹧鸪天·送人·辛弃疾",
                        content: "唱彻《阳关》泪未干，功名馀事且加餐。浮天水送无穷树，带雨云埋一半山。今古恨，几千般，只应离合是悲欢？江头未是风波恶，别有人间行路难！"
                    },
                    {
                        name: "鹧鸪天·代人赋·辛弃疾",
                        content: "晚日寒鸦一片愁。柳塘新绿却温柔。若教眼底无离恨，不信人间有白头。肠已断，泪难收。相思重上小红楼。情知已被山遮断，频倚阑干不自由。"
                    },
                    {
                        name: "鹧鸪天·送廓之秋试·辛弃疾",
                        content: "白苎新袍入嫩凉。春蚕食叶响回廊。禹门已准桃花浪，月殿先收桂子香。鹏北海，凤朝阳。又携书剑路茫茫。明年此日青云上，却笑人间举子忙。"
                    },
                    {
                        name: "一剪梅·中秋无月·辛弃疾",
                        content: "忆对中秋丹桂丛，花在杯中，月在杯中。今宵楼上一尊同，云湿纱窗，雨湿纱窗。浑欲乘风问化工，路也难通，信也难通。满堂唯有烛花红，杯且从容，歌且从容。"
                    },
                    {
                        name: "贺新郎·同父见和再用韵答之·辛弃疾",
                        content: "老大那堪说。似而今、元龙臭味，孟公瓜葛。我病君来高歌饮，惊散楼头飞雪。笑富贵千钧如发。硬语盘空谁来听？记当时、只有西窗月。重进酒，换鸣瑟。事无两样人心别。问渠侬：神州毕竟，几番离合？汗血盐车无人顾，千里空收骏骨。正目断关河路绝。我最怜君中宵舞，道“男儿到死心如铁”。看试手，补天裂。"
                    },
                    {
                        name: "贺新郎·甚矣吾衰矣·辛弃疾",
                        content: "邑中园亭，仆皆为赋此词。一日，独坐停云，水声山色，竞来相娱。意溪山欲援例者，遂作数语，庶几仿佛渊明思亲友之意云。甚矣吾衰矣。怅平生、交游零落，只今余几！白发空垂三千丈，一笑人间万事。问何物、能令公喜？我见青山多妩媚，料青山见我应如是。情与貌，略相似。一尊搔首东窗里。想渊明、停云诗就，此时风味。江左沉酣求名者，岂识浊醪妙理。回首叫、云飞风起。不恨古人吾不见，恨古人不见吾狂耳。知我者，二三子。"
                    },
                    {
                        name: "贺新郎·别茂嘉十二弟·辛弃疾",
                        content: "别茂嘉十二弟。鹈鴂、杜鹃实两种，见《离骚补注》绿树听鹈鴂。更那堪、鹧鸪声住，杜鹃声切。啼到春归无寻处，苦恨芳菲都歇。算未抵、人间离别。马上琵琶关塞黑，更长门、翠辇辞金阙。看燕燕，送归妾。将军百战身名裂。向河梁、回头万里，故人长绝。易水萧萧西风冷，满座衣冠似雪。正壮士、悲歌未彻。啼鸟还知如许恨，料不啼清泪长啼血。谁共我，醉明月。"
                    },
                    {
                        name: "水调歌头·和马叔度游月波楼·辛弃疾",
                        content: "客子久不到，好景为君留。西楼着意吟赏，何必问更筹？唤起一天明月，照我满怀冰雪，浩荡百川流。鲸饮未吞海，剑气已横秋。野光浮，天宇迥，物华幽。中州遗恨，不知今夜几人愁？谁念英雄老矣？不道功名蕞尔，决策尚悠悠。此事费分说，来日且扶头！"
                    },
                    {
                        name: "水调歌头·我饮不须劝·辛弃疾",
                        content: "淳熙丁酉，自江陵移帅隆兴，到官之三月被召，司马监、赵卿、王漕饯别。司马赋《水调歌头》，席间次韵。时王公明枢密薨，坐客终夕为兴门户之叹，故前章及之。我饮不须劝，正怕酒樽空。别离亦复何恨？此别恨匆匆。头上貂蝉贵客，苑外麒麟高冢，人世竟谁雄？一笑出门去，千里落花风。孙刘辈，能使我，不为公。余发种种如是，此事付渠侬。但觉平生湖海，除了醉吟风月，此外百无功。毫发皆帝力，更乞鉴湖东。"
                    },
                    {
                        name: "摸鱼儿·更能消几番风雨·辛弃疾",
                        content: "淳熙己亥，自湖北漕移湖南，同官王正之置酒小山亭，为赋。更能消、几番风雨，匆匆春又归去。惜春长怕花开早，何况落红无数。春且住，见说道、天涯芳草无归路。怨春不语。算只有殷勤，画檐蛛网，尽日惹飞絮。长门事，准拟佳期又误。蛾眉曾有人妒。千金纵买相如赋，脉脉此情谁诉？君莫舞，君不见、玉环飞燕皆尘土！闲愁最苦！休去倚危栏，斜阳正在，烟柳断肠处。"
                    },
                    {
                        name: "玉楼春·风前欲劝春光住·辛弃疾",
                        content: "风前欲劝春光住。春在城南芳草路。未随流落水边花，且作飘零泥上絮。镜中已觉星星误。人不负春春自负。梦回人远许多愁，只在梨花风雨处。"
                    },
                    {
                        name: "菩萨蛮·书江西造口壁·辛弃疾",
                        content: "郁孤台下清江水，中间多少行人泪。西北望长安，可怜无数山。青山遮不住，毕竟东流去。江晚正愁予，山深闻鹧鸪。"
                    },
                    {
                        name: "太常引·建康中秋夜为吕叔潜赋·辛弃疾",
                        content: "一轮秋影转金波，飞镜又重磨。把酒问姮娥：被白发，欺人奈何？乘风好去，长空万里，直下看山河。斫去桂婆娑，人道是，清光更多。"
                    },
                    {
                        name: "清平乐·村居·辛弃疾",
                        content: "茅檐低小，溪上青青草。醉里吴音相媚好，白发谁家翁媪？大儿锄豆溪东，中儿正织鸡笼。最喜小儿亡赖，溪头卧剥莲蓬。"
                    },
                    {
                        name: "虞美人·赋虞美人草·辛弃疾",
                        content: "当年得意如芳草。日日春风好。拔山力尽忽悲歌。饮罢虞兮从此、奈君何。人间不识精诚苦。贪看青青舞。蓦然敛袂却亭亭。怕是曲中犹带、楚歌声。"
                    },
                    {
                        name: "沁园春·和吴尉子似·辛弃疾",
                        content: "我见君来，顿觉吾庐，溪山美哉。怅平生肝胆，都成楚越，只今胶漆，谁是陈雷。搔首踟蹰，爱而不见，要得诗来渴望梅。还知否，快清风入手，日看千回。直须抖擞尘埃。人怪我柴门今始开。向松间乍可，从他喝道：庭中且莫，踏破苍苔。岂有文章，谩劳车马，待唤青刍白饭来。君非我，任功名意气，莫恁徘徊。"
                    },
                ]
            },
            {
                author:"王勃",
                article:[
                    {
                        name: "滕王阁序·王勃",
                        content: "豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿。临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨，雁阵惊寒，声断衡阳之浦。遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？呜呼！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔。滕王高阁临江渚，佩玉鸣鸾罢歌舞。画栋朝飞南浦云，珠帘暮卷西山雨。闲云潭影日悠悠，物换星移几度秋。阁中帝子今何在？槛外长江空自流。"
                    },
                    {
                        name: "送杜少府之任蜀州·王勃",
                        content: "城阙辅三秦，风烟望五津。与君离别意，同是宦游人。海内存知己，天涯若比邻。无为在歧路，儿女共沾巾。"
                    },
                    {
                        name: "别薛华·王勃",
                        content: "送送多穷路，遑遑独问津。悲凉千里道，凄断百年身。心事同漂泊，生涯共苦辛。无论去与住，俱是梦中人。"
                    },
                    {
                        name: "秋夜长·王勃",
                        content: "秋夜长，殊未央，月明白露澄清光，层城绮阁遥相望。遥相望，川无梁，北风受节南雁翔，崇兰委质时菊芳。鸣环曳履出长廊，为君秋夜捣衣裳。纤罗对凤凰，丹绮双鸳鸯，调砧乱杵思自伤。思自伤，征夫万里戍他乡。鹤关音信断，龙门道路长。君在天一方，寒衣徒自香。"
                    },
                ]
            },
            {
                author:"陆游",
                article:[
                    {
                        name:"卜算子·咏梅·陆游",
                        content:"驿外断桥边，寂寞开无主。已是黄昏独自愁，更着风和雨。无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。"
                    },
                    {
                        name:"游山西村·陆游",
                        content:"莫笑农家腊酒浑，丰年留客足鸡豚。山重水复疑无路，柳暗花明又一村。箫鼓追随春社近，衣冠简朴古风存。从今若许闲乘月，拄杖无时夜叩门。"
                    },
                    {
                        name:"钗头凤·红酥手·陆游",
                        content:"红酥手，黄縢酒，满城春色宫墙柳。东风恶，欢情薄。一怀愁绪，几年离索。错、错、错。春如旧，人空瘦，泪痕红浥鲛绡透。桃花落，闲池阁。山盟虽在，锦书难托。莫、莫、莫！"
                    },
                    {
                        name:"冬夜读书示子聿·陆游",
                        content:"古人学问无遗力，少壮工夫老始成。纸上得来终觉浅，绝知此事要躬行。"
                    },
                    {
                        name:"十一月四日风雨大作·其二·陆游",
                        content:"僵卧孤村不自哀，尚思为国戍轮台。夜阑卧听风吹雨，铁马冰河入梦来。"
                    },
                    {
                        name:"书愤·陆游",
                        content:"早岁那知世事艰，中原北望气如山。楼船夜雪瓜洲渡，铁马秋风大散关。塞上长城空自许，镜中衰鬓已先斑。出师一表真名世，千载谁堪伯仲间！"
                    },
                    {
                        name:"病起书怀·陆游",
                        content:"病骨支离纱帽宽，孤臣万里客江干。位卑未敢忘忧国，事定犹须待阖棺。天地神灵扶庙社，京华父老望和銮。出师一表通今古，夜半挑灯更细看。"
                    },
                    {
                        name:"剑门道中遇微雨·陆游",
                        content:"衣上征尘杂酒痕，远游无处不消魂。此身合是诗人未？细雨骑驴入剑门。"
                    },
                    {
                        name:"沈园二首·其一·陆游",
                        content:"城上斜阳画角哀，沈园非复旧池台。伤心桥下春波绿，曾是惊鸿照影来。"
                    },
                    {
                        name:"除夜雪·陆游",
                        content:"北风吹雪四更初，嘉瑞天教及岁除。半盏屠苏犹未举，灯前小草写桃符。"
                    },
                    {
                        name:"临安春雨初霁·陆游",
                        content:"世味年来薄似纱，谁令骑马客京华。小楼一夜听春雨，深巷明朝卖杏花。矮纸斜行闲作草，晴窗细乳戏分茶。素衣莫起风尘叹，犹及清明可到家。"
                    },
                    {
                        name:"诉衷情·当年万里觅封侯·陆游",
                        content:"当年万里觅封侯，匹马戍梁州。关河梦断何处？尘暗旧貂裘。胡未灭，鬓先秋，泪空流。此生谁料，心在天山，身老沧洲。"
                    },
                ]
            },
            {
                author:"白居易",
                article:[
                    {
                        name: "长恨歌·白居易",
                        content: "汉皇重色思倾国，御宇多年求不得。杨家有女初长成，养在深闺人未识。天生丽质难自弃，一朝选在君王侧。回眸一笑百媚生，六宫粉黛无颜色。春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。承欢侍宴无闲暇，春从春游夜专夜。后宫佳丽三千人，三千宠爱在一身。金屋妆成娇侍夜，玉楼宴罢醉和春。姊妹弟兄皆列土，可怜光彩生门户。遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。缓歌慢舞凝丝竹，尽日君王看不足。渔阳鼙鼓动地来，惊破霓裳羽衣曲。九重城阙烟尘生，千乘万骑西南行。翠华摇摇行复止，西出都门百余里。六军不发无奈何，宛转蛾眉马前死。花钿委地无人收，翠翘金雀玉搔头。君王掩面救不得，回看血泪相和流。黄埃散漫风萧索，云栈萦纡登剑阁。峨嵋山下少人行，旌旗无光日色薄。蜀江水碧蜀山青，圣主朝朝暮暮情。行宫见月伤心色，夜雨闻铃肠断声。天旋地转回龙驭，到此踌躇不能去。马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂？春风桃李花开日，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。梨园弟子白发新，椒房阿监青娥老。夕殿萤飞思悄然，孤灯挑尽未成眠。迟迟钟鼓初长夜，耿耿星河欲曙天。鸳鸯瓦冷霜华重，翡翠衾寒谁与共？悠悠生死别经年，魂魄不曾来入梦临邛道士鸿都客，能以精诚致魂魄为感君王辗转思，遂教方士殷勤觅排空驭气奔如电，升天入地求之遍上穷碧落下黄泉，两处茫茫皆不见忽闻海上有仙山，山在虚无缥缈间楼阁玲珑五云起，其中绰约多仙子中有一人字太真，雪肤花貌参差是金阙西厢叩玉扃，转教小玉报双成闻道汉家天子使，九华帐里梦魂惊揽衣推枕起徘徊，珠箔银屏迤逦开云鬓半偏新睡觉，花冠不整下堂来。风吹仙袂飘飖举，犹似霓裳羽衣舞。玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。惟将旧物表深情，钿合金钗寄将去。钗留一股合一扇，钗擘黄金合分钿。但令心似金钿坚，天上人间会相见。临别殷勤重寄词，词中有誓两心知。七月七日长生殿，夜半无人私语时。在天愿作比翼鸟，在地愿为连理枝。天长地久有时尽，此恨绵绵无绝期。"
                    },
                    {
                        name: "琵琶行·白居易",
                        content: "元和十年，予左迁九江郡司马。明年秋，送客湓浦口，闻舟中夜弹琵琶者，听其音，铮铮然有京都声。问其人，本长安倡女，尝学琵琶于穆、曹二善才，年长色衰，委身为贾人妇。遂命酒，使快弹数曲。曲罢悯然，自叙少小时欢乐事，今漂沦憔悴，转徙于江湖间。予出官二年，恬然自安，感斯人言，是夕始觉有迁谪意。因为长句，歌以赠之，凡六百一十六言，命曰《琵琶行》。浔阳江头夜送客，枫叶荻花秋瑟瑟。主人下马客在船，举酒欲饮无管弦。醉不成欢惨将别，别时茫茫江浸月。忽闻水上琵琶声，主人忘归客不发。寻声暗问弹者谁，琵琶声停欲语迟。移船相近邀相见，添酒回灯重开宴。千呼万唤始出来，犹抱琵琶半遮面。转轴拨弦三两声，未成曲调先有情。弦弦掩抑声声思，似诉平生不得志。低眉信手续续弹，说尽心中无限事。轻拢慢捻抹复挑，初为《霓裳》后《六幺》。大弦嘈嘈如急雨，小弦切切如私语。嘈嘈切切错杂弹，大珠小珠落玉盘。间关莺语花底滑，幽咽泉流冰下难。冰泉冷涩弦凝绝，凝绝不通声暂歇。别有幽愁暗恨生，此时无声胜有声。银瓶乍破水浆迸，铁骑突出刀枪鸣。曲终收拨当心画，四弦一声如裂帛。东船西舫悄无言，唯见江心秋月白。沉吟放拨插弦中，整顿衣裳起敛容。自言本是京城女，家在虾蟆陵下住。十三学得琵琶成，名属教坊第一部。曲罢曾教善才服，妆成每被秋娘妒。五陵年少争缠头，一曲红绡不知数。钿头银篦击节碎，血色罗裙翻酒污。今年欢笑复明年，秋月春风等闲度。弟走从军阿姨死，暮去朝来颜色故。门前冷落鞍马稀，老大嫁作商人妇。商人重利轻别离，前月浮梁买茶去。去来江口守空船，绕船月明江水寒。夜深忽梦少年事，梦啼妆泪红阑干。我闻琵琶已叹息，又闻此语重唧唧。同是天涯沦落人，相逢何必曾相识！我从去年辞帝京，谪居卧病浔阳城。浔阳地僻无音乐，终岁不闻丝竹声。住近湓江地低湿，黄芦苦竹绕宅生。其间旦暮闻何物？杜鹃啼血猿哀鸣。春江花朝秋月夜，往往取酒还独倾。岂无山歌与村笛，呕哑嘲哳难为听。今夜闻君琵琶语，如听仙乐耳暂明。莫辞更坐弹一曲，为君翻作《琵琶行》。感我此言良久立，却坐促弦弦转急。凄凄不似向前声，满座重闻皆掩泣。座中泣下谁最多？江州司马青衫湿。"
                    },
                    {
                        name: "梦微之·白居易",
                        content: "夜来携手梦同游，晨起盈巾泪莫收。漳浦老身三度病，咸阳宿草八回秋。君埋泉下泥销骨，我寄人间雪满头。阿卫韩郎相次去，夜台茫昧得知不？"
                    },
                    {
                        name: "忆江南·其一·白居易",
                        content: "江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？"
                    },
                    {
                        name: "忆江南·其二·白居易",
                        content: "江南忆，最忆是杭州。山寺月中寻桂子，郡亭枕上看潮头。何日更重游？"
                    },
                    {
                        name: "忆江南·其三·白居易",
                        content: "江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉。早晚复相逢？"
                    },
                    {
                        name: "问刘十九·白居易",
                        content: "绿蚁新醅酒，红泥小火炉。晚来天欲雪，能饮一杯无？"
                    },
                    {
                        name: "观刈麦·白居易",
                        content: "田家少闲月，五月人倍忙。夜来南风起，小麦覆陇黄。妇姑荷箪食，童稚携壶浆，相随饷田去，丁壮在南冈。足蒸暑土气，背灼炎天光，力尽不知热，但惜夏日长。复有贫妇人，抱子在其旁，右手秉遗穗，左臂悬敝筐。听其相顾言，闻者为悲伤。家田输税尽，拾此充饥肠。今我何功德？曾不事农桑。吏禄三百石，岁晏有余粮，念此私自愧，尽日不能忘。"
                    },
                    {
                        name: "钱塘湖春行·白居易",
                        content: "孤山寺北贾亭西，水面初平云脚低。几处早莺争暖树，谁家新燕啄春泥。乱花渐欲迷人眼，浅草才能没马蹄。最爱湖东行不足，绿杨阴里白沙堤。"
                    },
                    {
                        name: "长相思·汴水流·白居易",
                        content: "汴水流，泗水流，流到瓜州古渡头。吴山点点愁。思悠悠，恨悠悠，恨到归时方始休。月明人倚楼。"
                    },
                    {
                        name: "夜雨·白居易",
                        content: "我有所念人，隔在远远乡。我有所感事，结在深深肠。乡远去不得，无日不瞻望。肠深解不得，无夕不思量。况此残灯夜，独宿在空堂。秋天殊未晓，风雨正苍苍。不学头陀法，前心安可忘。"
                    },
                    {
                        name: "暮江吟·白居易",
                        content: "一道残阳铺水中，半江瑟瑟半江红。可怜九月初三夜，露似真珠"
                    },
                    {
                        name: "浪淘沙·借问江潮与海水·白居易",
                        content: "借问江潮与海水，何似君情与妾心？相恨不如潮有信，相思始觉海非深。"
                    },
                    {
                        name: "赋得古原草送别·白居易",
                        content: "离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。"
                    },
                    {
                        name: "望月有感·白居易",
                        content: "自河南经乱，关内阻饥，兄弟离散，各在一处。因望月有感，聊书所怀，寄上浮梁大兄、於潜七兄、乌江十五兄，兼示符离及下邽弟妹。时难年荒世业空，弟兄羁旅各西东。田园寥落干戈后，骨肉流离道路中。吊影分为千里雁，辞根散作九秋蓬。共看明月应垂泪，一夜乡心五处同。"
                    },
                    {
                        name: "太行路·白居易",
                        content: "太行之路能摧车，若比人心是坦途。巫峡之水能覆舟，若比人心是安流。人心好恶苦不常，好生毛羽恶生疮。与君结发未五载，岂期牛女为参商。古称色衰相弃背，当时美人犹怨悔。何况如今鸾镜中，妾颜未改君心改。为君熏衣裳，君闻兰麝不馨香。为君盛容饰，君看金翠无颜色。行路难，难重陈。人生莫作妇人身，百年苦乐由他人。行路难，难于山，险于水。不独人间夫与妻，近代君臣亦如此。君不见左纳言，右纳史，朝承恩，暮赐死。行路难，不在水，不在山，只在人情反覆间。"
                    },
                ]
            },
            {
                author:"杜牧",
                article:[
                    {
                        name: "阿房宫赋·杜牧",
                        content: "六王毕，四海一，蜀山兀，阿房出。覆压三百余里，隔离天日。骊山北构而西折，直走咸阳。二川溶溶，流入宫墙。五步一楼，十步一阁；廊腰缦回，檐牙高啄；各抱地势，钩心斗角。盘盘焉，囷囷焉，蜂房水涡，矗不知其几千万落。长桥卧波，未云何龙？复道行空，不霁何虹？高低冥迷，不知西东。歌台暖响，春光融融；舞殿冷袖，风雨凄凄。一日之内，一宫之间，而气候不齐。妃嫔媵嫱，王子皇孙，辞楼下殿，辇来于秦。朝歌夜弦，为秦宫人。明星荧荧，开妆镜也；绿云扰扰，梳晓鬟也；渭流涨腻，弃脂水也；烟斜雾横，焚椒兰也。雷霆乍惊，宫车过也；辘辘远听，杳不知其所之也。一肌一容，尽态极妍，缦立远视，而望幸焉。有不见者三十六年。燕赵之收藏，韩魏之经营，齐楚之精英，几世几年，剽掠其人，倚叠如山。一旦不能有，输来其间。鼎铛玉石，金块珠砾，弃掷逦迤，秦人视之，亦不甚惜。嗟乎！一人之心，千万人之心也。秦爱纷奢，人亦念其家。奈何取之尽锱铢，用之如泥沙？使负栋之柱，多于南亩之农夫；架梁之椽，多于机上之工女；钉头磷磷，多于在庾之粟粒；瓦缝参差，多于周身之帛缕；直栏横槛，多于九土之城郭；管弦呕哑，多于市人之言语。使天下之人，不敢言而敢怒。独夫之心，日益骄固。戍卒叫，函谷举，楚人一炬，可怜焦土！呜呼！灭六国者六国也，非秦也；族秦者秦也，非天下也。嗟乎！使六国各爱其人，则足以拒秦；使秦复爱六国之人，则递三世可至万世而为君，谁得而族灭也？秦人不暇自哀，而后人哀之；后人哀之而不鉴之，亦使后人而复哀后人也。"
                    },
                    {
                        name: "寄扬州韩绰判官·杜牧",
                        content: "青山隐隐水迢迢，秋尽江南草未凋。二十四桥明月夜，玉人何处教吹箫。"
                    },
                    {
                        name: "旅宿·杜牧",
                        content: "旅馆无良伴，凝情自悄然。寒灯思旧事，断雁警愁眠。远梦归侵晓，家书到隔年。沧江好烟月，门系钓鱼船。"
                    },
                    {
                        name: "过华清宫绝句·其一·杜牧",
                        content: "长安回望绣成堆，山顶千门次第开。一骑红尘妃子笑，无人知是荔枝来。"
                    },
                    {
                        name: "过华清宫绝句·其二·杜牧",
                        content: "长安回望绣成堆，山顶千门次第开。一骑红尘妃子笑，无人知是荔枝来。"
                    },
                    {
                        name: "过华清宫绝句·其三·杜牧",
                        content: "万国笙歌醉太平，倚天楼殿月分明。云中乱拍禄山舞，风过重峦下笑声。"
                    },
                    {
                        name: "泊秦淮·杜牧",
                        content: "烟笼寒水月笼沙，夜泊秦淮近酒家。商女不知亡国恨，隔江犹唱后庭花。"
                    },
                    {
                        name: "遣怀·杜牧",
                        content: "落魄江湖载酒行，楚腰纤细掌中轻。十年一觉扬州梦，赢得青楼薄幸名。"
                    },
                    {
                        name: "山行·杜牧",
                        content: "远上寒山石径斜，白云生处有人家。停车坐爱枫林晚，霜叶红于二月花。"
                    },
                    {
                        name: "秋夕·杜牧",
                        content: "银烛秋光冷画屏，轻罗小扇扑流萤。天阶夜色凉如水，卧看牵牛织女星。"
                    },
                    {
                        name: "题乌江亭·杜牧",
                        content: "胜败兵家事不期，包羞忍耻是男儿。江东子弟多才俊，卷土重来未可知。"
                    },
                    {
                        name: "赤壁·杜牧",
                        content: "折戟沉沙铁未销，自将磨洗认前朝。东风不与周郎便，铜雀春深锁二乔。"
                    },
                    {
                        name: "清明·杜牧",
                        content: "清明时节雨纷纷，路上行人欲断魂。借问酒家何处有？牧童遥指杏花村。"
                    },
                    {
                        name: "九日齐山登高·杜牧",
                        content: "江涵秋影雁初飞，与客携壶上翠微。尘世难逢开口笑，菊花须插满头归。但将酩酊酬佳节，不用登临恨落晖。古往今来只如此，牛山何必独霑衣。"
                    },
                    {
                        name: "赠别·其一·杜牧",
                        content: "娉娉袅袅十三余，豆蔻梢头二月初。春风十里扬州路，卷上珠帘总不如。"
                    },
                    {
                        name: "赠别·其二·杜牧",
                        content: "多情却似总无情，唯觉尊前笑不成。蜡烛有心还惜别，替人垂泪到天明。"
                    },
                    {
                        name: "题宣州开元寺水阁阁下宛溪夹溪居人·杜牧",
                        content: "六朝文物草连空，天淡云闲今古同。鸟去鸟来山色里，人歌人哭水声中。深秋帘幕千家雨，落日楼台一笛风。惆怅无因见范蠡，参差烟树五湖东。"
                    },
                    {
                        name: "金谷园·杜牧",
                        content: "繁华事散逐香尘，流水无情草自春。日暮东风怨啼鸟，落花犹似坠楼人。"
                    },
                    {
                        name: "鹭鸶·杜牧",
                        content: "雪衣雪发青玉嘴，群捕鱼儿溪影中。惊飞远映碧山去，一树梨花落晚风。"
                    },
                    {
                        name: "长安秋望·杜牧",
                        content: "楼倚霜树外，镜天无一毫。南山与秋色，气势两相高。"
                    },
                    {
                        name: "送隐者一绝·杜牧",
                        content: "无媒径路草萧萧，自古云林远市朝。公道世间唯白发，贵人头上不曾饶。"
                    },
                    {
                        name: "题木兰庙·杜牧",
                        content: "弯弓征战作男儿，梦里曾经与画眉。几度思归还把酒，拂云堆上祝明妃。"
                    },
                    {
                        name: "初冬夜饮·杜牧",
                        content: "淮阳多病偶求欢，客袖侵霜与烛盘。砌下梨花一堆雪，明年谁此凭阑干。"
                    },
                    {
                        name: "西江怀古·杜牧",
                        content: "上吞巴汉控潇湘，怒似连山静镜光。魏帝缝囊真戏剧，苻坚投棰更荒唐。千秋钓舸歌明月，万里沙鸥弄夕阳。范蠡清尘何寂寞，好风唯属往来商。"
                    },
                    {
                        name: "紫薇花·杜牧",
                        content: "晓迎秋露一枝新，不占园中最上春。桃李无言又何在，向风偏笑艳阳人。"
                    },
                ]
            },
            {
                author:"王维",
                article:[
                    {
                        name: "终南别业·王维",
                        content: "中岁颇好道，晚家南山陲。兴来每独往，胜事空自知。行到水穷处，坐看云起时。偶然值林叟，谈笑无还期。"
                    },
                    {
                        name: "相思·王维",
                        content: "红豆生南国，春来发几枝。愿君多采撷，此物最相思。"
                    },
                    {
                        name: "山居秋暝·王维",
                        content: "空山新雨后，天气晚来秋。明月松间照，清泉石上流。竹喧归浣女，莲动下渔舟。随意春芳歇，王孙自可留。"
                    },
                    {
                        name: "送元二使安西·王维",
                        content: "渭城朝雨浥轻尘，客舍青青柳色新。劝君更尽一杯酒，西出阳关无故人。"
                    },
                    {
                        name: "使至塞上·王维",
                        content: "单车欲问边，属国过居延。征蓬出汉塞，归雁入胡天。大漠孤烟直，长河落日圆。萧关逢候骑，都护在燕然。"
                    },
                    {
                        name: "画·王维",
                        content: "远看山有色，近听水无声。春去花还在，人来鸟不惊。"
                    },
                    {
                        name: "老将行·王维",
                        content: "少年十五二十时，步行夺得胡马骑。射杀山中白额虎，肯数邺下黄须儿！一身转战三千里，一剑曾当百万师。汉兵奋迅如霹雳，虏骑崩腾畏蒺藜。卫青不败由天幸，李广无功缘数奇。自从弃置便衰朽，世事蹉跎成白首。昔时飞箭无全目，今日垂杨生左肘。路旁时卖故侯瓜，门前学种先生柳。苍茫古木连穷巷，寥落寒山对虚牖。誓令疏勒出飞泉，不似颍川空使酒。贺兰山下阵如云，羽檄交驰日夕闻。节使三河募年少，诏书五道出将军。试拂铁衣如雪色，聊持宝剑动星文。愿得燕弓射大将，耻令越甲鸣吾君。莫嫌旧日云中守，犹堪一战取功勋。"
                    },
                    {
                        name: "送沈子归江东·王维",
                        content: "杨柳渡头行客稀，罟师荡桨向临圻。惟有相思似春色，江南江北送君归。"
                    },
                    {
                        name: "竹里馆·王维",
                        content: "独坐幽篁里，弹琴复长啸。深林人不知，明月来相照。"
                    },
                    {
                        name: "酌酒与裴迪·王维",
                        content: "酌酒与君君自宽，人情翻覆似波澜。白首相知犹按剑，朱门先达笑弹冠。草色全经细雨湿，花枝欲动春风寒。世事浮云何足问，不如高卧且加餐。"
                    },
                    {
                        name: "山中·王维",
                        content: "荆溪白石出，天寒红叶稀。山路元无雨，空翠湿人衣。"
                    },
                    {
                        name: "九月九日忆山东兄弟·王维",
                        content: "独在异乡为异客，每逢佳节倍思亲。遥知兄弟登高处，遍插茱萸少一人。"
                    },
                    {
                        name: "送别·王维",
                        content: "下马饮君酒，问君何所之？君言不得意，归卧南山陲。但去莫复问，白云无尽时。"
                    },
                    {
                        name: "陇头吟·王维",
                        content: "长安少年游侠客，夜上戍楼看太白。陇头明月迥临关，陇上行人夜吹笛。关西老将不胜愁，驻马听之双泪流。身经大小百余战，麾下偏裨万户侯。苏武才为典属国，节旄落尽海西头。"
                    },
                    {
                        name: "和贾舍人早朝大明宫之作·王维",
                        content: "绛帻鸡人报晓筹，尚衣方进翠云裘。九天阊阖开宫殿，万国衣冠拜冕旒。日色才临仙掌动，香烟欲傍衮龙浮。朝罢须裁五色诏，佩声归向凤池头。"
                    },
                    {
                        name: "终南山·王维",
                        content: "太乙近天都，连山接海隅。白云回望合，青霭入看无。分野中峰变，阴晴众壑殊。欲投人处宿，隔水问樵夫。"
                    },
                    {
                        name: "积雨辋川庄作·王维",
                        content: "积雨空林烟火迟，蒸藜炊黍饷东菑。漠漠水田飞白鹭，阴阴夏木啭黄鹂。山中习静观朝槿，松下清斋折露葵。野老与人争席罢，海鸥何事更相疑。"
                    },
                    {
                        name: "伊州歌·王维",
                        content: "清风明月苦相思，荡子从戎十载馀。征人去日殷勤嘱，归雁来时数附书。"
                    },
                    {
                        name: "送梓州李使君·王维",
                        content: "万壑树参天，千山响杜鹃。山中一夜雨，树杪百重泉。汉女输橦布，巴人讼芋田。文翁翻教授，不敢倚先贤。"
                    },
                ]
            },
            {
                author:"王昌龄",
                article:[
                    {
                        name: "出塞·其一·王昌龄",
                        content: "秦时明月汉时关，万里长征人未还。但使龙城飞将在，不教胡马度阴山。"
                    },
                    {
                        name: "出塞·其二·王昌龄",
                        content: "骝马新跨白玉鞍，战罢沙场月色寒。城头铁鼓声犹震，匣里金刀血未干。"
                    },
                    {
                        name: "从军行七首·其四·王昌龄",
                        content: "青海长云暗雪山，孤城遥望玉门关。黄沙百战穿金甲，不破楼兰终不还。"
                    },
                    {
                        name: "从军行七首·其六·王昌龄",
                        content: "胡瓶落膊紫薄汗，碎叶城西秋月团。明敕星驰封宝剑，辞君一夜取楼兰。"
                    },
                    {
                        name: "长歌行·王昌龄",
                        content: "旷野饶悲风，飕飕黄蒿草。系马倚白杨，谁知我怀抱。所是同袍者，相逢尽衰老。北登汉家陵，南望长安道。下有枯树根，上有鼯鼠窠。高皇子孙尽，千载无人过。宝玉频发掘，精灵其奈何。人生须达命，有酒且长歌。"
                    },
                    {
                        name: "芙蓉楼送辛渐·王昌龄",
                        content: "寒雨连江夜入吴，平明送客楚山孤。洛阳亲友如相问，一片冰心在玉壶。"
                    },
                    {
                        name: "送狄宗亨·王昌龄",
                        content: "秋在水清山暮蝉，洛阳树色鸣皋烟。送君归去愁不尽，又惜空度凉风天。"
                    },
                    {
                        name: "长信怨·王昌龄",
                        content: "金井梧桐秋叶黄，珠帘不卷夜来霜。熏笼玉枕无颜色，卧听南宫清漏长。高殿秋砧响夜阑，霜深犹忆御衣寒。银灯青琐裁缝歇，还向金城明主看。奉帚平明金殿开，暂将团扇共徘徊。玉颜不及寒鸦色，犹带昭阳日影来。真成薄命久寻思，梦见君王觉后疑。火照西宫知夜饮，分明复道奉恩时。长信宫中秋月明，昭阳殿下捣衣声。白露堂中细草迹，红罗帐里不胜情。"
                    },
                    {
                        name: "答武陵太守·王昌龄",
                        content: "仗剑行千里，微躯敢一言。曾为大梁客，不负信陵恩。"
                    },
                    {
                        name: "春宫曲·王昌龄",
                        content: "昨夜风开露井桃，未央前殿月轮高。平阳歌舞新承宠，帘外春寒赐锦袍。"
                    },
                    {
                        name: "重别李评事·王昌龄",
                        content: "莫道秋江离别难，舟船明日是长安。吴姬缓舞留君醉，随意青枫白露寒。"
                    },
                    {
                        name: "浣纱女·王昌龄",
                        content: "钱塘江畔是谁家，江上女儿全胜花。吴王在时不得出，今日公然来浣纱。"
                    },
                    {
                        name: "旅望·王昌龄",
                        content: "白花原头望京师，黄河水流无尽时。穷秋旷野行人绝，马首东来知是谁。"
                    },
                    {
                        name: "代扶风主人答·王昌龄",
                        content: "杀气凝不流，风悲日彩寒。浮埃起四远，游子弥不欢。依然宿扶风，沽酒聊自宽。寸心亦未理，长铗谁能弹。主人就我饮，对我还慨叹。便泣数行泪，因歌行路难。十五役边地，三四讨楼兰。连年不解甲，积日无所餐。将军降匈奴，国使没桑乾。去时三十万，独自还长安。不信沙场苦，君看刀箭瘢。乡亲悉零落，冢墓亦摧残。仰攀青松枝，恸绝伤心肝。禽兽悲不去，路旁谁忍看。幸逢休明代，寰宇静波澜。老马思伏枥，长鸣力已殚。少年兴运会，何事发悲端。天子初封禅，贤良刷羽翰。三边悉如此，否泰亦须观。"
                    },
                    {
                        name: "卢溪别人·王昌龄",
                        content: "武陵溪口驻扁舟，溪水随君向北流。行到荆门上三峡，莫将孤月对猿愁。"
                    },
                ]
            },
            {
                author:"李商隐",
                article:[
                    {
                        name: "无题·李商隐",
                        content: "昨夜星辰昨夜风，画楼西畔桂堂东。身无彩凤双飞翼，心有灵犀一点通。隔座送钩春酒暖，分曹射覆蜡灯红。嗟余听鼓应官去，走马兰台类转蓬。"
                    },
                    {
                        name: "无题·相见时难别亦难·李商隐",
                        content: "相见时难别亦难，东风无力百花残。春蚕到死丝方尽，蜡炬成灰泪始干。晓镜但愁云鬓改，夜吟应觉月光寒。蓬山此去无多路，青鸟殷勤为探看。"
                    },
                    {
                        name: "无题·重帏深下莫愁堂·李商隐",
                        content: "重帏深下莫愁堂，卧后清宵细细长。神女生涯原是梦，小姑居处本无郎。风波不信菱枝弱，月露谁教桂叶香。直道相思了无益，未妨惆怅是清狂。"
                    },
                    {
                        name: "锦瑟·李商隐",
                        content: "锦瑟无端五十弦，一弦一柱思华年。庄生晓梦迷蝴蝶，望帝春心托杜鹃。沧海月明珠有泪，蓝田日暖玉生烟。此情可待成追忆，只是当时已惘然。"
                    },
                    {
                        name: "登乐游原·李商隐",
                        content: "向晚意不适，驱车登古原。夕阳无限好，只是近黄昏。"
                    },
                    {
                        name: "宿骆氏亭寄怀崔雍崔衮·李商隐",
                        content: "竹坞无尘水槛清，相思迢递隔重城。秋阴不散霜飞晚，留得枯荷听雨声。"
                    },
                    {
                        name: "嫦娥·李商隐",
                        content: "云母屏风烛影深，长河渐落晓星沉。嫦娥应悔偷灵药，碧海青天夜夜心。"
                    },
                    {
                        name: "瑶池·李商隐",
                        content: "瑶池阿母绮窗开，黄竹歌声动地哀。八骏日行三万里，穆王何事不重来。"
                    },
                    {
                        name: "北青萝·李商隐",
                        content: "残阳西入崦，茅屋访孤僧。落叶人何在，寒云路几层。独敲初夜磬，闲倚一枝藤。世界微尘里，吾宁爱与憎。"
                    },
                    {
                        name: "贾生·李商隐",
                        content: "宣室求贤访逐臣，贾生才调更无伦。可怜夜半虚前席，不问苍生问鬼神。"
                    },
                    {
                        name: "暮秋独游曲江·李商隐",
                        content: "荷叶生时春恨生，荷叶枯时秋恨成。深知身在情长在，怅望江头江水声。"
                    },
                    {
                        name: "安定城楼·李商隐",
                        content: "迢递高城百尺楼，绿杨枝外尽汀洲。贾生年少虚垂泪，王粲春来更远游。永忆江湖归白发，欲回天地入扁舟。不知腐鼠成滋味，猜意鹓雏竟未休。"
                    },
                    {
                        name: "霜月·李商隐",
                        content: "初闻征雁已无蝉，百尺楼高水接天。青女素娥俱耐冷，月中霜里斗婵娟。"
                    },
                    {
                        name: "端居·李商隐",
                        content: "远书归梦两悠悠，只有空床敌素秋。阶下青苔与红树，雨中寥落月中愁。"
                    },
                    {
                        name: "春雨·李商隐",
                        content: "怅卧新春白袷衣，白门寥落意多违。红楼隔雨相望冷，珠箔飘灯独自归。远路应悲春晼晚，残宵犹得梦依稀。玉珰缄札何由达，万里云罗一雁飞。"
                    },
                    {
                        name: "春日寄怀·李商隐",
                        content: "世间荣落重逡巡，我独丘园坐四春。纵使有花兼有月，可堪无酒又无人。青袍似草年年定，白发如丝日日新。欲逐风波千万里，未知何路到龙津。"
                    },
                    {
                        name: "牡丹·李商隐",
                        content: "锦帏初卷卫夫人，绣被犹堆越鄂君。垂手乱翻雕玉佩，折腰争舞郁金裙。石家蜡烛何曾剪，荀令香炉可待熏。我是梦中传彩笔，欲书花叶寄朝云。"
                    },
                    {
                        name: "菊花·李商隐",
                        content: "暗暗淡淡紫，融融冶冶黄。陶令篱边色，罗含宅里香。几时禁重露，实是怯残阳。愿泛金鹦鹉，升君白玉堂。"
                    },
                    {
                        name: "赠荷花·李商隐",
                        content: "世间花叶不相伦，花入金盆叶作尘。惟有绿荷红菡萏，卷舒开合任天真。此花此叶常相映，翠减红衰愁杀人。"
                    },
                ]
            },
            {
                author:"李清照",
                article:[
                    {
                        name: "武陵春·春晚·李清照",
                        content: "风住尘香花已尽，日晚倦梳头。物是人非事事休，欲语泪先流。闻说双溪春尚好，也拟泛轻舟。只恐双溪舴艋舟，载不动许多愁。"
                    },
                    {
                        name: "一剪梅·红藕香残玉簟秋·李清照",
                        content: "红藕香残玉簟秋。轻解罗裳，独上兰舟。云中谁寄锦书来？雁字回时，月满西楼。花自飘零水自流。一种相思，两处闲愁。此情无计可消除，才下眉头，却上心头。"
                    },
                    {
                        name: "如梦令·昨夜雨疏风骤·李清照",
                        content: "昨夜雨疏风骤，浓睡不消残酒。试问卷帘人，却道海棠依旧。知否，知否？应是绿肥红瘦。"
                    },
                    {
                        name: "摊破浣溪沙·病起萧萧两鬓华·李清照",
                        content: "病起萧萧两鬓华，卧看残月上窗纱。豆蔻连梢煎熟水，莫分茶。枕上诗书闲处好，门前风景雨来佳。终日向人多酝藉，木犀花。"
                    },
                    {
                        name: "声声慢·寻寻觅觅·李清照",
                        content: "寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍暖还寒时候，最难将息。三杯两盏淡酒，怎敌他、晚来风急！雁过也，正伤心，却是旧时相识。满地黄花堆积，憔悴损，如今有谁堪摘？守着窗儿，独自怎生得黑！梧桐更兼细雨，到黄昏、点点滴滴。这次第，怎一个愁字了得！"
                    },
                    {
                        name: "鹧鸪天·桂花·李清照",
                        content: "暗淡轻黄体性柔，情疏迹远只香留。何须浅碧深红色，自是花中第一流。梅定妒，菊应羞，画阑开处冠中秋。骚人可煞无情思，何事当年不见收。"
                    },
                    {
                        name: "醉花阴·薄雾浓云愁永昼·李清照",
                        content: "薄雾浓云愁永昼，瑞脑销金兽。佳节又重阳，玉枕纱厨，半夜凉初透。(厨 通：橱；销金兽 一作：消金兽)东篱把酒黄昏后，有暗香盈袖。莫道不销魂，帘卷西风，人比黄花瘦。"
                    },
                    {
                        name: "夏日绝句·李清照",
                        content: "生当作人杰，死亦为鬼雄。至今思项羽，不肯过江东。"
                    },
                    {
                        name: "渔家傲·天接云涛连晓雾·李清照",
                        content: "天接云涛连晓雾，星河欲转千帆舞。仿佛梦魂归帝所。闻天语，殷勤问我归何处。我报路长嗟日暮，学诗谩有惊人句。九万里风鹏正举。风休住，蓬舟吹取三山去！"
                    },
                    {
                        name: "南歌子·天上星河转·李清照",
                        content: "天上星河转，人间帘幕垂。凉生枕簟泪痕滋。起解罗衣聊问、夜何其。翠贴莲蓬小，金销藕叶稀。旧时天气旧时衣。只有情怀不似、旧家时。"
                    },
                    {
                        name: "蝶恋花·暖雨晴风初破冻·李清照",
                        content: "暖雨晴风初破冻，柳眼梅腮，已觉春心动。酒意诗情谁与共？泪融残粉花钿重。乍试夹衫金缕缝，山枕斜欹，枕损钗头凤。独抱浓愁无好梦，夜阑犹剪灯花弄。"
                    },
                    {
                        name: "蝶恋花·晚止昌乐馆寄姊妹·李清照",
                        content: "泪湿罗衣脂粉满，四叠阳关，唱到千千遍。人道山长山又断，萧萧微雨闻孤馆。惜别伤离方寸乱，忘了临行，酒盏深和浅。好把音书凭过雁，东莱不似蓬莱远。"
                    },
                    {
                        name: "临江仙·梅·李清照",
                        content: "庭院深深深几许，云窗雾阁春迟。为谁憔悴损芳姿。夜来清梦好，应是发南枝。玉瘦檀轻无限恨，南楼羌管休吹。浓香吹尽有谁知。暖风迟日也，别到杏花肥。"
                    },
                    {
                        name: "浣溪沙·闺情·李清照",
                        content: "绣面芙蓉一笑开，斜飞宝鸭衬香腮。眼波才动被人猜。一面风情深有韵，半笺娇恨寄幽怀。月移花影约重来。"
                    },
                ]
            },
            {
                author:"刘禹锡",
                article:[
                    {
                        name: "陋室铭·刘禹锡",
                        content: "山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？"
                    },
                    {
                        name: "酬乐天扬州初逢席上见赠·刘禹锡",
                        content: "巴山楚水凄凉地，二十三年弃置身。怀旧空吟闻笛赋，到乡翻似烂柯人。沉舟侧畔千帆过，病树前头万木春。今日听君歌一曲，暂凭杯酒长精神。"
                    },
                    {
                        name: "竹枝词·其一·刘禹锡",
                        content: "杨柳青青江水平，闻郎江上唱歌声。东边日出西边雨，道是无晴却有晴。"
                    },
                    {
                        name: "竹枝词·其二·刘禹锡",
                        content: "楚水巴山江雨多，巴人能唱本乡歌。今朝北客思归去，回入纥那披绿罗。"
                    },
                    {
                        name: "竹枝词·山桃红花满上头·刘禹锡",
                        content: "山桃红花满上头，蜀江春水拍山流。花红易衰似郎意，水流无限似侬愁。"
                    },
                    {
                        name: "乌衣巷·刘禹锡",
                        content: "朱雀桥边野草花，乌衣巷口夕阳斜。旧时王谢堂前燕，飞入寻常百姓家。"
                    },
                    {
                        name: "酬乐天咏老见示·刘禹锡",
                        content: "人谁不顾老，老去有谁怜。身瘦带频减，发稀冠自偏。废书缘惜眼，多灸为随年。经事还谙事，阅人如阅川。细思皆幸矣，下此便翛然。莫道桑榆晚，为霞尚满天。"
                    },
                    {
                        name: "杨柳枝·刘禹锡",
                        content: "清江一曲柳千条，二十年前旧板桥。曾与美人桥上别，恨无消息到今朝。"
                    },
                    {
                        name: "西塞山怀古·刘禹锡",
                        content: "王濬楼船下益州，金陵王气黯然收。千寻铁锁沉江底，一片降幡出石头。人世几回伤往事，山形依旧枕寒流。今逢四海为家日，故垒萧萧芦荻秋。"
                    },
                    {
                        name: "蜀先主庙·刘禹锡",
                        content: "天地英雄气，千秋尚凛然。势分三足鼎，业复五铢钱。得相能开国，生儿不象贤。凄凉蜀故妓，来舞魏宫前。"
                    },
                    {
                        name: "望洞庭·刘禹锡",
                        content: "湖光秋月两相和，潭面无风镜未磨。遥望洞庭山水翠，白银盘里一青螺。"
                    },
                    {
                        name: "潇湘神·斑竹枝·刘禹锡",
                        content: "斑竹枝，斑竹枝，泪痕点点寄相思。楚客欲听瑶瑟怨，潇湘深夜月明时。"
                    },
                ]
            },
            {
                author:"李煜",
                article:[
                    {
                        name: "虞美人·春花秋月何时了·李煜",
                        content: "春花秋月何时了？往事知多少。小楼昨夜又东风，故国不堪回首月明中。雕栏玉砌应犹在，只是朱颜改。问君能有几多愁？恰似一江春水向东流。"
                    },
                    {
                        name: "乌夜啼·昨夜风兼雨·李煜",
                        content: "昨夜风兼雨，帘帏飒飒秋声。烛残漏断频欹枕，起坐不能平。　世事漫随流水，算来一梦浮生。醉乡路稳宜频到，此外不堪行。"
                    },
                    {
                        name: "相见欢·无言独上西楼·李煜",
                        content: "无言独上西楼，月如钩。寂寞梧桐深院锁清秋。剪不断，理还乱，是离愁。别是一般滋味在心头。"
                    },
                    {
                        name: "相见欢·林花谢了春红·李煜",
                        content: "林花谢了春红，太匆匆。无奈朝来寒雨晚来风。胭脂泪，相留醉，几时重。自是人生长恨水长东。"
                    },
                    {
                        name: "浪淘沙令·帘外雨潺潺·李煜",
                        content: "帘外雨潺潺，春意阑珊。罗衾不耐五更寒。梦里不知身是客，一晌贪欢。独自莫凭栏，无限江山。别时容易见时难。流水落花春去也，天上人间。"
                    },
                    {
                        name: "渔父·浪花有意千里雪·李煜",
                        content: "浪花有意千里雪，桃花无言一队春。一壶酒，一竿身，快活如侬有几人。"
                    },
                    {
                        name: "渔父·一棹春风一叶舟·李煜",
                        content: "一棹春风一叶舟，一纶茧缕一轻钩。花满渚，酒满瓯，万顷波中得自由。"
                    },
                    {
                        name: "长相思·一重山·李煜",
                        content: "一重山，两重山。山远天高烟水寒，相思枫叶丹。菊花开，菊花残。塞雁高飞人未还，一帘风月闲。"
                    },
                    {
                        name: "破阵子·四十年来家国·李煜",
                        content: "四十年来家国，三千里地山河。凤阁龙楼连霄汉，玉树琼枝作烟萝，几曾识干戈？一旦归为臣虏，沈腰潘鬓消磨。最是仓皇辞庙日，教坊犹奏别离歌，垂泪对宫娥。"
                    },
                    {
                        name: "清平乐·别来春半·李煜",
                        content: "别来春半，触目柔肠断。砌下落梅如雪乱，拂了一身还满。雁来音信无凭，路遥归梦难成。离恨恰如春草，更行更远还生。"
                    },
                    {
                        name: "望江南·多少恨·李煜",
                        content: "多少恨，昨夜梦魂中。还似旧时游上苑，车如流水马如龙。花月正春风。"
                    },
                    {
                        name: "望江南·闲梦远·李煜",
                        content: "闲梦远，南国正芳春。船上管弦江面绿，满城飞絮辊轻尘。忙杀看花人！闲梦远，南国正清秋。千里江山寒色暮，芦花深处泊孤舟，笛在月明楼。"
                    },
                    {
                        name: "子夜歌·人生愁恨何能免·李煜",
                        content: "人生愁恨何能免，销魂独我情何限！故国梦重归，觉来双泪垂。高楼谁与上？长记秋晴望。往事已成空，还如一梦中。"
                    },
                    {
                        name: "菩萨蛮·花明月暗笼轻雾·李煜",
                        content: "花明月暗笼轻雾，今宵好向郎边去。刬袜步香阶，手提金缕鞋。画堂南畔见，一向偎人颤。奴为出来难，教君恣意怜。"
                    },
                    {
                        name: "捣练子令·深院静·李煜",
                        content: "深院静，小庭空，断续寒砧断续风。无奈夜长人不寐，数声和月到帘栊。"
                    },
                    {
                        name: "玉楼春·晚妆初了明肌雪·李煜",
                        content: "晚妆初了明肌雪，春殿嫔娥鱼贯列。凤箫吹断水云间，重按霓裳歌遍彻。临春谁更飘香屑？醉拍阑干情味切。归时休放烛光红，待踏马蹄清夜月。"
                    },
            
                ]
            },
            {
                author:"孟浩然",
                article:[
                    {
                        name: "望洞庭湖赠张丞相·孟浩然",
                        content: "八月湖水平，涵虚混太清。气蒸云梦泽，波撼岳阳城。欲济无舟楫，端居耻圣明。坐观垂钓者，徒有羡鱼情。"
                    },
                    {
                        name: "夏日南亭怀辛大·孟浩然",
                        content: "山光忽西落，池月渐东上。散发乘夕凉，开轩卧闲敞。荷风送香气，竹露滴清响。欲取鸣琴弹，恨无知音赏。感此怀故人，中宵劳梦想。"
                    },
                    {
                        name: "过故人庄·孟浩然",
                        content: "故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。"
                    },
                    {
                        name: "与诸子登岘山·孟浩然",
                        content: "人事有代谢，往来成古今。江山留胜迹，我辈复登临。水落鱼梁浅，天寒梦泽深。羊公碑尚在，读罢泪沾襟。"
                    },
                    {
                        name: "宿建德江·孟浩然",
                        content: "移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。"
                    },
                    {
                        name: "题大禹寺义公禅房·孟浩然",
                        content: "义公习禅寂，结宇依空林。户外一峰秀，阶前众壑深。夕阳连雨足，空翠落庭阴。看取莲花净，应知不染心。"
                    },
                    {
                        name: "宿业师山房期丁大不至·孟浩然",
                        content: "夕阳度西岭，群壑倏已暝。松月生夜凉，风泉满清听。樵人归欲尽，烟鸟栖初定。之子期宿来，孤琴候萝径。"
                    },
                    {
                        name: "早寒江上有怀·孟浩然",
                        content: "木落雁南度，北风江上寒。我家襄水曲，遥隔楚云端。乡泪客中尽，孤帆天际看。迷津欲有问，平海夕漫漫。"
                    },
                    {
                        name: "自洛之越·孟浩然",
                        content: "遑遑三十载，书剑两无成。山水寻吴越，风尘厌洛京。扁舟泛湖海，长揖谢公卿。且乐杯中物，谁论世上名。"
                    },
                    {
                        name: "送朱大入秦·孟浩然",
                        content: "游人五陵去，宝剑值千金。分手脱相赠，平生一片心。"
                    },
                    {
                        name: "初秋·孟浩然",
                        content: "不觉初秋夜渐长，清风习习重凄凉。炎炎暑退茅斋静，阶下丛莎有露光。"
                    },
                    {
                        name: "春中喜王九相寻·孟浩然",
                        content: "二月湖水清，家家春鸟鸣。林花扫更落，径草踏还生。酒伴来相命，开尊共解酲。当杯已入手，歌妓莫停声。"
                    },
                    {
                        name: "送杜十四之江南·孟浩然",
                        content: "荆吴相接水为乡，君去春江正淼茫。日暮征帆何处泊，天涯一望断人肠。"
                    },
                ]
            },
            {
                author:"纳兰性德",
                article:[
                    {
                        name: "木兰花·拟古决绝词柬友·纳兰性德",
                        content: "人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故人心易变。骊山语罢清宵半，泪雨霖铃终不怨。何如薄幸锦衣郎，比翼连枝当日愿。"
                    },
                    {
                        name: "蝶恋花·出塞·纳兰性德",
                        content: "今古河山无定据。画角声中，牧马频来去。满目荒凉谁可语？西风吹老丹枫树。从前幽怨应无数。铁马金戈，青冢黄昏路。一往情深深几许？深山夕照深秋雨。"
                    },
                    {
                        name: "蝶恋花·辛苦最怜天上月·纳兰性德",
                        content: "辛苦最怜天上月，一昔如环，昔昔都成玦。若似月轮终皎洁，不辞冰雪为卿热。无那尘缘容易绝，燕子依然，软踏帘钩说。唱罢秋坟愁未歇，春丛认取双栖蝶。"
                    },
                    {
                        name: "采桑子·谁翻乐府凄凉曲·纳兰性德",
                        content: "谁翻乐府凄凉曲？风也萧萧，雨也萧萧，瘦尽灯花又一宵。不知何事萦怀抱，醒也无聊，醉也无聊，梦也何曾到谢桥。"
                    },
                    {
                        name: "采桑子·而今才道当时错·纳兰性德",
                        content: "而今才道当时错，心绪凄迷。红泪偷垂，满眼春风百事非。情知此后来无计，强说欢期。一别如斯，落尽梨花月又西。"
                    },
                    {
                        name: "浣溪沙·谁念西风独自凉·纳兰性德",
                        content: "谁念西风独自凉，萧萧黄叶闭疏窗，沉思往事立残阳。被酒莫惊春睡重，赌书消得泼茶香，当时只道是寻常。"
                    },
                    {
                        name: "浣溪沙·残雪凝辉冷画屏·纳兰性德",
                        content: "残雪凝辉冷画屏，落梅横笛已三更，更无人处月胧明。我是人间惆怅客，知君何事泪纵横，断肠声里忆平生。"
                    },
                    {
                        name: "长相思·山一程·纳兰性德",
                        content: "山一程，水一程，身向榆关那畔行，夜深千帐灯。风一更，雪一更，聒碎乡心梦不成，故园无此声。"
                    },
                    {
                        name: "山花子·风絮飘残已化萍·纳兰性德",
                        content: "风絮飘残已化萍，泥莲刚倩藕丝萦。珍重别拈香一瓣，记前生。人到情多情转薄，而今真个不多情。又到断肠回首处，泪偷零。"
                    },
                    {
                        name: "画堂春·一生一代一双人·纳兰性德",
                        content: "一生一代一双人，争教两处销魂。相思相望不相亲，天为谁春？浆向蓝桥易乞，药成碧海难奔。若容相访饮牛津，相对忘贫。"
                    },
                    {
                        name: "虞美人·银床淅沥青梧老·纳兰性德",
                        content: "银床淅沥青梧老，屧粉秋蛩扫。采香行处蹙连钱，拾得翠翘何恨不能言。回廊一寸相思地，落月成孤倚。背灯和月就花阴，已是十年踪迹十年心。"
                    },
                    {
                        name: "赤枣子·风淅淅·纳兰性德",
                        content: "风淅淅，雨纤纤。难怪春愁细细添。记不分明疑是梦，梦来还隔一重帘。"
                    },
                    {
                        name: "临江仙·寒柳·纳兰性德",
                        content: "飞絮飞花何处是，层冰积雪摧残，疏疏一树五更寒。爱他明月好，憔悴也相关。最是繁丝摇落后，转教人忆春山。湔裙梦断续应难。西风多少恨，吹不散眉弯。"
                    },
                    {
                        name: "琵琶仙·中秋·纳兰性德",
                        content: "碧海年年，试问取、冰轮为谁圆缺？吹到一片秋香，清辉了如雪。愁中看、好天良夜，知道尽成悲咽。只影而今，那堪重对，旧时明月。花径里、戏捉迷藏，曾惹下萧萧井梧叶。记否轻纨小扇，又几番凉热。只落得，填膺百感，总茫茫、不关离别。一任紫玉无情，夜寒吹裂。"
                    },
                    {
                        name: "鬓云松令·枕函香·纳兰性德",
                        content: "枕函香，花径漏。依约相逢，絮语黄昏后。时节薄寒人病酒，刬地梨花，彻夜东风瘦。掩银屏，垂翠袖。何处吹箫，脉脉情微逗。肠断月明红豆蔻，月似当时，人似当时否？"
                    },
                    {
                        name: "于中好·握手西风泪不干·纳兰性德",
                        content: "握手西风泪不干，年来多在别离间。遥知独听灯前雨，转忆同看雪后山。凭寄语，劝加餐。桂花时节约重还。分明小像沉香缕，一片伤心欲画难。"
                    },
                    {
                        name: "菩萨蛮·萧萧几叶风兼雨·纳兰性德",
                        content: "萧萧几叶风兼雨，离人偏识长更苦。欹枕数秋天，蟾蜍下早弦。夜寒惊被薄，泪与灯花落。无处不伤心，轻尘在玉琴。"
                    },
                    {
                        name: "山花子·林下荒苔道韫家·纳兰性德",
                        content: "林下荒苔道韫家，生怜玉骨委尘沙。愁向风前无处说，数归鸦。半世浮萍随逝水，一宵冷雨葬名花。魂是柳绵吹欲碎，绕天涯。"
                    },
            
                ]
            },
            {
                author:"柳宗元",
                article:[
                {
                    name: "江雪·柳宗元",
                    content: "千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。"
                },
                {
                    name: "登柳州城楼寄漳汀封连四州·柳宗元",
                    content: "城上高楼接大荒，海天愁思正茫茫。惊风乱飐芙蓉水，密雨斜侵薜荔墙。岭树重遮千里目，江流曲似九回肠。共来百越文身地，犹自音书滞一乡。"
                },
                {
                    name: "渔翁·柳宗元",
                    content: "渔翁夜傍西岩宿，晓汲清湘燃楚竹。烟销日出不见人，欸乃一声山水绿。回看天际下中流，岩上无心"
                },
                {
                    name: "与浩初上人同看山寄京华亲故·柳宗元",
                    content: "海畔尖山似剑铓，秋来处处割愁肠。若为化得身千亿，散上峰头望故乡。"
                },
                {
                    name: "酬曹侍御过象县见寄·柳宗元",
                    content: "破额山前碧玉流，骚人遥驻木兰舟。春风无限潇湘意，欲采蘋花不自由。"
                },
                {
                    name: "酬王二十舍人雪中见寄·柳宗元",
                    content: "三日柴门拥不开，阶平庭满白皑皑。今朝蹈作琼瑶迹，为有诗从凤沼来。"
                },
                {
                    name: "重别梦得·柳宗元",
                    content: "二十年来万事同，今朝岐路忽西东。皇恩若许归田去，晚岁当为邻舍翁。"
                },
                {
                    name: "别舍弟宗一·柳宗元",
                    content: "零落残魂倍黯然，双垂别泪越江边。一身去国六千里，万死投荒十二年。桂岭瘴来云似墨，洞庭春尽水如天。欲知此后相思梦，长在荆门郢树烟。"
                },
                {
                    name: "柳州二月榕叶落尽偶题·柳宗元",
                    content: "宦情羁思共凄凄，春半如秋意转迷。山城过雨百花尽，榕叶满庭莺乱啼。"
                },
                {
                    name: "早梅·柳宗元",
                    content: "早梅发高树，迥映楚天碧。朔吹飘夜香，繁霜滋晓白。欲为万里赠，杳杳山水隔。寒英坐销落，何用慰远客。"
                },
                {
                    name: "衡阳与梦得分路赠别·柳宗元",
                    content: "十年憔悴到秦京，谁料翻为岭外行。伏波故道风烟在，翁仲遗墟草树平。直以慵疏招物议，休将文字占时名。今朝不用临河别，垂泪千行便濯缨。"
                },
                {
                    name: "夏昼偶作·柳宗元",
                    content: "南州溽暑醉如酒，隐几熟眠开北牖。日午独觉无馀声，山童隔竹敲茶臼。"
                },
                {
                    name: "晨诣超师院读禅经·柳宗元",
                    content: "汲井漱寒齿，清心拂尘服。闲持贝叶书，步出东斋读。真源了无取，妄迹世所逐。遗言冀可冥，缮性何由熟。道人庭宇静，苔色连深竹。日出雾露馀，青松如膏沐。澹然离言说，悟悦心自足。"
                },
                {
                    name: "秋晓行南谷经荒村·柳宗元",
                    content: "杪秋霜露重，晨起行幽谷。黄叶覆溪桥，荒村唯古木。寒花疏寂历，幽泉微断续。机心久已忘，何事"
                },
            ]
            },
            {
                author:"陶渊明",
                article:[
                    {
                        name:"桃花源记·陶渊明",
                        content:"晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷。渔人甚异之，复前行，欲林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田、美池、桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣着，悉如外人。黄发垂髫，并怡然自乐。            见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。此中人语云：“不足为外人道也。”既出，得其船，便扶向路，处处志之。及郡下，诣太守，说如此。太守即遣人随其往，寻向所志，遂迷，不复得路。南阳刘子骥，高尚士也，闻之，欣然规往。未果，寻病终。后遂无问津者。"
                    },
                    {
                        name:"归去来兮辞·陶渊明",
                        content:"余家贫，耕植不足以自给。幼稚盈室，瓶无储粟，生生所资，未见其术。亲故多劝余为长吏，脱然有怀，求之靡途。会有四方之事，诸侯以惠爱为德，家叔以余贫苦，遂见用于小邑。于时风波未静，心惮远役，彭泽去家百里，公田之利，足以为酒。故便求之。及少日，眷然有归欤之情。何则？质性自然，非矫厉所得。饥冻虽切，违己交病。尝从人事，皆口腹自役。于是怅然慷慨，深愧平生之志。犹望一稔，当敛裳宵逝。寻程氏妹丧于武昌，情在骏奔，自免去职。仲秋至冬，在官八十余日。因事顺心，命篇曰《归去来兮》。乙巳岁十一月也。归去来兮，田园将芜胡不归？既自以心为形役，奚惆怅而独悲？悟已往之不谏，知来者之可追。实迷途其未远，觉今是而昨非。舟遥遥以轻飏，风飘飘而吹衣。问征夫以前路，恨晨光之熹微。乃瞻衡宇，载欣载奔。僮仆欢迎，稚子候门。三径就荒，松菊犹存。携幼入室，有酒盈樽。引壶觞以自酌，眄庭柯以怡颜。倚南窗以寄傲，审容膝之易安。园日涉以成趣，门虽设而常关。策扶老以流憩，时矫首而遐观。云无心以出岫，鸟倦飞而知还。景翳翳以将入，抚孤松而盘桓。                归去来兮，请息交以绝游。世与我而相违，复驾言兮焉求？悦亲戚之情话，乐琴书以消忧。农人告余以春及，将有事于西畴。或命巾车，或棹孤舟。既窈窕以寻壑，亦崎岖而经丘。木欣欣以向荣，泉涓涓而始流。善万物之得时，感吾生之行休。已矣乎！寓形宇内复几时？曷不委心任去留？胡为乎遑遑欲何之？富贵非吾愿，帝乡不可期。怀良辰以孤往，或植杖而耘耔。登东皋以舒啸，临清流而赋诗。聊乘化以归尽，乐夫天命复奚疑！"
                    },
                    {
                        name:"饮酒·其五·陶渊明",
                        content:"结庐在人境，而无车马喧。问君何能尔？心远地自偏。采菊东篱下，悠然见南山。山气日夕佳，飞鸟相与还。此中有真意，欲辨已忘言。"
                    },            
                    {
                        name:"归园田居·其一·陶渊明",
                        content:"少无适俗韵，性本爱丘山。误落尘网中，一去三十年。羁鸟恋旧林，池鱼思故渊。开荒南野际，守拙归园田。方宅十余亩，草屋八九间。榆柳荫后檐，桃李罗堂前。暧暧远人村，依依墟里烟。狗吠深巷中，鸡鸣桑树颠。户庭无尘杂，虚室有余闲。久在樊笼里，复得返自然。"
                    },
                    {
                        name:"归园田居·其三·陶渊明",
                        content:"种豆南山下，草盛豆苗稀。晨兴理荒秽，带月荷锄归。道狭草木长，夕露沾我衣。衣沾不足惜，但使愿无违。"
                    },
                    {
                        name:"杂诗十二首·其一·陶渊明",
                        content:"人生无根蒂，飘如陌上尘。分散逐风转，此已非常身。落地为兄弟，何必骨肉亲！得欢当作乐，斗酒聚比邻。盛年不重来，一日难再晨。及时当勉励，岁月不待人。"
                    },
                    {
                        name:"五柳先生传·陶渊明",
                        content:"先生不知何许人也，亦不详其姓字，宅边有五柳树，因以为号焉。闲静少言，不慕荣利。好读书，不求甚解；每有会意，便欣然忘食。性嗜酒，家贫不能常得。亲旧知其如此，或置酒而招之；造饮辄尽，期在必醉。既醉而退，曾不吝情去留。环堵萧然，不蔽风日；短褐穿结，箪瓢屡空，晏如也。常著文章自娱，颇示己志。忘怀得失，以此自终。赞曰：黔娄之妻有言：“不戚戚于贫贱，不汲汲于富贵。”其言兹若人之俦乎？衔觞赋诗，以乐其志，无怀氏之民欤？葛天氏之民欤？"
                    },
                    {
                        name:"咏荆轲·陶渊明",
                        content:"燕丹善养士，志在报强嬴。招集百夫良，岁暮得荆卿。君子死知己，提剑出燕京；素骥鸣广陌，慷慨送我行。雄发指危冠，猛气冲长缨。饮饯易水上，四座列群英。渐离击悲筑，宋意唱高声。萧萧哀风逝，淡淡寒波生。商音更流涕，羽奏壮士惊。心知去不归，且有后世名。登车何时顾，飞盖入秦庭。凌厉越万里，逶迤过千城。图穷事自至，豪主正怔营。惜哉剑术疏，奇功遂不成。其人虽已没，千载有馀情。"
                    }
                ]
            },
            {
                author:"范仲淹 朱熹 韩愈 岑参",
                article:[
                    {
                        name:"岳阳楼记·范仲淹",
                        content:"庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴，乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上，属予作文以记之。予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯，朝晖夕阴，气象万千，此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎？若夫淫雨霏霏，连月不开，阴风怒号，浊浪排空，日星隐曜，山岳潜形，商旅不行，樯倾楫摧，薄暮冥冥，虎啸猿啼。登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。(隐曜 一作：隐耀；淫雨 通：霪雨)至若春和景明，波澜不惊，上下天光，一碧万顷，沙鸥翔集，锦鳞游泳，岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极！登斯楼也，则有心旷神怡，宠辱偕忘，把酒临风，其喜洋洋者矣。嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲，居庙堂之高则忧其民，处江湖之远则忧其君。是进亦忧，退亦忧。然则何时而乐耶？其必曰“先天下之忧而忧，后天下之乐而乐”乎！噫！微斯人，吾谁与归？时六年九月十五日。"
                    },
                    {
                        name:"渔家傲·秋思·范仲淹",
                        content:"塞下秋来风景异，衡阳雁去无留意。四面边声连角起，千嶂里，长烟落日孤城闭。浊酒一杯家万里，燕然未勒归无计。羌管悠悠霜满地，人不寐，将军白发征夫泪。"
                    },
                    {
                        name:"苏幕遮·怀旧·范仲淹",
                        content:"碧云天，黄叶地，秋色连波，波上寒烟翠。山映斜阳天接水，芳草无情，更在斜阳外。黯乡魂，追旅思，夜夜除非，好梦留人睡。明月楼高休独倚，酒入愁肠，化作相思泪。"
                    },
                    {
                        name:"马说·韩愈",
                        content:"世有伯乐，然后有千里马。千里马常有，而伯乐不常有。故虽有名马，祗辱于奴隶人之手，骈死于槽枥之间，不以千里称也。马之千里者，一食或尽粟一石。食马者不知其能千里而食也。是马也，虽有千里之能，食不饱，力不足，才美不外见，且欲与常马等不可得，安求其能千里也？策之不以其道，食之不能尽其材，鸣之而不能通其意，执策而临之，曰：“天下无马！”呜呼！其真无马邪？其真不知马也！"
                    },
                    {
                        name:"师说·韩愈",
                        content:"古之学者必有师。师者，所以传道受业解惑也。人非生而知之者，孰能无惑？惑而不从师，其为惑也，终不解矣。生乎吾前，其闻道也固先乎吾，吾从而师之；生乎吾后，其闻道也亦先乎吾，吾从而师之。吾师道也，夫庸知其年之先后生于吾乎？是故无贵无贱，无长无少，道之所存，师之所存也。嗟乎！师道之不传也久矣！欲人之无惑也难矣！古之圣人，其出人也远矣，犹且从师而问焉；今之众人，其下圣人也亦远矣，而耻学于师。是故圣益圣，愚益愚。圣人之所以为圣，愚人之所以为愚，其皆出于此乎？爱其子，择师而教之；于其身也，则耻师焉，惑矣。彼童子之师，授之书而习其句读者，非吾所谓传其道解其惑者也。句读之不知，惑之不解，或师焉，或不焉，小学而大遗，吾未见其明也。巫医乐师百工之人，不耻相师。士大夫之族，曰师曰弟子云者，则群聚而笑之。问之，则曰：“彼与彼年相若也，道相似也，位卑则足羞，官盛则近谀。”呜呼！师道之不复，可知矣。巫医乐师百工之人，君子不齿，今其智乃反不能及，其可怪也欤！圣人无常师。孔子师郯子、苌弘、师襄、老聃。郯子之徒，其贤不及孔子。孔子曰：三人行，则必有我师。是故弟子不必不如师，师不必贤于弟子，闻道有先后，术业有专攻，如是而已。李氏子蟠，年十七，好古文，六艺经传皆通习之，不拘于时，学于余。余嘉其能行古道，作《师说》以贻之。"
                    },
                    {
                        name:"早春呈水部张十八员外·韩愈",
                        content:"天街小雨润如酥，草色遥看近却无。最是一年春好处，绝胜烟柳满皇都。"
                    },
                    {
                        name:"春雪·韩愈",
                        content:"新年都未有芳华，二月初惊见草芽。白雪却嫌春色晚，故穿庭树作飞花。"
                    },
                    {
                        name:"左迁至蓝关示侄孙湘·韩愈",
                        content:"一封朝奏九重天，夕贬潮州路八千。欲为圣明除弊事，肯将衰朽惜残年！云横秦岭家何在？雪拥蓝关马不前。知汝远来应有意，好收吾骨瘴江边。"
                    },
                    {
                        name:"调张籍·韩愈",
                        content:"李杜文章在，光焰万丈长。不知群儿愚，那用故谤伤。蚍蜉撼大树，可笑不自量！伊我生其后，举颈遥相望。夜梦多见之，昼思反微茫。徒观斧凿痕，不瞩治水航。想当施手时，巨刃磨天扬。垠崖划崩豁，乾坤摆雷硠。唯此两夫子，家居率荒凉。帝欲长吟哦，故遣起且僵。翦翎送笼中，使看百鸟翔。平生千万篇，金薤垂琳琅。仙官敕六丁，雷电下取将。流落人间者，太山一毫芒。我愿生两翅，捕逐出八荒。精诚忽交通，百怪入我肠。刺手拔鲸牙，举瓢酌天浆。腾身跨汗漫，不著织女襄。顾语地上友，经营无太忙。乞君飞霞佩，与我高颉颃。"
                    },
                    {
                        name:"春日·朱熹",
                        content:"胜日寻芳泗水滨，无边光景一时新。等闲识得东风面，万紫千红总是春。"
                    },
                    {
                        name:"观书有感·其一·朱熹",
                        content:"半亩方塘一鉴开，天光云影共徘徊。问渠那得清如许？为有源头活水来。"
                    },
                    {
                        name:"偶成·朱熹",
                        content:"少年易老学难成，一寸光阴不可轻。未觉池塘春草梦，阶前梧叶已秋声。"
                    },
                    {
                        name:"水调歌头·隐括杜牧之齐山诗·朱熹",
                        content:"江水浸云影，鸿雁欲南飞。携壶结客何处？空翠渺烟霏。尘世难逢一笑，况有紫萸黄菊，堪插满头归。风景今朝是，身世昔人非。酬佳节，须酩酊，莫相违。人生如寄，何事辛苦怨斜晖。无尽今来古往，多少春花秋月，那更有危机。与问牛山客，何必独沾衣。"
                    },
                    {
                        name:"奉酬九日东峰道人溥公见赠之作·朱熹",
                        content:"几年回首梦云关，此日重来两鬓斑。点检梁间新岁月，招呼台上旧溪山。三生漫说终无据，万法由来本自闲。一笑支郎又相恼，新诗不落语言间。"
                    },
                    {
                        name:"白雪歌送武判官归京·岑参",
                        content:"北风卷地白草折，胡天八月即飞雪。忽如一夜春风来，千树万树梨花开。散入珠帘湿罗幕，狐裘不暖锦衾薄。将军角弓不得控，都护铁衣冷难着。瀚海阑干百丈冰，愁云惨淡万里凝。中军置酒饮归客，胡琴琵琶与羌笛。纷纷暮雪下辕门，风掣红旗冻不翻。轮台东门送君去，去时雪满天山路。山回路转不见君，雪上空留马行处。"
                    },
                    {
                        name:"凉州馆中与诸判官夜集·岑参",
                        content:"弯弯月出挂城头，城头月出照凉州。凉州七里十万家，胡人半解弹琵琶。琵琶一曲肠堪断，风萧萧兮夜漫漫。河西幕中多故人，故人别来三五春。花门楼前见秋草，岂能贫贱相看老。一生大笑能几回，斗酒相逢须醉倒。"
                    },
                    {
                        name:"逢入京使·岑参",
                        content:"故园东望路漫漫，双袖龙钟泪不干。马上相逢无纸笔，凭君传语报平安。"
                    },
                    {
                        name:"奉和中书舍人贾至早朝大明宫·岑参",
                        content:"鸡鸣紫陌曙光寒，莺啭皇州春色阑。金阙晓钟开万户，玉阶仙仗拥千官。花迎剑佩星初落，柳拂旌旗露未干。独有凤凰池上客，阳春一曲和皆难。"
                    },
                    {
                        name:"蜀葵花歌·岑参",
                        content:"昨日一花开，今日一花开。今日花正好，昨日花已老。始知人老不如花，可惜落花君莫扫。人生不得长少年，莫惜床头沽酒钱。请君有钱向酒家，君不见，蜀葵花。"
                    },
                ]
            },
            {
                author:"名诗词集",
                article:[
                    {
                        name: "春江花月夜·张若虚",
                        content: "春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明！江流宛转绕芳甸，月照花林皆似霰。空里流霜不觉飞，汀上白沙看不见。江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年望相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月裴回，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归，落月摇情满江树。"
                    },
                    {
                        name:"唐多令·芦叶满汀洲·刘过",
                        content:"安远楼小集，侑觞歌板之姬黄其姓者，乞词于龙洲道人，为赋此《唐多令》。同柳阜之、刘去非、石民瞻、周嘉仲、陈孟参、孟容。时八月五日也。芦叶满汀洲，寒沙带浅流。二十年重过南楼。柳下系船犹未稳，能几日，又中秋。黄鹤断矶头，故人今在否？旧江山浑是新愁。欲买桂花同载酒，终不似，少年游。"
                    },
                    {
                        name:"代悲白头翁·刘希夷",
                        content:"洛阳城东桃李花，飞来飞去落谁家？洛阳女儿惜颜色，坐见落花长叹息。今年花落颜色改，明年花开复谁在？已见松柏摧为薪，更闻桑田变成海。古人无复洛城东，今人还对落花风。年年岁岁花相似，岁岁年年人不同。寄言全盛红颜子，应怜半死白头翁。此翁白头真可怜，伊昔红颜美少年。公子王孙芳树下，清歌妙舞落花前。光禄池台文锦绣，将军楼阁画神仙。一朝卧病无相识，三春行乐在谁边？宛转蛾眉能几时？须臾鹤发乱如丝。但看古来歌舞地，惟有黄昏鸟雀悲。"
                    },
                    {
                        name:"满江红·写怀·岳飞",
                        content:"怒发冲冠，凭栏处、潇潇雨歇。抬望眼，仰天长啸，壮怀激烈。三十功名尘与土，八千里路云和月。莫等闲，白了少年头，空悲切！靖康耻，犹未雪。臣子恨，何时灭！驾长车，踏破贺兰山缺。壮志饥餐胡虏肉，笑谈渴饮匈奴血。待从头、收拾旧山河，朝天阙。"
                    },
                    {
                        name:"过零丁洋·文天祥",
                        content:"辛苦遭逢起一经，干戈寥落四周星。山河破碎风飘絮，身世浮沉雨打萍。惶恐滩头说惶恐，零丁洋里叹零丁。人生自古谁无死？留取丹心照汗青。"
                    },
                    {
                        name:"正气歌·文天祥",
                        content:"予囚北庭，坐一土室。室广八尺，深可四寻。单扉低小，白间短窄，污下而幽暗。当此夏日，诸气萃然：雨潦四集，浮动床几，时则为水气；涂泥半朝，蒸沤历澜，时则为土气；乍晴暴热，风道四塞，时则为日气；檐阴薪爨，助长炎虐，时则为火气；仓腐寄顿，陈陈逼人，时则为米气；骈肩杂遝，腥臊汗垢，时则为人气；或圊溷、或毁尸、或腐鼠，恶气杂出，时则为秽气。叠是数气，当侵沴，鲜不为厉。而予以孱弱，俯仰其间，於兹二年矣，幸而无恙，是殆有养致然尔。然亦安知所养何哉？孟子曰：“吾善养吾浩然之气。”彼气有七，吾气有一，以一敌七，吾何患焉！况浩然者，乃天地之正气也，作正气歌一首。天地有正气，杂然赋流形。下则为河岳，上则为日星。于人曰浩然，沛乎塞苍冥。皇路当清夷，含和吐明庭。时穷节乃见，一一垂丹青。在齐太史简，在晋董狐笔。在秦张良椎，在汉苏武节。为严将军头，为嵇侍中血。为张睢阳齿，为颜常山舌。或为辽东帽，清操厉冰雪。或为出师表，鬼神泣壮烈。或为渡江楫，慷慨吞胡羯。或为击贼笏，逆竖头破裂。是气所磅礴，凛烈万古存。当其贯日月，生死安足论。地维赖以立，天柱赖以尊。三纲实系命，道义为之根。嗟予遘阳九，隶也实不力。楚囚缨其冠，传车送穷北。鼎镬甘如饴，求之不可得。阴房阗鬼火，春院閟天黑。牛骥同一皂，鸡栖凤凰食。一朝蒙雾露，分作沟中瘠。如此再寒暑，百沴自辟易。嗟哉沮洳场，为我安乐国。岂有他缪巧，阴阳不能贼。顾此耿耿在，仰视浮云白。悠悠我心悲，苍天曷有极。哲人日已远，典刑在夙昔。风檐展书读，古道照颜色。"
                    },
                    {
                        name:"白马篇·曹植",
                        content:"白马饰金羁，连翩西北驰。借问谁家子，幽并游侠儿。少小去乡邑，扬声沙漠垂。宿昔秉良弓，楛矢何参差。控弦破左的，右发摧月支。仰手接飞猱，俯身散马蹄。狡捷过猴猿，勇剽若豹螭。边城多警急，虏骑数迁移。羽檄从北来，厉马登高堤。长驱蹈匈奴，左顾凌鲜卑。弃身锋刃端，性命安可怀？父母且不顾，何言子与妻！名编壮士籍，不得中顾私。捐躯赴国难，视死忽如归！"
                    },
                    {
                        name:"洛神赋·曹植",
                        content:"黄初三年，余朝京师，还济洛川。古人有言：斯水之神，名曰宓妃。感宋玉对楚王神女之事，遂作斯赋。其辞曰：余从京域，言归东藩，背伊阙，越轘辕，经通谷，陵景山。日既西倾，车殆马烦。尔乃税驾乎蘅皋，秣驷乎芝田，容与乎阳林，流眄乎洛川。于是精移神骇，忽焉思散。俯则未察，仰以殊观。睹一丽人，于岩之畔。乃援御者而告之曰：“尔有觌于彼者乎？彼何人斯，若此之艳也！”御者对曰：“臣闻河洛之神，名曰宓妃。然则君王之所见也，无乃是乎！其状若何？臣愿闻之。”余告之曰：其形也，翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。髣髴兮若轻云之蔽月，飘飖兮若流风之回雪。远而望之，皎若太阳升朝霞；迫而察之，灼若芙蕖出渌波。秾纤得衷，修短合度。肩若削成，腰如约素。延颈秀项，皓质呈露。芳泽无加，铅华弗御。云髻峨峨，修眉联娟。丹唇外朗，皓齿内鲜。明眸善睐，靥辅承权。瓌姿艳逸，仪静体闲。柔情绰态，媚于语言。奇服旷世，骨像应图。披罗衣之璀粲兮，珥瑶碧之华琚。戴金翠之首饰，缀明珠以耀躯。践远游之文履，曳雾绡之轻裾。微幽兰之芳蔼兮，步踟蹰于山隅。于是忽焉纵体，以遨以嬉。左倚采旄，右荫桂旗。攘皓腕于神浒兮，采湍濑之玄芝。余情悦其淑美兮，心振荡而不怡。无良媒以接欢兮，托微波而通辞。愿诚素之先达兮，解玉佩以要之。嗟佳人之信修兮，羌习礼而明诗。抗琼珶以和予兮，指潜渊而为期。执眷眷之款实兮，惧斯灵之我欺。感交甫之弃言兮，怅犹豫而狐疑。收和颜而静志兮，申礼防以自持。于是洛灵感焉，徙倚彷徨。神光离合，乍阴乍阳。竦轻躯以鹤立，若将飞而未翔。践椒涂之郁烈，步蘅薄而流芳。超长吟以永慕兮，声哀厉而弥长。尔乃众灵杂沓，命俦啸侣。或戏清流，或翔神渚，或采明珠，或拾翠羽。从南湘之二妃，携汉滨之游女。叹匏瓜之无匹兮，咏牵牛之独处。扬轻袿之猗靡兮，翳修袖以延伫。体迅飞凫，飘忽若神。凌波微步，罗袜生尘。动无常则，若危若安；进止难期，若往若还。转眄流精，光润玉颜。含辞未吐，气若幽兰。华容婀娜，令我忘餐。于是屏翳收风，川后静波。冯夷鸣鼓，女娲清歌。腾文鱼以警乘，鸣玉銮以偕逝。六龙俨其齐首，载云车之容裔。鲸鲵踊而夹毂，水禽翔而为卫。于是越北沚，过南冈，纡素领，回清扬。动朱唇以徐言，陈交接之大纲。恨人神之道殊兮，怨盛年之莫当。抗罗袂以掩涕兮，泪流襟之浪浪。悼良会之永绝兮，哀一逝而异乡。无微情以效爱兮，献江南之明珰。虽潜处于太阴，长寄心于君王。忽不悟其所舍，怅神宵而蔽光。于是背下陵高，足往神留。遗情想像，顾望怀愁。冀灵体之复形，御轻舟而上溯。浮长川而忘反，思绵绵而增慕。夜耿耿而不寐，沾繁霜而至曙。命仆夫而就驾，吾将归乎东路。揽騑辔以抗策，怅盘桓而不能去。"
                    },
                    {
                        name:"江陵愁望寄子安·鱼玄机",
                        content:"枫叶千枝复万枝，江桥掩映暮帆迟。忆君心似西江水，日夜东流无歇时。"
                    },
                    {
                        name:"赠邻女鱼玄机",
                        content:"羞日遮罗袖，愁春懒起妆。易求无价宝，难得有心郎。枕上潜垂泪，花间暗断肠。自能窥宋玉，何必恨王昌？"
                    },
                    {
                        name:"临江仙·梦后楼台高锁·晏几道",
                        content:"梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。记得小蘋初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。"
                    },
                    {
                        name:"清平乐·留人不住·晏几道",
                        content:"留人不住，醉解兰舟去。一棹碧涛春水路，过尽晓莺啼处。渡头杨柳青青，枝枝叶叶离情。此后锦书休寄，画楼云雨无凭。"
                    },
                    {
                        name:"新添声杨柳枝词二首·温庭筠",
                        content:"一尺深红胜曲尘，天生旧物不如新。合欢桃核终堪恨，里许元来别有人。井底点灯深烛伊，共郎长行莫围棋。玲珑骰子安红豆，入骨相思知不知。"
                    },
                    {
                        name:"望江南·梳洗罢·温庭筠",
                        content:"梳洗罢，独倚望江楼。过尽千帆皆不是，斜晖脉脉水悠悠。肠断白蘋洲。"
                    },
                    {
                        name:"梦江南·千万恨·温庭筠",
                        content:"千万恨，恨极在天涯。山月不知心里事，水风空落眼前花，摇曳碧云斜。"
                    },
                    {
                        name:"商山早行·温庭筠",
                        content:"晨起动征铎，客行悲故乡。鸡声茅店月，人迹板桥霜。槲叶落山路，枳花明驿墙。因思杜陵梦，凫雁满回塘。"
                    },
                    {
                        name:"和友人伤歌姬·温庭筠",
                        content:"月缺花残莫怆然，花须终发月终圆。更能何事销芳念，亦有浓华委逝川。一曲艳歌留婉转，九原春草妒婵娟。王孙莫学多情客，自古多情损少年。"
                    },
                    {
                        name:"登幽州台歌·陈子昂",
                        content:"前不见古人，后不见来者。念天地之悠悠，独怆然而涕下！"
                    },
                    {
                        name:"己亥岁感事·曹松",
                        content:"泽国江山入战图，生民何计乐樵苏。凭君莫话封侯事，一将功成万骨枯。"
                    },
                    {
                        name:"山坡羊·潼关怀古·张养浩",
                        content:"峰峦如聚，波涛如怒，山河表里潼关路。望西都，意踌躇。伤心秦汉经行处，宫阙万间都做了土。兴，百姓苦；亡，百姓苦。"
                    },
                    {
                        name:"山坡羊·骊山怀古·张养浩",
                        content:"骊山四顾，阿房一炬，当时奢侈今何处？只见草萧疏，水萦纡。至今遗恨迷烟树。列国周齐秦汉楚。赢，都变做了土；输，都变做了土。"
                    },
                    {
                        name:"殿前欢·对菊自叹·张养浩",
                        content:"可怜秋，一帘疏雨暗西楼，黄花零落重阳后，减尽风流。对黄花人自羞，花依旧，人比黄花瘦。问花不语，花替人愁。"
                    },
                    {
                        name:"题龙阳县青草湖·唐珙",
                        content:"西风吹老洞庭波，一夜湘君白发多。醉后不知天在水，满船清梦压星河。"
                    },
                    {
                        name:"观沧海·曹操",
                        content:"东临碣石，以观沧海。水何澹澹，山岛竦峙。树木丛生，百草丰茂。秋风萧瑟，洪波涌起。日月之行，若出其中；星汉灿烂，若出其里。幸甚至哉，歌以咏志。"
                    },
                    {
                        name:"短歌行·曹操",
                        content:"对酒当歌，人生几何！譬如朝露，去日苦多。慨当以慷，忧思难忘。何以解忧？唯有杜康。青青子衿，悠悠我心。但为君故，沉吟至今。呦呦鹿鸣，食野之苹。我有嘉宾，鼓瑟吹笙。明明如月，何时可掇？忧从中来，不可断绝。越陌度阡，枉用相存。契阔谈讌，心念旧恩。月明星稀，乌鹊南飞。绕树三匝，何枝可依？山不厌高，海不厌深。周公吐哺，天下归心。"
                    },
                    {
                        name:"龟虽寿·曹操",
                        content:"神龟虽寿，犹有竟时。腾蛇乘雾，终为土灰。老骥伏枥，志在千里。烈士暮年，壮心不已。盈缩之期，不但在天；养怡之福，可得永年。幸甚至哉，歌以咏志。"
                    },
                    {
                        name:"不第后赋菊·黄巢",
                        content:"待到秋来九月八，我花开后百花杀。冲天香阵透长安，满城尽带黄金甲。"
                    },
                    {
                        name:"垓下歌·项羽",
                        content:"力拔山兮气盖世。时不利兮骓不逝。骓不逝兮可奈何！虞兮虞兮奈若何！"
                    },
                    {
                        name:"大风歌·刘邦",
                        content:"大风起兮云飞扬，威加海内兮归故乡，安得猛士兮守四方！"
                    },
                    {
                        name:"赐萧瑀·李世民",
                        content:"疾风知劲草，板荡识诚臣。勇夫安识义，智者必怀仁。"
                    },
                    {
                        name:"剑客",
                        content:"十年磨一剑，霜刃未曾试。今日把示君，谁有不平事？"
                    },
                    {
                        name:"献钱尚父",
                        content:"贵逼人来不自由，龙骧凤翥势难收。满堂花醉三千客，一剑霜寒十四州。鼓角揭天嘉气冷，风涛动地海山秋。东南永作金天柱，谁羡当时万户侯。"
                    },
                    {
                        name:"夜坐·其二",
                        content:"沉沉心事北南东，一睨人材海内空。壮岁始参周史席，髫年惜堕晋贤风。功高拜将成仙外，才尽回肠荡气中。万一禅关砉然破，美人如玉剑如虹。"
                    },
                    {
                        name:"采薇·佚名",
                        content:"采薇采薇，薇亦作止。曰归曰归，岁亦莫止。 靡室靡家，猃狁之故。不遑启居，猃狁之故。采薇采薇，薇亦柔止。曰归曰归，心亦忧止。 忧心烈烈，载饥载渴。我戍未定，靡使归聘。采薇采薇，薇亦刚止。曰归曰归，岁亦阳止。 王事靡盬，不遑启处。忧心孔疚，我行不来！彼尔维何？维常之华。彼路斯何？君子之车。 戎车既驾，四牡业业。岂敢定居？一月三捷。驾彼四牡，四牡骙骙。君子所依，小人所腓。 四牡翼翼，象弭鱼服。岂不日戒？猃狁孔棘！昔我往矣，杨柳依依。今我来思，雨雪霏霏。 行道迟迟，载渴载饥。我心伤悲，莫知我哀！"
                    },
                    {
                        name:"筹笔驿·罗隐",
                        content:"抛掷南阳为主忧，北征东讨尽良筹。时来天地皆同力，运去英雄不自由。千里山河轻孺子，两朝冠剑恨谯周。唯余岩下多情水，犹解年年傍驿流。"
                    },
                    {
                        name:"送东阳马生序·宋濂",
                        content:"余幼时即嗜学。家贫，无从致书以观，每假借于藏书之家，手自笔录，计日以还。天大寒，砚冰坚，手指不可屈伸，弗之怠。录毕，走送之，不敢稍逾约。以是人多以书假余，余因得遍观群书。既加冠，益慕圣贤之道 。又患无硕师名人与游，尝趋百里外，从乡之先达执经叩问。先达德隆望尊，门人弟子填其室，未尝稍降辞色。余立侍左右，援疑质理，俯身倾耳以请；或遇其叱咄，色愈恭，礼愈至，不敢出一言以复；俟其欣悦，则又请焉。故余虽愚，卒获有所闻。当余之从师也，负箧曳屣行深山巨谷中。穷冬烈风，大雪深数尺，足肤皲裂而不知。至舍，四支僵劲不能动，媵人持汤沃灌，以衾拥覆，久而乃和。寓逆旅，主人日再食，无鲜肥滋味之享。同舍生皆被绮绣，戴朱缨宝饰之帽，腰白玉之环，左佩刀，右备容臭，烨然若神人；余则缊袍敝衣处其间，略无慕艳意，以中有足乐者，不知口体之奉不若人也。盖余之勤且艰若此。今虽耄老，未有所成，犹幸预君子之列，而承天子之宠光，缀公卿之后，日侍坐备顾问，四海亦谬称其氏名，况才之过于余者乎？今诸生学于太学，县官日有廪稍之供，父母岁有裘葛之遗，无冻馁之患矣；坐大厦之下而诵诗书，无奔走之劳矣；有司业、博士为之师，未有问而不告、求而不得者也；凡所宜有之书，皆集于此，不必若余之手录，假诸人而后见也。其业有不精、德有不成者，非天质之卑，则心不若余之专耳，岂他人之过哉！东阳马生君则，在太学已二年，流辈甚称其贤。余朝京师，生以乡人子谒余，撰长书以为贽，辞甚畅达。与之论辨，言和而色夷。自谓少时用心于学甚劳，是可谓善学者矣。其将归见其亲也，余故道为学之难以告之。谓余勉乡人以学者，余之志也；诋我夸际遇之盛而骄乡人者，岂知予者哉！"
                    },
                    {
                        name:"凤求凰·司马相如·其一",
                        content:"有一美人兮，见之不忘。一日不见兮，思之如狂。凤飞翱翔兮，四海求凰。无奈佳人兮，不在东墙。将琴代语兮，聊写衷肠。何时见许兮，慰我彷徨。愿言配德兮，携手相将。不得於飞兮，使我沦亡。"
                    },
                    {
                        name:"凤求凰·司马相如·其二",
                        content:"凤兮凤兮归故乡，遨游四海求其凰。时未遇兮无所将，何悟今兮升斯堂！有艳淑女在闺房，室迩人遐毒我肠。何缘交颈为鸳鸯，胡颉颃兮共翱翔！凰兮凰兮从我栖，得托孳尾永为妃。交情通意心和谐，中夜相从知者谁？双翼俱起翻高飞，无感我思使余悲。"
                    },
                    {
                        name:"白头吟·卓文君",
                        content:"皑如山上雪，皎若云间月。闻君有两意，故来相决绝。今日斗酒会，明旦沟水头。躞蹀御沟上，沟水东西流。凄凄复凄凄，嫁娶不须啼。愿得一心人，白头不相离。竹竿何袅袅，鱼尾何簁簁！男儿重意气，何用钱刀为！"
                    },
                    {
                        name:"诀别书·卓文君",
                        content:"春华竞芳，五色凌素，琴尚在御，而新声代故！锦水有鸳，汉宫有木，彼物而新，嗟世之人兮，瞀于淫而不悟！朱弦断，明镜缺，朝露晞，芳时歇，白头吟，伤离别，努力加餐勿念妾，锦水汤汤，与君长诀！"
                    },
                    {
                        name:"蝶恋花·阅尽天涯离别苦·王国维",
                        content:"阅尽天涯离别苦，不道归来，零落花如许。花底相看无一语，绿窗春与天俱莫。待把相思灯下诉，一缕新欢，旧恨千千缕。最是人间留不住，朱颜辞镜花辞树。"
                    },
                    {
                        name:"蝶恋花·伫倚危楼风细细·柳永",
                        content:"伫倚危楼风细细，望极春愁，黯黯生天际。草色烟光残照里，无言谁会凭阑意。拟把疏狂图一醉，对酒当歌，强乐还无味。衣带渐宽终不悔，为伊消得人憔悴。"
                    },
                    {
                        name:"雨霖铃·寒蝉凄切·柳永",
                        content:"寒蝉凄切，对长亭晚，骤雨初歇。都门帐饮无绪，留恋处，兰舟催发。执手相看泪眼，竟无语凝噎。念去去，千里烟波，暮霭沉沉楚天阔。多情自古伤离别，更那堪，冷落清秋节！今宵酒醒何处？杨柳岸，晓风残月。此去经年，应是良辰好景虚设。便纵有千种风情，更与何人说？"
                    },
                    {
                        name:"鹤冲天·黄金榜上·柳永",
                        content:"黄金榜上，偶失龙头望。明代暂遗贤，如何向。未遂风云便，争不恣狂荡。何须论得丧？才子词人，自是白衣卿相。烟花巷陌，依约丹青屏障。幸有意中人，堪寻访。且恁偎红倚翠，风流事、平生畅。青春都一饷。忍把浮名，换了浅斟低唱！"
                    },
                    {
                        name:"昼夜乐·洞房记得初相遇·柳永",
                        content:"洞房记得初相遇。便只合、长相聚。何期小会幽欢，变作离情别绪。况值阑珊春色暮，对满目、乱花狂絮。直恐好风光，尽随伊归去。一场寂寞凭谁诉。算前言、总轻负。早知恁地难拚，悔不当时留住。其奈风流端正外，更别有，系人心处。一日不思量，也攒眉千度。"
                    },
                    {
                        name:"寄黄几复·黄庭坚",
                        content:"我居北海君南海，寄雁传书谢不能。桃李春风一杯酒，江湖夜雨十年灯。持家但有四立壁，治病不蕲三折肱。想见读书头已白，隔溪猿哭瘴溪藤。"
                    },
                ]
            }
        ]
    },
    {
        title: "百家名言",
        data: [
            {
            author:"儒家",
            article:[
                {
                    name: "论语·学而篇",
                    content: "子曰：“学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？”有子曰：“其为人也孝弟，而好犯上者，鲜矣；不好犯上而好作乱者，未之有也。君子务本，本立而道生。孝弟也者，其为仁之本与！”子曰：“巧言令色，鲜矣仁！”曾子曰：“吾日三省吾身：为人谋而不忠乎？与朋友交而不信乎？传不习乎？”子曰：“道千乘之国，敬事而信，节用而爱人，使民以时。”子曰：“弟子入则孝，出则弟，谨而信，泛爱众，而亲仁，行有余力，则以学文。”子夏曰：“贤贤易色；事父母，能竭其力；事君，能致其身；与朋友交，言而有信。虽曰未学，吾必谓之学矣。”子曰：“君子不重则不威，学则不固。主忠信，无友不如己者，过，则勿惮改。”曾子曰：“慎终追远，民德归厚矣。”子禽问于子贡曰：“夫子至于是邦也，必闻其政，求之与，抑与之与？”子贡曰：“夫子温、良、恭、俭、让以得之。夫子之求之也，其诸异乎人之求之与？”子曰：“父在，观其志；父没，观其行；三年无改于父之道，可谓孝矣。”有子曰：“礼之用，和为贵。先王之道，斯为美。小大由之，有所不行。知和而和，不以礼节之，亦不可行也。”有子曰：“信近于义，言可复也。恭近于礼，远耻辱也。因不失其亲，亦可宗也。”子曰：“君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。”子贡曰：“贫而无谄，富而无骄，何如？”子曰：“可也。未若贫而乐，富而好礼者也。”子贡曰：“《诗》云：‘如切如磋，如琢如磨’，其斯之谓与？”子曰：“赐也，始可与言《诗》已矣，告诸往而知来者。”子曰：“不患人之不己知，患不知人也。”"
                },
                {
                    name: "论语·为政篇",
                    content: "子曰：“为政以德，譬如北辰，居其所而众星共之。”子曰：“《诗》三百，一言以蔽之，曰：‘思无邪’。子曰：“道之以政，齐之以刑，民免而无耻。道之以德，齐之以礼，有耻且格。子曰：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不逾矩。孟懿子问孝，子曰：“无违。”樊迟御，子告之曰：“孟孙问孝于我，我对曰‘无违’。”樊迟曰：“何谓也？”子曰：“生，事之以礼；死，葬之以礼，祭之以礼。孟武伯问孝。子曰：“父母唯其疾之忧。子游问孝。子曰：“今之孝者，是谓能养。至于犬马，皆能有养；不敬，何以别乎？子夏问孝。子曰：“色难。有事，弟子服其劳；有酒食，先生馔，曾是以为孝乎？子曰：“吾与回言终日，不违，如愚。退而省其私，亦足以发，回也不愚。子曰：“视其所以，观其所由，察其所安，人焉廋哉？人焉廋哉？子曰：“温故而知新，可以为师矣。子曰：“君子不器。子贡问君子。子曰：“先行其言而后从之。子曰：“君子周而不比，小人比而不周。子曰：“学而不思则罔，思而不学则殆。子曰：“攻乎异端，斯害也已！子曰：“由，诲女知之乎！知之为知之，不知为不知，是知也。子张学干禄。子曰：“多闻阙疑，慎言其余，则寡尤；多见阙殆，慎行其余，则寡悔。言寡尤，行寡悔，禄在其中矣。哀公问曰：“何为则民服？”孔子对曰：“举直错诸枉，则民服；举枉错诸直，则民不服。季康子问：“使民敬、忠以劝，如之何？”子曰：“临之以庄，则敬；孝慈，则忠；举善而教不能，则劝。或谓孔子曰：“子奚不为政？”子曰：“《书》云：‘孝乎惟孝，友于兄弟。’施于有政，是亦为政，奚其为为政？子曰：“人而无信，不知其可也。大车无輗，小车无軏，其何以行之哉？子张问：“十世可知也？”子曰：“殷因于夏礼，所损益，可知也；周因于殷礼，所损益，可知也。其或继周者，虽百世，可知也。子曰：“非其鬼而祭之，谄也；见义不为，无勇也。”"
                },
                {
                    name: "论语·八佾篇",
                    content: "孔子谓季氏：“八佾舞于庭，是可忍也，孰不可忍也？”三家者以《雍》彻，子曰：“‘相维辟公，天子穆穆’，奚取于三家之堂？”子曰：“人而不仁，如礼何？人而不仁，如乐何？”林放问礼之本，子曰：“大哉问！礼，与其奢也，宁俭；丧，与其易也，宁戚。”子曰：“夷狄之有君，不如诸夏之亡也。”季氏旅于泰山。子谓冉有曰：“女弗能救与？”对曰：“不能。”子曰：“呜呼！曾谓泰山不如林放乎？”子曰：“君子无所争，必也射乎！揖让而升，下而饮。其争也君子。”子夏问曰：“‘巧笑倩兮，美目盼兮，素以为绚兮’何谓也？”子曰：“绘事后素。”曰：“礼后乎？”子曰：“起予者商也，始可与言《诗》已矣。”子曰：“夏礼吾能言之，杞不足征也；殷礼吾能言之，宋不足征也。文献不足故也，足则吾能征之矣。”子曰：“禘自既灌而往者，吾不欲观之矣。”或问禘之说。子曰：“不知也。知其说者之于天下也，其如示诸斯乎！”指其掌。祭如在，祭神如神在。子曰：“吾不与祭，如不祭。”王孙贾问曰：“‘与其媚于奥，宁媚于灶’，何谓也？”子曰：“不然，获罪于天，无所祷也。”子曰：“周监于二代，郁郁乎文哉！吾从周。”子入太庙，每事问。或曰：“孰谓鄹人之子知礼乎？入太庙，每事问。”子闻之，曰：“是礼也。”子曰：“射不主皮，为力不同科，古之道也。”子贡欲去告朔之饩羊，子曰：“赐也！尔爱其羊，我爱其礼。”子曰：“事君尽礼，人以为谄也。”定公问：“君使臣，臣事君，如之何？”孔子对曰：“君使臣以礼，臣事君以忠。”子曰：“《关雎》，乐而不淫，哀而不伤。”哀公问社于宰我，宰我对曰：“夏后氏以松，殷人以柏，周人以栗，曰使民战栗。”子闻之，曰：“成事不说，遂事不谏，既往不咎。”子曰：“管仲之器小哉！”或曰：“管仲俭乎？”曰：“管氏有三归，官事不摄，焉得俭？”“然则管仲知礼乎？”曰：“邦君树塞门，管氏亦树塞门；邦君为两君之好，有反坫。管氏亦有反坫，管氏而知礼，孰不知礼？”子语鲁大师乐，曰：“乐其可知也。始作，翕如也；从之，纯如也，皦如也，绎如也，以成。”仪封人请见，曰：“君子之至于斯也，吾未尝不得见也。”从者见之。出曰：“二三子何患于丧乎？天下之无道也久矣，天将以夫子为木铎。”子谓《韶》：“尽美矣，又尽善也。”谓《武》：“尽美矣，未尽善也。”子曰：“居上不宽，为礼不敬，临丧不哀，吾何以观之哉？”"
                },
                {
                    name: "论语·里仁篇",
                    content: "子曰：“里仁为美，择不处仁，焉得知？”子曰：“不仁者不可以久处约，不可以长处乐。仁者安仁，知者利仁。子曰：“唯仁者能好人，能恶人。子曰：“苟志于仁矣，无恶也。子曰：“富与贵，是人之所欲也；不以其道得之，不处也。贫与贱，是人之所恶也；不以其道得之，不去也。君子去仁，恶乎成名？君子无终食之间违仁，造次必于是，颠沛必于是。子曰：“我未见好仁者，恶不仁者。好仁者，无以尚之；恶不仁者，其为仁矣，不使不仁者加乎其身，有能一日用其力于仁矣乎？我未见力不足者。盖有之矣，我未之见也。子曰：“人之过也，各于其党。观过，斯知仁矣。子曰：“朝闻道，夕死可矣。子曰：“士志于道，而耻恶衣恶食者，未足与议也。子曰：“君子之于天下也，无适也，无莫也，义之与比。子曰：“君子怀德，小人怀土；君子怀刑，小人怀惠。子曰：“放于利而行，多怨。子曰：“能以礼让为国乎？何有？不能以礼让为国，如礼何？子曰：“不患无位，患所以立；不患莫己知，求为可知也。子曰：“参乎！吾道一以贯之。”曾子曰：“唯。”子出，门人问曰：“何谓也？”曾子曰：“夫子之道，忠恕而已矣。子曰：“君子喻于义，小人喻于利。子曰：“见贤思齐焉，见不贤而内自省也。子曰：“事父母几谏，见志不从，又敬不违，劳而不怨。子曰：“父母在，不远游，游必有方。子曰：“三年无改于父之道，可谓孝矣。子曰：“父母之年，不可不知也。一则以喜，一则以惧。子曰：“古者言之不出，耻躬之不逮也。子曰：“以约失之者鲜矣。子曰：“君子欲讷于言而敏于行。子曰：“德不孤，必有邻。子游曰：“事君数，斯辱矣；朋友数，斯疏矣。”"
                },
                {
                    name: "论语·公冶长篇",
                    content: "子谓公冶长：“可妻也，虽在缧绁之中，非其罪也！”以其子妻之。子谓南容：“邦有道不废；邦无道免于刑戮。”以其兄之子妻之。子谓子贱：“君子哉若人！鲁无君子者，斯焉取斯？”子贡问曰：“赐也何如？”子曰：“女器也。”曰：“何器也？”曰：“瑚琏也。”或曰：“雍也仁而不佞。”子曰：“焉用佞？御人以口给，屡憎于人。不知其仁，焉用佞？”子使漆雕开仕，对曰：“吾斯之未能信。”子说。子曰：“道不行，乘桴浮于海，从我者其由与？”子路闻之喜，子曰：“由也好勇过我，无所取材。”孟武伯问：“子路仁乎？”子曰：“不知也。”又问，子曰：“由也，千乘之国，可使治其赋也，不知其仁也。”“求也何如？”子曰：“求也，千室之邑、百乘之家，可使为之宰也，不知其仁也。”“赤也何如？”子曰：“赤也，束带立于朝，可使与宾客言也，不知其仁也。”子谓子贡曰：“女与回也孰愈？”对曰：“赐也何敢望回？回也闻一以知十，赐也闻一以知二。”子曰：“弗如也，吾与女弗如也！”宰予昼寝，子曰：“朽木不可雕也，粪土之墙不可圬也，于予与何诛？”子曰：“始吾于人也，听其言而信其行；今吾于人也，听其言而观其行。于予与改是。”子曰：“吾未见刚者。”或对曰：“申枨。”子曰：“枨也欲，焉得刚？”子贡曰：“我不欲人之加诸我也，吾亦欲无加诸人。”子曰：“赐也，非尔所及也。”子贡曰：“夫子之文章，可得而闻也；夫子之言性与天道，不可得而闻也。”子路有闻，未之能行，唯恐有闻。子贡问曰：“孔文子何以谓之文也？”子曰：“敏而好学，不耻下问，是以谓之文也。”子谓子产：“有君子之道四焉：其行己也恭，其事上也敬，其养民也惠，其使民也义。”子曰：“晏平仲善与人交，久而敬之。”子曰：“臧文仲居蔡，山节藻棁，何如其知也？”子张问曰：“令尹子文三仕为令尹，无喜色，三已之无愠色，旧令尹之政必以告新令尹，何如？”子曰：“忠矣。”曰：“仁矣乎？”曰：“未知，焉得仁？”“崔子弑齐君，陈文子有马十乘，弃而违之。至于他邦，则曰：‘犹吾大夫崔子也。’违之。之一邦，则又曰：‘犹吾大夫崔子也。’违之，何如？”子曰：“清矣。”曰：“仁矣乎？”曰：“未知，焉得仁？”季文子三思而后行，子闻之曰：“再斯可矣。”子曰：“宁武子，邦有道则知，邦无道则愚。其知可及也，其愚不可及也。”子在陈，曰：“归与！归与！吾党之小子狂简，斐然成章，不知所以裁之。”子曰：“伯夷、叔齐不念旧恶，怨是用希。”子曰：“孰谓微生高直？或乞醯焉，乞诸其邻而与之。”子曰：“巧言、令色、足恭，左丘明耻之，丘亦耻之。匿怨而友其人，左丘明耻之，丘亦耻之。”颜渊、季路侍，子曰：“盍各言尔志？”子路曰：“愿车马衣轻裘，与朋友共，敝之而无憾。”颜渊曰：“愿无伐善，无施劳。”子路曰：“愿闻子之志。”子曰：“老者安之，朋友信之，少者怀之。”子曰：“已矣乎！吾未见能见其过而内自讼者也。”子曰：“十室之邑，必有忠信如丘者焉，不如丘之好学也。”"
                },
                {
                    name: "论语·雍也篇",
                    content: "子曰：“雍也可使南面。”仲弓问子桑伯子，子曰：“可也，简。”仲弓曰：“居敬而行简，以临其民，不亦可乎？居简而行简，无乃大简乎？”子曰：“雍之言然。”哀公问：“弟子孰为好学？”孔子对曰：“有颜回者好学，不迁怒，不贰过，不幸短命死矣，今也则亡，未闻好学者也。”子华使于齐，冉子为其母请粟，子曰：“与之釜。”请益，曰：“与之庾。”冉子与之粟五秉。子曰：“赤之适齐也，乘肥马，衣轻裘。吾闻之也，君子周急不继富。”原思为之宰，与之粟九百，辞。子曰：“毋，以与尔邻里乡党乎！”子谓仲弓曰：“犁牛之子骍且角，虽欲勿用，山川其舍诸？”子曰：“回也，其心三月不违仁，其余则日月至焉而已矣。”季康子问：“仲由可使从政也与？”子曰：“由也果，于从政乎何有？”曰：“赐也可使从政也与？”曰：“赐也达，于从政乎何有？”曰：“求也可使从政也与？”曰：“求也艺，于从政乎何有？”季氏使闵子骞为费宰，闵子骞曰：“善为我辞焉。如有复我者，则吾必在汶上矣。”伯牛有疾，子问之，自牖执其手，曰：“亡之，命矣夫！斯人也而有斯疾也！斯人也而有斯疾也！”子曰：“贤哉回也！一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。贤哉，回也！”冉求曰：“非不说子之道，力不足也。”子曰：“力不足者，中道而废，今女画。”子谓子夏曰：“女为君子儒，无为小人儒。”子游为武城宰，子曰：“女得人焉尔乎？”曰：“有澹台灭明者，行不由径，非公事，未尝至于偃之室也。”子曰：“孟之反不伐，奔而殿，将入门，策其马曰：‘非敢后也，马不进也。’”子曰：“不有祝鮀之佞，而有宋朝之美，难乎免于今之世矣。”子曰：“谁能出不由户？何莫由斯道也？”子曰：“质胜文则野，文胜质则史。文质彬彬，然后君子。”子曰：“人之生也直，罔之生也幸而免。”子曰：“知之者不如好之者，好之者不如乐之者。”子曰：“中人以上，可以语上也；中人以下，不可以语上也。”樊迟问知，子曰：“务民之义，敬鬼神而远之，可谓知矣。”问仁，曰：“仁者先难而后获，可谓仁矣。”子曰：“知者乐水，仁者乐山。知者动，仁者静。知者乐，仁者寿。”子曰：“齐一变至于鲁，鲁一变至于道。”子曰：“觚不觚，觚哉！觚哉！”宰我问曰：“仁者，虽告之曰：‘井有仁焉。’其从之也？”子曰：“何为其然也？君子可逝也，不可陷也；可欺也，不可罔也。”子曰：“君子博学于文，约之以礼，亦可以弗畔矣夫。”子见南子，子路不说，夫子矢之曰：“予所否者，天厌之！天厌之！”子曰：“中庸之为德也，其至矣乎！民鲜久矣。”子贡曰：“如有博施于民而能济众，何如？可谓仁乎？”子曰：“何事于仁，必也圣乎！尧、舜其犹病诸！夫仁者，己欲立而立人，己欲达而达人。能近取譬，可谓仁之方也已。”"
                },
                {
                    name: "论语·述而篇",
                    content: "子曰：“述而不作，信而好古，窃比于我老彭。”子曰：“默而识之，学而不厌，诲人不倦，何有于我哉？”子曰：“德之不修，学之不讲，闻义不能徙，不善不能改，是吾忧也。”子之燕居，申申如也，夭夭如也。子曰：“甚矣吾衰也！久矣吾不复梦见周公。”子曰：“志于道，据于德，依于仁，游于艺。”子曰：“自行束脩以上，吾未尝无诲焉。”子曰：“不愤不启，不悱不发，举一隅不以三隅反，则不复也。”子食于有丧者之侧，未尝饱也。子于是日哭，则不歌。子谓颜渊曰：“用之则行，舍之则藏，惟我与尔有是夫！”子路曰：“子行三军，则谁与？”子曰：“暴虎冯河，死而无悔者，吾不与也。必也临事而惧，好谋而成者也。”子曰：“富而可求也，虽执鞭之士，吾亦为之。如不可求，从吾所好。”子之所慎：斋，战，疾。子在齐闻《韶》，三月不知肉味，曰：“不图为乐之至於斯也。”冉有曰：“夫子为卫君乎？”子贡曰：“诺，吾将问之。”入，曰：“伯夷、叔齐何人也？”曰：“古之贤人也。”曰：“怨乎？”曰：“求仁而得仁，又何怨？”出，曰：“夫子不为也。”子曰：“饭疏食饮水，曲肱而枕之，乐亦在其中矣。不义而富且贵，于我如浮云。”子曰：“加我数年，五十以学《易》，可以无大过矣。”子所雅言，《诗》、《书》、执礼，皆雅言也。叶公问孔子于子路，子路不对。子曰：“女奚不曰：其为人也，发愤忘食，乐以忘忧，不知老之将至云尔。”子曰：“我非生而知之者，好古，敏以求之者也。”子不语怪、力、乱、神。子曰：“三人行，必有我师焉。择其善者而从之，其不善者而改之。”子曰：“天生德于予，桓魋其如予何？”子曰：“二三子以我为隐乎？吾无隐乎尔！吾无行而不与二三子者，是丘也。”子以四教：文，行，忠，信。子曰：“圣人，吾不得而见之矣；得见君子者斯可矣。”子曰：“善人，吾不得而见之矣，得见有恒者斯可矣。亡而为有，虚而为盈，约而为泰，难乎有恒矣。”子钓而不纲，弋不射宿。子曰：“盖有不知而作之者，我无是也。多闻，择其善者而从之；多见而识之，知之次也。”互乡难与言，童子见，门人惑。子曰：“与其进也，不与其退也，唯何甚？人洁己以进，与其洁也，不保其往也。”子曰：“仁远乎哉？我欲仁，斯仁至矣。”陈司败问：“昭公知礼乎？”孔子曰：“知礼。”孔子退，揖巫马期而进之，曰：“吾闻君子不党，君子亦党乎？君取于吴，为同姓，谓之吴孟子。君而知礼，孰不知礼？”巫马期以告，子曰：“丘也幸，苟有过，人必知之。”子与人歌而善，必使反之，而后和之。子曰：“文，莫吾犹人也。躬行君子，则吾未之有得。”子曰：“若圣与仁，则吾岂敢？抑为之不厌，诲人不倦，则可谓云尔已矣。”公西华曰：“正唯弟子不能学也。”子疾病，子路请祷。子曰：“有诸？”子路对曰：“有之。《诔》曰：‘祷尔于上下神祇。’”子曰：“丘之祷久矣。”子曰：“奢则不孙，俭则固。与其不孙也，宁固。”子曰：“君子坦荡荡，小人长戚戚。”子温而厉，威而不猛，恭而安。"
                },
                {
                    name: "论语·泰伯篇",
                    content: "子曰：“泰伯，其可谓至德也已矣。三以天下让，民无得而称焉。”子曰：“恭而无礼则劳；慎而无礼则葸；勇而无礼则乱；直而无礼则绞。君子笃于亲，则民兴于仁；故旧不遗，则民不偷。”曾子有疾，召门弟子曰：“启予足，启予手。《诗》云：‘战战兢兢，如临深渊，如履薄冰。’而今而后，吾知免夫，小子！”曾子有疾，孟敬子问之。曾子言曰：“鸟之将死，其鸣也哀；人之将死，其言也善。君子所贵乎道者三：动容貌，斯远暴慢矣；正颜色，斯近信矣；出辞气，斯远鄙倍矣。笾豆之事，则有司存。”曾子曰：“以能问于不能；以多问于寡；有若无，实若虚，犯而不校。昔者吾友尝从事于斯矣。”曾子曰：“可以托六尺之孤，可以寄百里之命，临大节而不可夺也。君子人与？君子人也。”曾子曰：“士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？”子曰：“兴于《诗》，立于礼，成于乐。”子曰：“民可，使由之；不可，使知之。”子曰：“好勇疾贫，乱也。人而不仁，疾之已甚，乱也。”子曰：“如有周公之才之美，使骄且吝，其余不足观也已。”子曰：“三年学，不至于谷，不易得也。”子曰：“笃信好学，守死善道。危邦不入，乱邦不居。天下有道则见，无道则隐。邦有道，贫且贱焉，耻也；邦无道，富且贵焉，耻也。”子曰：“不在其位，不谋其政。”子曰：“师挚之始，《关雎》之乱，洋洋乎盈耳哉！”子曰：“狂而不直，侗而不愿，悾悾而不信，吾不知之矣。”子曰：“学如不及，犹恐失之。”子曰：“巍巍乎！舜、禹之有天下也而不与焉。”子曰：“大哉尧之为君也！巍巍乎，唯天为大，唯尧则之。荡荡乎，民无能名焉。巍巍乎其有成功也，焕乎其有文章！”舜有臣五人而天下治。武王曰：“予有乱臣十人。”孔子曰：“才难，不其然乎？唐虞之际，于斯为盛；有妇人焉，九人而已。三分天下有其二，以服事殷。周之德，其可谓至德也已矣。”子曰：“禹，吾无间然矣。菲饮食而致孝乎鬼神，恶衣服而致美乎黼冕，卑宫室而尽力乎沟洫。禹，吾无间然矣。”"
                },
                {
                    name: "论语·子罕篇",
                    content: "子罕言利，与命与仁。达巷党人曰：“大哉孔子！博学而无所成名。”子闻之，谓门弟子曰：“吾何执？执御乎，执射乎？吾执御矣。”子曰：“麻冕，礼也；今也纯，俭，吾从众。拜下，礼也；今拜乎上，泰也；虽违众，吾从下。”子绝四：毋意、毋必、毋固、毋我。子畏于匡，曰：“文王既没，文不在兹乎？天之将丧斯文也，后死者不得与于斯文也；天之未丧斯文也，匡人其如予何？”太宰问于子贡曰：“夫子圣者与，何其多能也？”子贡曰：“固天纵之将圣，又多能也。”子闻之，曰：“太宰知我乎？吾少也贱，故多能鄙事。君子多乎哉？不多也。”牢曰：“子云：‘吾不试，故艺。’”子曰：“吾有知乎哉？无知也。有鄙夫问于我，空空如也。我叩其两端而竭焉。”子曰：“凤鸟不至，河不出图，吾已矣夫！”子见齐衰者、冕衣裳者与瞽者，见之，虽少，必作，过之必趋。颜渊喟然叹曰：“仰之弥高，钻之弥坚。瞻之在前，忽焉在后。夫子循循然善诱人，博我以文，约我以礼，欲罢不能。既竭吾才，如有所立卓尔，虽欲从之，末由也已。”子疾病，子路使门人为臣。病间，曰：“久矣哉，由之行诈也！无臣而为有臣，吾谁欺？欺天乎？且予与其死于臣之手也，无宁死于二三子之手乎！且予纵不得大葬，予死于道路乎？”子贡曰：“有美玉于斯，韫椟而藏诸？求善贾而沽诸？”子曰：“沽之哉，沽之哉！我待贾者也。”子欲居九夷。或曰：“陋，如之何？”子曰：“君子居之，何陋之有！”子曰：“吾自卫反鲁，然后乐正，《雅》《颂》各得其所。”子曰：“出则事公卿，入则事父兄，丧事不敢不勉，不为酒困，何有于我哉？”子在川上曰：“逝者如斯夫！不舍昼夜。”子曰：“吾未见好德如好色者也。”子曰：“譬如为山，未成一篑，止，吾止也；譬如平地，虽覆一篑，进，吾往也。”子曰：“语之而不惰者，其回也与！”子谓颜渊，曰：“惜乎！吾见其进也，未见其止也。”子曰：“苗而不秀者有矣夫，秀而不实者有矣夫。”子曰：“后生可畏，焉知来者之不如今也？四十、五十而无闻焉，斯亦不足畏也已。”子曰：“法语之言，能无从乎？改之为贵。巽与之言，能无说乎？绎之为贵。说而不绎，从而不改，吾末如之何也已矣。”子曰：“主忠信。毋友不如己者，过，则勿惮改。”子曰：“三军可夺帅也，匹夫不可夺志也。”子曰：“衣敝缊袍，与衣狐貉者立而不耻者，其由也与！‘不忮不求，何用不臧？’”子路终身诵之，子曰：“是道也，何足以臧？”子曰：“岁寒，然后知松柏之后凋也。”子曰：“知者不惑，仁者不忧，勇者不惧。”子曰：“可与共学，未可与适道；可与适道，未可与立；可与立，未可与权。”“唐棣之华，偏其反而。岂不尔思？室是远尔。”子曰：“未之思也，夫何远之有。”"},
                {
                    name: "论语·乡党篇",
                    content: "孔子于乡党，恂恂如也，似不能言者；其在宗庙朝庭，便便言，唯谨尔。朝，与下大夫言，侃侃如也；与上大夫言，訚訚如也。君在，踧踖如也，与与如也。君召使摈，色勃如也，足躩如也。揖所与立，左右手，衣前后襜如也。趋进，翼如也。宾退，必复命曰：“宾不顾矣。”入公门，鞠躬如也，如不容。立不中门，行不履阈。过位，色勃如也，足躩如也，其言似不足者。摄齐升堂，鞠躬如也，屏气似不息者。出，降一等，逞颜色，怡怡如也；没阶，趋进，翼如也；复其位，踧踖如也。执圭，鞠躬如也，如不胜。上如揖，下如授。勃如战色，足蹜蹜如有循。享礼，有容色。私觌，愉愉如也。君子不以绀緅饰，红紫不以为亵服。当暑袗絺绤，必表而出之。缁衣羔裘，素衣麑裘，黄衣狐裘。亵裘长，短右袂。必有寝衣，长一身有半。狐貉之厚以居。去丧，无所不佩。非帷裳，必杀之。羔裘玄冠不以吊。吉月，必朝服而朝。齐，必有明衣，布。齐必变食，居必迁坐。食不厌精，脍不厌细。食饐而餲，鱼馁而肉败，不食；色恶，不食；臭恶，不食；失饪，不食；不时，不食；割不正，不食；不得其酱，不食。肉虽多，不使胜食气。唯酒无量，不及乱。沽酒市脯，不食。不撤姜食，不多食。祭于公，不宿肉。祭肉不出三日，出三日不食之矣。食不语，寝不言。虽疏食菜羹，瓜祭，必齐如也。席不正，不坐。乡人饮酒，杖者出，斯出矣。乡人傩，朝服而立于阼阶。问人于他邦，再拜而送之。康子馈药，拜而受之。曰：“丘未达，不敢尝。”厩焚，子退朝，曰：“伤人乎？”不问马。君赐食，必正席先尝之；君赐腥，必熟而荐之；君赐生，必畜之。侍食于君，君祭，先饭。疾，君视之，东首，加朝服，拖绅。君命召，不俟驾行矣。入太庙，每事问。朋友死，无所归，曰：“于我殡。”朋友之馈，虽车马，非祭肉，不拜。寝不尸，居不容。见齐衰者，虽狎，必变。见冕者与瞽者，虽亵，必以貌。凶服者式之，式负版者。有盛馔，必变色而作。迅雷风烈，必变。升车，必正立，执绥。车中不内顾，不疾言，不亲指。色斯举矣，翔而后集。曰：“山梁雌雉，时哉时哉！”子路共之，三嗅而作。"
                },
                {
                    name: "论语·先进篇",
                    content: "子曰：“先进于礼乐，野人也；后进于礼乐，君子也。如用之，则吾从先进。”子曰：“从我于陈、蔡者，皆不及门也。”德行：颜渊，闵子骞，冉伯牛，仲弓。言语：宰我，子贡。政事：冉有，季路。文学：子游，子夏。子曰：“回也非助我者也，于吾言无所不说。”子曰：“孝哉闵子骞！人不间于其父母昆弟之言。”南容三复白圭，孔子以其兄之子妻之。季康子问：“弟子孰为好学？”孔子对曰：“有颜回者好学，不幸短命死矣，今也则亡。”颜渊死，颜路请子之车以为之椁。子曰：“才不才，亦各言其子也。鲤也死，有棺而无椁，吾不徒行以为之椁。以吾从大夫之后，不可徒行也。”颜渊死。子曰：“噫！天丧予！天丧予！”颜渊死，子哭之恸，从者曰：“子恸矣！”曰：“有恸乎？非夫人之为恸而谁为？”颜渊死，门人欲厚葬之，子曰：“不可。”门人厚葬之，子曰：“回也视予犹父也，予不得视犹子也。非我也，夫二三子也！”季路问事鬼神，子曰：“未能事人，焉能事鬼？”曰：“敢问死。”曰：“未知生，焉知死？”闵子侍侧，訚訚如也；子路，行行如也；冉有、子贡，侃侃如也。子乐。“若由也，不得其死然。”鲁人为长府，闵子骞曰：“仍旧贯如之何？何必改作？”子曰：“夫人不言，言必有中。”子曰：“由之瑟奚为于丘之门？”门人不敬子路，子曰：“由也升堂矣，未入于室也。”子贡问：“师与商也孰贤？”子曰：“师也过，商也不及。”曰：“然则师愈与？”子曰：“过犹不及。”季氏富于周公，而求也为之聚敛而附益之。子曰：“非吾徒也，小子鸣鼓而攻之可也。”柴也愚，参也鲁，师也辟，由也喭。子曰：“回也其庶乎，屡空。赐不受命而货殖焉，亿则屡中。”子张问善人之道，子曰：“不践迹，亦不入于室。”子曰：“论笃是与，君子者乎，色庄者乎？”子路问：“闻斯行诸？”子曰：“有父兄在，如之何其闻斯行之？”冉有问：“闻斯行诸？”子曰：“闻斯行之。公西华曰：“由也问闻斯行诸，子曰‘有父兄在’；求也问闻斯行诸，子曰‘闻斯行之’赤也惑，敢问。”子曰：“求也退，故进之；由也兼人，故退之。”子畏于匡，颜渊后。子曰：“吾以女为死矣！”曰：“子在，回何敢死！”季子然问：“仲由、冉求可谓大臣与？”子曰：“吾以子为异之问，曾由与求之问。所谓大臣者，以道事君，不可则止。今由与求也，可谓具臣矣。”曰：“然则从之者与？”子曰：“弑父与君，亦不从也。”子路使子羔为费宰，子曰：“贼夫人之子。”子路曰：“有民人焉，有社稷焉，何必读书然后为学。”子曰：“是故恶夫佞者。”子路、曾皙、冉有、公西华侍坐，子曰：“以吾一日长乎尔，毋吾以也。居则曰‘不吾知也’如或知尔，则何以哉？”子路率尔而对曰：“千乘之国，摄乎大国之间，加之以师旅，因之以饥馑，由也为之，比及三年，可使有勇，且知方也。”夫子哂之。“求，尔何如？”对曰：“方六七十，如五六十，求也为之，比及三年，可使足民。如其礼乐，以俟君子。”“赤！尔何如？”对曰：“非曰能之，愿学焉。宗庙之事，如会同，端章甫，愿为小相焉。”“点，尔何如？”鼓瑟希，铿尔，舍瑟而作，对曰：“异乎三子者之撰。”子曰：“何伤乎？亦各言其志也。”曰：“暮春者，春服既成，冠者五六人，童子六七人，浴乎沂，风乎舞雩，咏而归。”夫子喟然叹曰：“吾与点也！”三子者出，曾皙后。曾皙曰：“夫三子者之言何如？”子曰：“亦各言其志也已矣。”曰：“夫子何哂由也？”曰：“为国以礼，其言不让，是故哂之。”“唯求则非邦也与？”“安见方六七十、如五六十而非邦也者？”“唯赤则非邦也与？”“宗庙会同，非诸侯而何？赤也为之小，孰能为之大？”"
                },
                {
                    name: "论语·颜渊篇",
                    content: "颜渊问仁，子曰：“克己复礼为仁。一日克己复礼，天下归仁焉。为仁由己，而由人乎哉？”颜渊曰：“请问其目？”子曰：“非礼勿视，非礼勿听，非礼勿言，非礼勿动。”颜渊曰：“回虽不敏，请事斯语矣。”仲弓问仁，子曰：“出门如见大宾，使民如承大祭。己所不欲，勿施于人。在邦无怨，在家无怨。”仲弓曰：“雍虽不敏，请事斯语矣。”司马牛问仁，子曰：“仁者，其言也讱。”曰：“其言也讱，斯谓之仁已乎？”子曰：“为之难，言之得无讱乎？”司马牛问君子，子曰：“君子不忧不惧。”曰：“不忧不惧，斯谓之君子已乎？”子曰：“内省不疚，夫何忧何惧？”司马牛忧曰：“人皆有兄弟，我独亡。”子夏曰：“商闻之矣：死生有命，富贵在天。君子敬而无失，与人恭而有礼，四海之内皆兄弟也。君子何患乎无兄弟也？”子张问明，子曰：“浸润之谮，肤受之愬，不行焉，可谓明也已矣；浸润之谮、肤受之愬不行焉，可谓远也已矣。”子贡问政，子曰：“足食，足兵，民信之矣。”子贡曰：“必不得已而去，于斯三者何先？”曰：“去兵。”子贡曰：“必不得已而去，于斯二者何先？”曰：“去食。自古皆有死，民无信不立。”棘子成曰：“君子质而已矣，何以文为？”子贡曰：“惜乎，夫子之说君子也！驷不及舌。文犹质也，质犹文也。虎豹之鞟犹犬羊之鞟。”哀公问于有若曰：“年饥，用不足，如之何？”有若对曰：“盍彻乎？”曰：“二，吾犹不足，如之何其彻也？”对曰：“百姓足，君孰与不足？百姓不足，君孰与足？”子张问崇德辨惑，子曰：“主忠信，徙义，崇德也。爱之欲其生，恶之欲其死；既欲其生又欲其死，是惑也。‘诚不以富，亦只以异。’”齐景公问政于孔子，孔子对曰：“君君，臣臣，父父，子子。”公曰：“善哉！信如君不君、臣不臣、父不父、子不子，虽有粟，吾得而食诸？”子曰：“片言可以折狱者，其由也与？”子路无宿诺。子曰：“听讼，吾犹人也。必也使无讼乎。”子张问政，子曰：“居之无倦，行之以忠。”子曰：“博学于文，约之以礼，亦可以弗畔矣夫。”子曰：“君子成人之美，不成人之恶；小人反是。”季康子问政于孔子，孔子对曰：“政者，正也。子帅以正，孰敢不正？”季康子患盗，问于孔子。孔子对曰：“苟子之不欲，虽赏之不窃。”季康子问政于孔子曰：“如杀无道以就有道，何如？”孔子对曰：“子为政，焉用杀？子欲善而民善矣。君子之德风，小人之德草，草上之风必偃。”子张问：“士何如斯可谓之达矣？”子曰：“何哉尔所谓达者？”子张对曰：“在邦必闻，在家必闻。”子曰：“是闻也，非达也。夫达也者，质直而好义，察言而观色，虑以下人。在邦必达，在家必达。夫闻也者，色取仁而行违，居之不疑。在邦必闻，在家必闻。”樊迟从游于舞雩之下，曰：“敢问崇德、修慝、辨惑。”子曰：“善哉问！先事后得，非崇德与？攻其恶，无攻人之恶，非修慝与？一朝之忿，忘其身，以及其亲，非惑与？”樊迟问仁，子曰：“爱人。”问知，子曰：“知人。”樊迟未达，子曰：“举直错诸枉，能使枉者直。”樊迟退，见子夏，曰：“乡也吾见于夫子而问知，子曰：‘举直错诸枉，能使枉者直’，何谓也？”子夏曰：“富哉言乎！舜有天下，选于众，举皋陶，不仁者远矣。汤有天下，选于众，举伊尹，不仁者远矣。”子贡问友，子曰：“忠告而善道之，不可则止，毋自辱焉。”曾子曰：“君子以文会友，以友辅仁。”"
                },
                {
                    name: "论语·子路篇",
                    content: "子路问政，子曰：“先之，劳之。”请益，曰：“无倦。”仲弓为季氏宰，问政，子曰：“先有司，赦小过，举贤才。”曰：“焉知贤才而举之？”曰：“举尔所知。尔所不知，人其舍诸？”子路曰：“卫君待子而为政，子将奚先？”子曰：“必也正名乎！”子路曰：“有是哉，子之迂也！奚其正？”子曰：“野哉由也！君子于其所不知，盖阙如也。名不正，则言不顺；言不顺，则事不成；事不成，则礼乐不兴；礼乐不兴，则刑罚不中；刑罚不中，则民无所措手足。故君子名之必可言也，言之必可行也。君子于其言，无所苟而已矣。”樊迟请学稼，子曰：“吾不如老农。”请学为圃，曰：“吾不如老圃。”樊迟出，子曰：“小人哉樊须也！上好礼，则民莫敢不敬；上好义，则民莫敢不服；上好信，则民莫敢不用情。夫如是，则四方之民襁负其子而至矣，焉用稼？”子曰：“诵《诗》三百，授之以政，不达；使于四方，不能专对；虽多，亦奚以为？”子曰：“其身正，不令而行；其身不正，虽令不从。”子曰：“鲁卫之政，兄弟也。”子谓卫公子荆，“善居室。始有，曰：‘苟合矣。’少有，曰：‘苟完矣。’富有，曰：‘苟美矣。’”子适卫，冉有仆，子曰：“庶矣哉！”冉有曰：“既庶矣，又何加焉？”曰：“富之。”曰：“既富矣，又何加焉？”曰：“教之。”子曰：“苟有用我者，期月而已可也，三年有成。”子曰：“‘善人为邦百年，亦可以胜残去杀矣。’诚哉是言也！”子曰：“如有王者，必世而后仁。”子曰：“苟正其身矣，于从政乎何有？不能正其身，如正人何？”冉子退朝，子曰：“何晏也？”对曰：“有政。”子曰：“其事也。如有政，虽不吾以，吾其与闻之。”定公问：“一言而可以兴邦，有诸？”孔子对曰：“言不可以若是，其几也。人之言曰：‘为君难，为臣不易。’如知为君之难也，不几乎一言而兴邦乎？”曰：“一言而丧邦，有诸？”孔子对曰：“言不可以若是其几也。人之言曰：‘予无乐乎为君，唯其言而莫予违也。’如其善而莫之违也，不亦善乎？如不善而莫之违也，不几乎一言而丧邦乎？”叶公问政，子曰：“近者说，远者来。”子夏为莒父宰，问政，子曰：“无欲速，无见小利。欲速则不达，见小利则大事不成。”叶公语孔子曰：“吾党有直躬者，其父攘羊，而子证之。”孔子曰：“吾党之直者异于是。父为子隐，子为父隐，直在其中矣。”樊迟问仁，子曰：“居处恭，执事敬，与人忠。虽之夷狄，不可弃也。”子贡问曰：“何如斯可谓之士矣？”子曰：“行己有耻，使于四方不辱君命，可谓士矣。”曰：“敢问其次。”曰：“宗族称孝焉，乡党称弟焉。”曰：“敢问其次。”曰：“言必信，行必果，硁硁然小人哉！抑亦可以为次矣。”曰：“今之从政者何如？”子曰：“噫！斗筲之人，何足算也！”子曰：“不得中行而与之，必也狂狷乎！狂者进取，狷者有所不为也。”子曰：“南人有言曰：‘人而无恒，不可以作巫医。’善夫！”“不恒其德，或承之羞。”子曰：“不占而已矣。”子曰：“君子和而不同，小人同而不和。”子贡问曰：“乡人皆好之，何如？”子曰：“未可也。”“乡人皆恶之，何如？”子曰：“未可也。不如乡人之善者好之，其不善者恶之。”子曰：“君子易事而难说也，说之不以道不说也，及其使人也器之；小人难事而易说也，说之虽不以道说也，及其使人也求备焉。”子曰：“君子泰而不骄，小人骄而不泰。”子曰：“刚、毅、木、讷近仁。”子路问曰：“何如斯可谓之士矣？”子曰：“切切偲偲，怡怡如也，可谓士矣。朋友切切偲偲，兄弟怡怡。”子曰：“善人教民七年，亦可以即戎矣。”子曰：“以不教民战，是谓弃之。”"
                },
                {
                    name: "论语·宪问篇",
                    content: "宪问耻，子曰：“邦有道，谷；邦无道，谷，耻也。”“克、伐、怨、欲不行焉，可以为仁矣？”子曰：“可以为难矣，仁则吾不知也。”子曰：“士而怀居，不足以为士矣。”子曰：“邦有道，危言危行；邦无道，危行言孙。”子曰：“有德者必有言，有言者不必有德。仁者必有勇，勇者不必有仁。”南宫适问于孔子曰：“羿善射，奡荡舟，俱不得其死然；禹、稷躬稼而有天下。”夫子不答。南宫适出，子曰：“君子哉若人！尚德哉若人！”子曰：“君子而不仁者有矣夫，未有小人而仁者也。”子曰：“爱之，能勿劳乎？忠焉，能勿诲乎？”子曰：“为命，裨谌草创之，世叔讨论之，行人子羽修饰之，东里子产润色之。”或问子产，子曰：“惠人也。”问子西，曰：“彼哉，彼哉！”问管仲，曰：“人也。夺伯氏骈邑三百，饭疏食，没齿无怨言。”子曰：“贫而无怨难，富而无骄易。”子曰：“孟公绰为赵、魏老则优，不可以为滕、薛大夫。”子路问成人，子曰：“若臧武仲之知、公绰之不欲、卞庄子之勇、冉求之艺，文之以礼乐，亦可以为成人矣。”曰：“今之成人者何必然？见利思义，见危授命，久要不忘平生之言，亦可以为成人矣。”子问公叔文子于公明贾曰：“信乎，夫子不言，不笑，不取乎？”公明贾对曰：“以告者过也。夫子时然后言，人不厌其言；乐然后笑，人不厌其笑；义然后取，人不厌其取。”子曰：“其然？岂其然乎？”子曰：“臧武仲以防求为后于鲁，虽曰不要君，吾不信也。”子曰：“晋文公谲而不正，齐桓公正而不谲。”子路曰：“桓公杀公子纠，召忽死之，管仲不死，曰未仁乎？”子曰：“桓公九合诸侯不以兵车，管仲之力也。如其仁，如其仁！”子贡曰：“管仲非仁者与？桓公杀公子纠，不能死，又相之。”子曰：“管仲相桓公霸诸侯，一匡天下，民到于今受其赐。微管仲，吾其被发左衽矣。岂若匹夫匹妇之为谅也，自经于沟渎而莫之知也。”公叔文子之臣大夫僎与文子同升诸公，子闻之,曰：“可以为‘文’矣。”子言卫灵公之无道也，康子曰：“夫如是，奚而不丧？”孔子曰：“仲叔圉治宾客，祝鮀治宗庙，王孙贾治军旅，夫如是，奚其丧？”子曰：“其言之不怍，则为之也难。”陈成子弑简公，孔子沐浴而朝，告于哀公曰：“陈恒弑其君，请讨之。”公曰：“告夫三子。”,孔子曰：“以吾从大夫之后，不敢不告也，君曰‘告夫三子’者！”之三子告，不可。孔子曰：“以吾从大夫之后，不敢不告也。”子路问事君，子曰：“勿欺也，而犯之。”子曰：“君子上达，小人下达。”子曰：“古之学者为己，今之学者为人。”蘧伯玉使人于孔子，孔子与之坐而问焉，曰：“夫子何为？”对曰：“夫子欲寡其过而未能也。”使者出，子曰：“使乎！使乎！”子曰：“不在其位，不谋其政。”曾子曰：“君子思不出其位。”子曰：“君子耻其言而过其行。”子曰：“君子道者三，我无能焉：仁者不忧，知者不惑，勇者不惧。”子贡曰：“夫子自道也。”子贡方人，子曰：“赐也贤乎哉？夫我则不暇。”子曰：“不患人之不己知，患其不能也。”子曰：“不逆诈，不亿不信，抑亦先觉者，是贤乎！”微生亩谓孔子曰：“丘何为是栖栖者与？无乃为佞乎？”孔子曰：“非敢为佞也，疾固也。”子曰：“骥不称其力，称其德也。”或曰：“以德报怨，何如？”子曰：“何以报德？以直报怨，以德报德。”子曰：“莫我知也夫！”子贡曰：“何为其莫知子也？”子曰：“不怨天，不尤人，下学而上达。知我者其天乎！”公伯寮愬子路于季孙。子服景伯以告，曰：“夫子固有惑志于公伯寮，吾力犹能肆诸市朝。”子曰：“道之将行也与，命也；道之将废也与，命也。公伯寮其如命何？”子曰：“贤者辟世，其次辟地，其次辟色，其次辟言。”子曰：“作者七人矣。”子路宿于石门，晨门曰：“奚自？”子路曰：“自孔氏。”曰：“是知其不可而为之者与？”子击磬于卫，有荷蒉而过孔氏之门者，曰：“有心哉，击磬乎！”既而曰：“鄙哉，硁硁乎！莫己知也，斯已而已矣。深则厉，浅则揭。”子曰：“果哉！末之难矣。”子张曰：“《书》云，‘高宗谅阴，三年不言。’何谓也？”子曰：“何必高宗，古之人皆然。君薨，百官总己以听于冢宰三年。”子曰：“上好礼，则民易使也。”子路问君子，子曰：“修己以敬。”曰：“如斯而已乎？”曰：“修己以安人。”曰：“如斯而已乎？”曰：“修己以安百姓。修己以安百姓，尧、舜其犹病诸！”原壤夷俟，子曰：“幼而不孙弟，长而无述焉，老而不死，是为贼！”以杖叩其胫。阙党童子将命，或问之曰：“益者与？”子曰：“吾见其居于位也，见其与先生并行也。非求益者也，欲速成者也。”"
                },
                {
                    name: "论语·卫灵公篇",
                    content: "卫灵公问陈于孔子，孔子对曰：“俎豆之事，则尝闻之矣；军旅之事，未之学也。”明日遂行。在陈绝粮，从者病莫能兴。子路愠见曰：“君子亦有穷乎？”子曰：“君子固穷，小人穷斯滥矣。”子曰：“赐也，女以予为多学而识之者与？”对曰：“然，非与？”曰：“非也，予一以贯之。”子曰：“由，知德者鲜矣。”子曰：“无为而治者其舜也与！夫何为哉？恭己正南面而已矣。”子张问行，子曰：“言忠信，行笃敬，虽蛮貊之邦行矣；言不忠信，行不笃敬，虽州里行乎哉？立则见其参于前也；在舆则见其倚于衡也，夫然后行。”子张书诸绅。子曰：“直哉史鱼！邦有道如矢，邦无道如矢。君子哉蘧伯玉！邦有道则仕，邦无道则可卷而怀之。”子曰：“可与言而不与之言，失人；不可与言而与之言，失言。知者不失人亦不失言。”子曰：“志士仁人无求生以害仁，有杀身以成仁。”子贡问为仁，子曰：“工欲善其事，必先利其器。居是邦也，事其大夫之贤者，友其士之仁者。”颜渊问为邦，子曰：“行夏之时，乘殷之辂，服周之冕，乐则《韶》《舞》；放郑声，远佞人。郑声淫，佞人殆。”子曰：“人无远虑，必有近忧。”子曰：“已矣乎！吾未见好德如好色者也。”子曰：“臧文仲其窃位者与！知柳下惠之贤而不与立也。”子曰：“躬自厚而薄责于人，则远怨矣。”子曰：“不曰‘如之何、如之何’者，吾末如之何也已矣。”子曰：“群居终日，言不及义，好行小慧，难矣哉！”子曰：“君子义以为质，礼以行之，孙以出之，信以成之。君子哉！”子曰：“君子病无能焉，不病人之不己知也。”子曰：“君子疾没世而名不称焉。”子曰：“君子求诸己，小人求诸人。”子曰：“君子矜而不争，群而不党。”子曰：“君子不以言举人，不以人废言。”子贡问曰：“有一言而可以终身行之者乎？”子曰：“其恕乎！己所不欲，勿施于人。”子曰：“吾之于人也，谁毁谁誉？如有所誉者，其有所试矣。斯民也，三代之所以直道而行也。”子曰：“吾犹及史之阙文也，有马者借人乘之，今亡矣夫！”子曰：“巧言乱德，小不忍，则乱大谋。”子曰：“众恶之，必察焉；众好之，必察焉。”子曰：“人能弘道，非道弘人。”子曰：“过而不改，是谓过矣。”子曰：“吾尝终日不食、终夜不寝以思，无益，不如学也。”子曰：“君子谋道不谋食。耕也馁在其中矣，学也禄在其中矣。君子忧道不忧贫。”子曰：“知及之，仁不能守之，虽得之，必失之；知及之，仁能守之，不庄以莅之，则民不敬；知及之，仁能守之，庄以莅之，动之不以礼，未善也。”子曰：“君子不可小知而可大受也，小人不可大受而可小知也。”子曰：“民之于仁也，甚于水火。水火，吾见蹈而死者矣，未见蹈仁而死者也。”子曰：“当仁不让于师。”子曰：“君子贞而不谅。”子曰：“事君，敬其事而后其食。”子曰：“有教无类。”子曰：“道不同，不相为谋。”子曰：“辞达而已矣。”师冕见，及阶，子曰：“阶也。”及席，子曰：“席也。”皆坐，子告之曰：“某在斯，某在斯。”师冕出。子张问曰：“与师言之道与？”子曰：“然，固相师之道也。”"
                },
                {
                    name: "论语·季氏篇",
                    content: "季氏将伐颛臾，冉有、季路见于孔子，曰：“季氏将有事于颛臾。”孔子曰：“求，无乃尔是过与？夫颛臾，昔者先王以为东蒙主，且在邦域之中矣，是社稷之臣也。何以伐为？”冉有曰：“夫子欲之，吾二臣者皆不欲也。”孔子曰：“求，周任有言曰：‘陈力就列，不能者止。’危而不持，颠而不扶，则将焉用彼相矣？且尔言过矣，虎兕出于柙，龟玉毁于椟中，是谁之过与？”冉有曰：“今夫颛臾固而近于费，今不取，后世必为子孙忧。”孔子曰：“求，君子疾夫舍曰欲之而必为之辞。丘也闻，有国有家者，不患寡而患不均，不患贫而患不安。盖均无贫，和无寡，安无倾。夫如是，故远人不服则修文德以来之，既来之，则安之。今由与求也相夫子，远人不服而不能来也，邦分崩离析而不能守也，而谋动干戈于邦内。吾恐季孙之忧不在颛臾，而在萧墙之内也。”孔子曰：“天下有道，则礼乐征伐自天子出；天下无道，则礼乐征伐自诸侯出。自诸侯出，盖十世希不失矣；自大夫出，五世希不失矣；陪臣执国命，三世希不失矣。天下有道，则政不在大夫；天下有道，则庶人不议。”孔子曰：“禄之去公室五世矣，政逮于大夫四世矣，故夫三桓之子孙微矣。”孔子曰：“益者三友，损者三友。友直、友谅、友多闻，益矣；友便辟、友善柔、友便佞，损矣。”孔子曰：“益者三乐，损者三乐。乐节礼乐、乐道人之善、乐多贤友，益矣；乐骄乐、乐佚游、乐宴乐，损矣。”孔子曰：“侍于君子有三愆：言未及之而言谓之躁，言及之而不言谓之隐，未见颜色而言谓之瞽。”孔子曰：“君子有三戒：少之时，血气未定，戒之在色；及其壮也，血气方刚，戒之在斗；及其老也，血气既衰，戒之在得。”孔子曰：“君子有三畏：畏天命，畏大人，畏圣人之言。小人不知天命而不畏也，狎大人，侮圣人之言。”孔子曰：“生而知之者上也，学而知之者次也；困而学之又其次也。困而不学，民斯为下矣。”孔子曰：“君子有九思：视思明，听思聪，色思温，貌思恭，言思忠，事思敬，疑思问，忿思难，见得思义。”孔子曰：“见善如不及，见不善如探汤；吾见其人矣。吾闻其语矣。隐居以求其志，行义以达其道；吾闻其语矣，未见其人也。”齐景公有马千驷，死之日，民无德而称焉；伯夷、叔齐饿于首阳之下，民到于今称之。其斯之谓与？”陈亢问于伯鱼曰：“子亦有异闻乎？”对曰：“未也。尝独立，鲤趋而过庭，曰：‘学《诗》乎？’对曰：‘未也。’‘不学《诗》，无以言。’鲤退而学《诗》。他日，又独立，鲤趋而过庭，曰：‘学《礼》乎？’对曰：‘未也。’‘不学《礼》，无以立。’鲤退而学《礼》。闻斯二者。”陈亢退而喜曰：“问一得三，闻《诗》，闻《礼》，又闻君子之远其子也。”邦君之妻，君称之曰夫人，夫人自称曰小童；邦人称之曰君夫人，称诸异邦曰寡小君；异邦人称之亦曰君夫人。"
                },
                {
                    name: "论语·子张篇",
                    content: "子张曰：“士见危致命，见得思义，祭思敬，丧思哀，其可已矣。”子张曰：“执德不弘，信道不笃，焉能为有？焉能为亡？”子夏之门人问交于子张，子张曰：“子夏云何？”对曰：“子夏曰：‘可者与之，其不可者拒之。’”子张曰：“异乎吾所闻。君子尊贤而容众，嘉善而矜不能。我之大贤与，于人何所不容？我之不贤与，人将拒我，如之何其拒人也？”子夏曰：“虽小道必有可观者焉，致远恐泥，是以君子不为也。”子夏曰：“日知其所亡，月无忘其所能，可谓好学也已矣。”子夏曰：“博学而笃志，切问而近思，仁在其中矣。”子夏曰：“百工居肆以成其事，君子学以致其道。”子夏曰：“小人之过也必文。”子夏曰：“君子有三变：望之俨然，即之也温，听其言也厉。”子夏曰：“君子信而后劳其民，未信，则以为厉己也；信而后谏，未信，则以为谤己也。”子夏曰：“大德不逾闲，小德出入可也。”子游曰：“子夏之门人小子，当洒扫应对进退则可矣。抑末也，本之则无，如之何？”子夏闻之，曰：“噫，言游过矣！君子之道，孰先传焉？孰后倦焉？譬诸草木，区以别矣。君子之道焉可诬也？有始有卒者，其惟圣人乎！”子夏曰：“仕而优则学，学而优则仕。”子游曰：“丧致乎哀而止。”子游曰：“吾友张也为难能也，然而未仁。”曾子曰：“堂堂乎张也，难与并为仁矣。”曾子曰：“吾闻诸夫子，人未有自致者也，必也亲丧乎！”曾子曰：“吾闻诸夫子，孟庄子之孝也，其他可能也；其不改父之臣与父之政，是难能也。”孟氏使阳肤为士师，问于曾子。曾子曰：“上失其道，民散久矣。如得其情，则哀矜而勿喜！”子贡曰：“纣之不善，不如是之甚也。是以君子恶居下流，天下之恶皆归焉。”子贡曰：“君子之过也，如日月之食焉。过也，人皆见之；更也，人皆仰之。”卫公孙朝问于子贡曰：“仲尼焉学？”子贡曰：“文武之道未坠于地，在人。贤者识其大者，不贤者识其小者，莫不有文武之道焉，夫子焉不学？而亦何常师之有？”叔孙武叔语大夫于朝曰：“子贡贤于仲尼。”子服景伯以告子贡，子贡曰：“譬之宫墙，赐之墙也及肩，窥见室家之好；夫子之墙数仞，不得其门而入，不见宗庙之美、百官之富。得其门者或寡矣，夫子之云不亦宜乎！”叔孙武叔毁仲尼，子贡曰：“无以为也，仲尼不可毁也。他人之贤者，丘陵也，犹可逾也；仲尼，日月也，无得而逾焉。人虽欲自绝，其何伤于日月乎？多见其不知量也。”陈子禽谓子贡曰：“子为恭也，仲尼岂贤于子乎？”子贡曰：“君子一言以为知，一言以为不知，言不可不慎也。夫子之不可及也，犹天之不可阶而升也。夫子之得邦家者，所谓立之斯立，道之斯行，绥之斯来，动之斯和。其生也荣，其死也哀，如之何其可及也？”"
                },
                {
                    name:"中庸·第一章",
                    content:"天命之谓性；率性之谓道；修道之谓教。道也者，不可须臾离也；可离，非道也。是故君子戒慎乎其所不睹，恐惧乎其所不闻。莫见乎隐，莫显乎微。故君子慎其独也。喜、怒、哀、乐之未发，谓之中。发而皆中节，谓之和。中也者，天下之大本也。和也者，天下之达道也。致中和，天地位焉，万物育焉。"
                },
                {
                    name:"中庸·第二章",
                    content:"仲尼曰：“君子中庸；小人反中庸。”“君子之中庸也，君子而时中。小人之反中庸也，小人而无忌惮也。”"
                },
                {
                    name:"中庸·第三章",
                    content:"子曰：“中庸其至矣乎！民鲜能久矣。”"
                },
                {
                    name:"中庸·第四章",
                    content:"子曰：“道之不行也，我知之矣：知者过之；愚者不及也。道之不明也，我知之矣：贤者过之；不肖者不及也。”“人莫不饮食也。鲜能知味也。”"
                },
                {
                    name:"中庸·第五章",
                    content:"子曰：“道其不行矣夫。”"
                },
                {
                    name:"孟子·梁惠王章句上·第一节",
                    content:"孟子见梁惠王。王曰：“叟！不远千里而来，亦将有以利吾国乎？”孟子对曰：“王何必曰利？亦有仁义而已矣。王曰：‘何以利吾国？’大夫曰：‘何以利吾家？’士庶人曰：‘何以利吾身？’上下交征利而国危矣。万乘之国，弑其君者，必千乘之家；千乘之国，弑其君者，必百乘之家。万取千焉，千取百焉，不为不多矣。苟为后义而先利，不夺不餍。未有仁而遗其亲者也，未有义而后其君者也。王亦曰仁义而已矣，何必曰利？”"
                },
                {
                    name:"孟子·公孙丑章句上·第一节",
                    content:"公孙丑问曰：“夫子当路于齐，管仲、晏子之功，可复许乎？”孟子曰：“子诚齐人也，知管仲、晏子而已矣。或问乎曾西曰；‘吾子与子路孰贤？’曾西蹙然曰：‘吾先子之所畏也。’曰：‘然则吾子与管仲孰贤？’曾西艴然不悦，曰：‘尔何曾比予于管仲？管仲得君，如彼其专也；行乎国政，如彼其久也；功烈，如彼其卑也。尔何曾比予于是？’曰：“管仲，曾西之所不为也，而子为我愿之乎？曰：“管仲以其君霸，晏子以其君显。管仲、晏子犹不足为与？曰：“以齐王，由反手也。曰：“若是，则弟子之惑滋甚。且以文王之德，百年而后崩，犹未洽于天下；武王、周公继之，然后大行。今言王若易然，则文王不足法与？曰：“文王何可当也？由汤至于武丁，贤圣之君六七作。天下归殷久矣，久则难变也。武丁朝诸侯有天下，犹运之掌也。纣之去武丁未久也，其故家遗俗，流风善政，犹有存者；又有微子、微仲、王子比干、箕子、胶鬲皆贤人也，相与辅相之，故久而后失之也。尺地莫非其有也，一民莫非其臣也，然而文王犹方百里起，是以难也。齐人有言曰：‘虽有智慧，不如乘势；虽有镃基，不如待时。’今时则易然也。夏后、殷、周之盛，地未有过千里者也，而齐有其地矣；鸡鸣狗吠相闻，而达乎四境，而齐有其民矣。地不改辟矣，民不改聚矣，行仁政而王，莫之能御也。且王者之不作，未有疏于此时者也；民之憔悴于虐政，未有甚于此时者也。饥者易为食，渴者易为饮。孔子曰：‘德之流行，速于置邮而传命。’当今之时，万乘之国行仁政，民之悦之，犹解倒悬也。故事半古之人，功必倍之，惟此时为然。”"
                },
                {
                    name:"孟子·滕文公章句上·第一节",
                    content:"滕文公为世子，将之楚，过宋而见孟子。孟子道性善，言必称尧舜。世子自楚反，复见孟子。孟子曰：“世子疑吾言乎？夫道一而已矣。成覸谓齐景公曰：‘彼丈夫也，我丈夫也，吾何畏彼哉？’颜渊曰：‘舜何人也？予何人也？有为者亦若是。’公明仪曰：‘文王我师也，周公岂欺我哉？’今滕，绝长补短，将五十里也，犹可以为善国。书曰：‘若药不瞑眩，厥疾不瘳。’”"
                },
                {
                    name:"孟子·离娄章句上·第一节",
                    content:"孟子曰：“离娄之明，公输子之巧，不以规矩，不能成方圆；师旷之聪，不以六律，不能正五音；尧舜之道，不以仁政，不能平治天下。今有仁心仁闻而民不被其泽，不可法于后世者，不行先王之道也。故曰，徒善不足以为政，徒法不能以自行。诗云：‘不愆不忘，率由旧章。’遵先王之法而过者，未之有也圣人既竭目力焉，继之以规矩准绳，以为方员平直，不可胜用也；既竭耳力焉，继之以六律，正五音，不可胜用也；既竭心思焉，继之以不忍人之政，而仁覆天下矣。故曰，为高必因丘陵，为下必因川泽。为政不因先王之道，可谓智乎？是以惟仁者宜在高位。不仁而在高位，是播其恶于众也上无道揆也，下无法守也。朝不信道，工不信度。君子犯义，小人犯刑，国之所存者幸也。故曰：城郭不完，兵甲不多，非国之灾也；田野不辟，货财不聚，非国之害也。上无礼，下无学，贼民兴，丧无日矣诗曰：‘天之方蹶，无然泄泄。’泄泄，犹沓沓也。事君无义，进退无礼，言则非先王之道者，犹沓沓也。故曰：责难于君谓之恭，陈善闭邪谓之敬，吾君不能谓之贼。”"
                },
                {
                    name:"孟子·万章章句上·第一节",
                    content:"万章问曰：“舜往于田，号泣于旻天，何为其号泣也？”孟子曰：“怨慕也。”万章曰：“父母爱之，喜而不忘；父母恶之，劳而不怨。然则舜怨乎？曰：“长息问于公明高曰：‘舜往于田，则吾既得闻命矣；号泣于旻天，于父母，则吾不知也。’公明高曰：‘是非尔所知也。’夫公明高以孝子之心，为不若是恝，我竭力耕田，共为子职而已矣，父母之不我爱，于我何哉？帝使其子九男二女，百官牛羊仓廪备，以事舜于畎亩之中。天下之士多就之者，帝将胥天下而迁之焉。为不顺于父母，如穷人无所归。天下之士悦之，人之所欲也，而不足以解忧；好色，人之所欲，妻帝之二女，而不足以解忧；富，人之所欲，富有天下，而不足以解忧；贵，人之所欲，贵为天子，而不足以解忧。人悦之、好色、富贵，无足以解忧者，惟顺于父母，可以解忧。人少，则慕父母；知好色，则慕少艾；有妻子，则慕妻子；仕则慕君，不得于君则热中。大孝终身慕父母。五十而慕者，予于大舜见之矣。”"
                },
                {
                    name:"孟子·告子章句上·第四节",
                    content:"告子曰：“食色，性也。仁，内也，非外也；义，外也，非内也。”孟子曰：“何以谓仁内义外也？曰：“彼长而我长之，非有长于我也；犹彼白而我白之，从其白于外也，故谓之外也。曰：“异于白马之白也，无以异于白人之白也；不识长马之长也，无以异于长人之长与？且谓长者义乎？长之者义乎？曰：“吾弟则爱之，秦人之弟则不爱也，是以我为悦者也，故谓之内。长楚人之长，亦长吾之长，是以长为悦者也，故谓之外也。曰：“耆秦人之炙，无以异于耆吾炙。夫物则亦有然者也，然则耆炙亦有外与？”"
                },
                {
                    name:"大学·第一章",
                    content:"大学之道，在明明德，在亲民，在止于至善。知止而后有定，定而后能静，静而后能安，安而后能虑，虑而后能得。物有本末，事有终始。知所先后，则近道矣。古之欲明明德于天下者，先治其国；欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知。致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。自天子以至于庶人，壹是皆以修身为本。其本乱而末治者，否矣。其所厚者薄，而其所薄者厚，未之有也。此谓知本，此谓知之至也。"
                },
                {
                    name:"大学·第二章",
                    content:"《康诰》曰：“克明德。”《大甲》曰：“顾諟天之明命。”《帝典》曰：“克明峻德。”皆自明也。"
                },
                {
                    name:"大学·第三章",
                    content:"汤之《盘铭》曰：“苟日新，日日新，又日新。”《康诰》曰：“作新民。”《诗》曰：“周虽旧邦，其命维新。”是故君子无所不用其极。"
                },
                {
                    name:"大学·第四章",
                    content:"《诗》云：“邦畿千里，维民所止。”《诗》云：“缗蛮黄鸟，止于丘隅。” 子曰：“于止，知其所止，可以人而不如鸟乎？”《诗》云：“穆穆文王，於缉熙敬止！”为人君，止于仁；为人臣，止于敬；为人子，止于孝；为人父，止于慈；与国人交，止于信。《诗》云：“瞻彼淇澳，菉竹猗猗。有匪君子，如切如磋，如琢如磨。瑟兮僴兮，赫兮喧兮。有匪君子，终不可谖兮！”“如切如磋”者，道学也。“如琢如磨”者，自修也。“瑟兮僴兮”者，恂栗也。“赫兮喧兮”者，威仪也。“有匪君子，终不可谖兮”者，道盛德至善，民之不能忘也。《诗》云：“於戏，前王不忘！”君子贤其贤而亲其亲，小人乐其乐而利其利，此以没世不忘也。"
                },
                {
                    name:"大学·第五章",
                    content:"子曰：“听讼，吾犹人也。必也使无讼乎！”无情者不得尽其辞。大畏民志，此谓知本。此谓知本，此谓知之至也。"
                },
                {
                    name:"周易·系辞传上·第八章-二人同心，其利断金。同心之言，其臭如兰",
                    content:"圣人有以见天下之赜，而拟诸其形容，像其物宜，是故谓之象。圣人有以见天下之动，而观其会通，以行其典礼，系辞焉以断其吉凶，是故谓之爻。言天下之至赜而不可恶也。言天下之至动而不可乱也。拟之而后言，议之而后动，拟议以成其变化。“鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。”子曰：“君子居其室，出其言善，则千里之外应之，况其迩者乎？居其室，出其言不善，则千里之外违之，况其迩者乎？言出乎身，加乎民；行发乎迩，见乎远。言行，君子之枢机。枢机之发，荣辱之主也。言行，君子之所以动天地也，可不慎乎！”《同人》：先号啕而后笑。子曰：“君子之道，或出或处，或默或语。二人同心，其利断金。同心之言，其臭如兰。”初六，藉用白茅，无咎。子曰：“苟错诸地而可矣，藉之用茅，何咎之有？慎之至也。夫茅之为物薄，而用可重也。慎斯术也以往，其无所失矣。”劳谦，君子有终，吉。子曰：“劳而不伐，有功而不德，厚之至也。语以其功下人者也。德言盛，礼言恭；谦也者，致恭以存其位者也。”亢龙有悔。子曰：“贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。”不出户庭，无咎。子曰：“乱之所生也，则言语以为阶。君不密则失臣，臣不密则失身，几事不密则害成。是以君子慎密而不出也。”子曰：“作《易》者，其知盗乎？《易》曰‘负且乘，致寇至。’负也者，小人之事也。乘也者，君子之器也。小人而乘君子之器，盗思夺之矣。上慢下暴，盗思伐之矣。慢藏诲盗，冶容诲淫。《易》曰：‘负且乘，致寇至。’盗之招也。”"
                },
                {
                    name:"周易·系辞传下·第二章-穷则变，变则通，通则久",
                    content:"古者包羲氏之王天下也，仰则观象于天，俯则观法于地，观鸟兽之文与地之宜，近取诸身，远取诸物，于是始作八卦，以通神明之德，以类万物之情。作结绳而为网罟，以佃以渔，盖取诸离。包羲氏没，神农氏作，斫木为耜，揉木为耒，耒耨之利，以教天下，盖取诸《益》。日中为市，致天下之民，聚天下之货，交易而退，各得其所，盖取诸《噬嗑》。神农氏没，黄帝、尧、舜氏作，通其变，使民不倦，神而化之，使民宜之。《易》穷则变，变则通，通则久。是以“自天佑之，吉无不利”。黄帝、尧、舜垂衣裳而天下治，盖取诸乾、坤。刳木为舟，剡木为楫，舟楫之利，以济不通，致远以利天下，盖取诸涣。服牛乘马，引重致远，以利天下，盖取诸随。重门击柝，以待暴客，盖取诸豫。断木为杵，掘地为臼，杵臼之利，万民以济，盖取诸小过。弦木为弧，剡木为矢，弧矢之利，以威天下，盖取诸睽。上古穴居而野处，后世圣人易之以宫室，上栋下宇，以待风雨，盖取诸大壮。古之葬者，厚衣之以薪，葬之中野，不封不树，丧期无数。后世圣人易之以棺椁，盖取诸大过。上古结绳而治，后世圣人易之以书契，百官以治，万民以察，盖取诸夬。"
                },
                {
                    name:"周易·系辞传下·第五章-君子藏器于身，待时而动",
                    content:"《易》曰“憧憧往来，朋从尔思。”子曰：“天下何思何虑？天下同归而殊途，一致而百虑。天下何思何虑？日往则月来，月往则日来，日月相推而明生焉。寒往则暑来，暑往则寒来，寒暑相推而岁成焉。往者屈也，来者信也，屈信相感而利生焉。尺蠖之屈，以求信也；龙蛇之蛰，以存身也。精义入神，以致用也；利用安身，以崇德也。过此以往，未之或知也；穷神知化，德之盛也。”《易》曰：“困于石，据于蒺藜，入于其宫，不见其妻，凶。”子曰：“非所困而困焉，名必辱。非所据而据焉，身必危。既辱且危，死期将至，妻其可得见耶！”《易》曰：“公用射隼于高墉之上，获之，无不利。”子曰：“隼者，禽也；弓矢者，器也；射之者，人也。君子藏器于身，待时而动，何不利之有？动而不括，是以出而有获，语成器而动者也。”子曰：“小人不耻不仁，不畏不义，不见利不劝，不威不惩。小惩而大诫，此小人之福也。《易》曰：‘履校灭趾，无咎。’此之谓也。”“善不积不足以成名，恶不积不足以灭身。小人以小善为无益而弗为也，以小恶为无伤而弗去也，故恶积而不可掩，罪大而不可解。《易》曰：‘何校灭耳，凶。’”子曰：“危者，安其位者也；亡者，保其存者也；乱者，有其治者也。是故君子安而不忘危，存而不忘亡，治而不忘乱，是以身安而国家可保也。《易》曰：‘其亡其亡，系于苞桑。’”子曰：“德薄而位尊，知小而谋大，力少而任重，鲜不及矣。《易》曰：‘鼎折足，覆公餗，其形渥，凶。’言不胜其任也。”子曰：“知几其神乎！君子上交不谄，下交不渎，其知几乎？几者，动之微，吉之先见者也。君子见几而作，不俟终日。《易》曰：‘介于石，不终日，贞吉。’介如石焉，宁用终日？断可识矣。君子知微知彰，知柔知刚，万夫之望。” 子曰：“颜氏之子，其殆庶几乎？有不善未尝不知，知之未尝复行也。《易》曰：‘不远复，无祗悔，元吉。’”天地氤氲，万物化醇。男女构精，万物化生。《易》曰：‘三人行则损一人，一人行则得其友。’言致一也。子曰：“君子安其身而后动，易其心而后语，定其交而后求。君子修此三者，故全也。危以动，则民不与也；惧以语，则民不应也；无交而求，则民不与也；莫之与，则伤之者至矣。《易》曰：‘莫益之，或击之，立心勿恒，凶。’”"
                },
                {
                    name:"周易·象传上·乾-天行健；君子以自强不息",
                    content:"天行健；君子以自强不息。潜龙勿用，阳在下也。见龙在田，德施普也。终日乾乾，反复道也。或跃在渊，进无咎也。飞龙在天，大人造也。亢龙有悔，盈不可久也。用九，天德不可为首也。"
                },
                {
                    name:"周易·象传上·坤-地势，坤；君子以厚德载物",
                    content:"地势，坤；君子以厚德载物。履霜坚冰，阴始凝也。驯致其道，至坚冰也。六二之动，直以方也。不习无不利，地道光也。含章可贞，以时发也。或从王事，知光大也。括囊无咎，慎不害也。黄裳元吉，文在中也。龙战于野，其道穷也。用六永贞，以大终也。"
                },
                {
                    name:"周易·象传上·谦-谦谦君子，卑以自牧",
                    content:"地中有山，谦；君子以裒多益寡，称物平施。谦谦君子，卑以自牧也。鸣谦贞吉，中心得也。劳谦君子，万民服也。无不利撝谦，不违则也。利用侵伐，征不服也。鸣谦，志未得也。可用行师，征邑国也。"
                },
                {
                    name:"周易·象传上·益-君子以见善则迁，有过则改。",
                    content:"风雷，益；君子以见善则迁，有过则改。元吉无咎，下不厚事也。或益之，自外来也。益用凶事，固有之也。告公从，以益志也。有孚惠心，勿问之矣。惠我德，大得志也。莫益之，偏辞也。或击之，自外来也。"
                },
                {
                    name:"周易·象传下·家人-君子以言有物而行有恒",
                    content:"风自火出，家人；君子以言有物而行有恒。闲有家，志未变也。六二之吉，顺以巽也。家人嗃嗃，未失也。妇子嘻嘻，失家节也。富家大吉，顺在位也。王假有家，交相爱也。威如之吉，反身之谓也。"
                },
                {
                    name: "孟子·生于忧患，死于安乐",
                    content: "舜发于畎亩之中，傅说举于版筑之间，胶鬲举于鱼盐之中，管夷吾举于士，孙叔敖举于海，百里奚举于市。故天将降大任于是人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行拂乱其所为，所以动心忍性，曾益其所不能。人恒过，然后能改；困于心，衡于虑，而后作；征于色，发于声，而后喻。入则无法家拂士，出则无敌国外患者，国恒亡。然后知生于忧患而死于安乐也。"
                },
                {
                    name: "孟子·鱼我所欲也",
                    content: "鱼，我所欲也；熊掌，亦我所欲也。二者不可得兼，舍鱼而取熊掌者也。生，亦我所欲也；义，亦我所欲也。二者不可得兼，舍生而取义者也。生亦我所欲，所欲有甚于生者，故不为苟得也；死亦我所恶，所恶有甚于死者，故患有所不辟也。如使人之所欲莫甚于生，则凡可以得生者何不用也？使人之所恶莫甚于死者，则凡可以辟患者何不为也？由是则生而有不用也，由是则可以辟患而有不为也。是故所欲有甚于生者，所恶有甚于死者。非独贤者有是心也，人皆有之，贤者能勿丧耳。一箪食，一豆羹，得之则生，弗得则死。呼尔而与之，行道之人弗受；蹴尔而与之，乞人不屑也。万钟则不辩礼义而受之，万钟于我何加焉！为宫室之美、妻妾之奉、所识穷乏者得我与？乡为身死而不受，今为宫室之美为之；乡为身死而不受，今为妻妾之奉为之；乡为身死而不受，今为所识穷乏者得我而为之：是亦不可以已乎？此之谓失其本心。"
                },
                {
                    name: "孟子·得道多助，失道寡助",
                    content: "天时不如地利，地利不如人和。三里之城，七里之郭，环而攻之而不胜。夫环而攻之，必有得天时者矣，然而不胜者，是天时不如地利也。城非不高也，池非不深也，兵革非不坚利也，米粟非不多也，委而去之，是地利不如人和也。故曰：域民不以封疆之界，固国不以山溪之险，威天下不以兵革之利。得道者多助，失道者寡助。寡助之至，亲戚畔之；多助之至，天下顺之。以天下之所顺，攻亲戚之所畔，故君子有不战，战必胜矣。"
                },
                {
                    name: "孟子·孟子一则",
                    content: "“敢问夫子恶乎长？”曰：“我知言，我善养吾浩然之气。”“敢问何谓浩然之气？”曰：“难言也。其为气也，至大至刚，以直养而无害，则塞于天地之间。其为气也，配义与道；无是，馁也。是集义所生者，非义袭而取之也。行有不慊于心，则馁矣。我故曰，告子未尝知义，以其外之也。必有事焉，而勿正，心勿忘，勿助长也。无若宋人然：宋人有闵其苗之不长而揠之者，芒芒然归，谓其人曰：‘今日病矣！予助苗长矣！’其子趋而往视之，苗则槁矣。天下之不助苗长者寡矣。以为无益而舍之者，不耘苗者也；助之长者，揠苗者也，非徒无益，而又害之。”“何谓知言？”曰：“诐辞知其所蔽，淫辞知其所陷，邪辞知其所离，遁辞知其所穷。——生于其心，害于其政；发于其政，害于其事。圣人复起，必从吾言矣。”"
                },
                {
                    name: "孟子·富贵不能淫",
                    content: "景春曰：“公孙衍、张仪岂不诚大丈夫哉？一怒而诸侯惧，安居而天下熄。”孟子曰：“是焉得为大丈夫乎？子未学礼乎？丈夫之冠也，父命之；女子之嫁也，母命之，往送之门，戒之曰：‘往之女家，必敬必戒，无违夫子！’以顺为正者，妾妇之道也。居天下之广居，立天下之正位，行天下之大道。得志，与民由之；不得志，独行其道。富贵不能淫，贫贱不能移，威武不能屈，此之谓大丈夫。”"
                },
                {
                    name: "孟子·人皆有不忍人之心",
                    content: "孟子曰：“人皆有不忍人之心。先王有不忍人之心，斯有不忍人之政矣；以不忍人之心，行不忍人之政，治天下可运之掌上。所以谓人皆有不忍人之心者：今人乍见孺子将入于井，皆有怵惕恻隐之心；非所以内交于孺子之父母也，非所以要誉于乡党朋友也，非恶其声而然也。由是观之，无恻隐之心，非人也；无羞恶之心，非人也；无辞让之心，非人也；无是非之心，非人也。恻隐之心，仁之端也；羞恶之心，义之端也；辞让之心，礼之端也；是非之心，智之端也。人之有是四端也，犹其有四体也。有是四端而自谓不能者，自贼者也；谓其君不能者，贼其君者也。凡有四端于我者，知皆扩而充之矣，若火之始然，泉之始达。苟能充之，足以保四海；苟不充之，不足以事父母。”"
                },
                {
                    name: "荀子·劝学",
                    content: "君子曰：学不可以已。青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴，不复挺者，輮使之然也。故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。故不登高山，不知天之高也；不临深溪，不知地之厚也；不闻先王之遗言，不知学问之大也。干、越、夷、貉之子，生而同声，长而异俗，教使之然也。诗曰：“嗟尔君子，无恒安息。靖共尔位，好是正直。神之听之，介尔景福。”神莫大于化道，福莫长于无祸。吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。(君子生 通：性)南方有鸟焉，名曰蒙鸠，以羽为巢，而编之以发，系之苇苕，风至苕折，卵破子死。巢非不完也，所系者然也。西方有木焉，名曰射干，茎长四寸，生于高山之上，而临百仞之渊，木茎非能长也，所立者然也。蓬生麻中，不扶而直；白沙在涅，与之俱黑。兰槐之根是为芷，其渐之滫，君子不近，庶人不服。其质非不美也，所渐者然也。故君子居必择乡，游必就士，所以防邪辟而近中正也。物类之起，必有所始。荣辱之来，必象其德。肉腐出虫，鱼枯生蠹。怠慢忘身，祸灾乃作。强自取柱，柔自取束。邪秽在身，怨之所构。施薪若一，火就燥也，平地若一，水就湿也。草木畴生，禽兽群焉，物各从其类也。是故质的张，而弓矢至焉；林木茂，而斧斤至焉；树成荫，而众鸟息焉。醯酸，而蜹聚焉。故言有招祸也，行有招辱也，君子慎其所立乎！积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。(江海 一作：江河)是故无冥冥之志者，无昭昭之明；无惛惛之事者，无赫赫之功。行衢道者不至，事两君者不容。目不能两视而明，耳不能两听而聪。螣蛇无足而飞，鼫鼠五技而穷。《诗》曰：“尸鸠在桑，其子七兮。淑人君子，其仪一兮。其仪一兮，心如结兮！”故君子结于一也。昔者瓠巴鼓瑟，而流鱼出听；伯牙鼓琴，而六马仰秣。故声无小而不闻，行无隐而不形 。玉在山而草木润，渊生珠而崖不枯。为善不积邪？安有不闻者乎？学恶乎始？恶乎终？曰：其数则始乎诵经，终乎读礼；其义则始乎为士，终乎为圣人， 真积力久则入，学至乎没而后止也。故学数有终，若其义则不可须臾舍也。为之，人也；舍 之，禽兽也。故书者，政事之纪也；诗者，中声之所止也；礼者，法之大分，类之纲纪也。 故学至乎礼而止矣。夫是之谓道德之极。礼之敬文也，乐之中和也，诗书之博也，春秋之微 也，在天地之间者毕矣。君子之学也，入乎耳，箸乎心，布乎四体，形乎动静。端而言，蝡而动，一可以为法则。小人之学也，入乎耳，出乎口；口耳之间，则四寸耳，曷足以美七尺之躯哉！古之学者为己，今之学者为人。君子之学也，以美其身；小人之学也，以为禽犊。故不问而告谓之傲，问一而告二谓之囋。傲、非也，囋、非也；君子如向矣。学莫便乎近其人。礼乐法而不说，诗书故而不切，春秋约而不速。方其人之习君子之说，则尊以遍矣，周于世矣。故曰：学莫便乎近其人。学之经莫速乎好其人，隆礼次之。上不能好其人，下不能隆礼，安特将学杂识志，顺诗书而已耳。则末世穷年，不免为陋儒而已。将原先王，本仁义，则礼正其经纬蹊径也。若挈裘领，诎五指而顿之，顺者不可胜数也。不道礼宪，以诗书为之，譬之犹以指测河也，以戈舂黍也，以锥餐壶也，不可以得之矣。故隆礼，虽未明，法士也；不隆礼，虽察辩，散儒也。问楛者，勿告也；告楛者，勿问也；说楛者，勿听也。有争气者，勿与辩也。故必由其道至，然后接之；非其道则避之。故礼恭，而后可与言道之方；辞顺，而后可与言道之理；色从而后可与言道之致。故未可与言而言，谓之傲；可与言而不言，谓之隐；不观气色而言，谓瞽。故君子不傲、不隐、不瞽，谨顺其身。诗曰：“匪交匪舒，天子所予。”此之谓也。百发失一，不足谓善射；千里蹞步不至，不足谓善御；伦类不通，仁义不一，不足谓善学。学也者，固学一之也。一出焉，一入焉，涂巷之人也；其善者少，不善者多，桀纣盗跖也；全之尽之，然后学者也。君子知夫不全不粹之不足以为美也，故诵数以贯之，思索以通之，为其人以处之，除其害者以持养之。使目非是无欲见也，使耳非是无欲闻也，使口非是无欲言也，使心非是无欲虑也。及至其致好之也，目好之五色，耳好之五声，口好之五味，心利之有天下。是故权利不能倾也，群众不能移也，天下不能荡也。生乎由是，死乎由是，夫是之谓德操。德操然后能定，能定然后能应。能定能应，夫是之谓成人。天见其明，地见其光，君子贵其全也。"
                },
                {
                    name: "荀子·修身",
                    content: "见善，修然必以自存也；见不善，愀然必以自省也；善在身，介然必以自好也；不善在身，菑然必以自恶也。故非我而当者，吾师也；是我而当者，吾友也；谄谀我者，吾贼也。故君子隆师而亲友，以致恶其贼；好善无厌，受谏而能诫，虽欲无进，得乎哉？小人反是，致乱，而恶人之非己也；致不肖，而欲人之贤己也；心如虎狼，行如禽兽，而又恶人之贼己也；谄谀者亲，谏诤者疏，修正为笑，至忠为贼，虽欲无灭亡，得乎哉？以善先人者谓之教，以善和人者谓之顺；以不善先人者谓之谄，以不善和人者谓之谀。是是、非非谓之知，非是、是非谓之愚。伤良曰谗，害良曰贼。是谓是、非谓非曰直。趣舍无定谓之无常，保利弃义谓之至贼。志意修则骄富贵，道义重则轻王公；内省而外物轻矣。传曰：“君子役物，小人役于物。”此之谓矣。身劳而心安，为之；利少而义多，为之；事乱君而通，不如事穷君而顺焉。故良农不为水旱不耕，良贾不为折阅不市，士君子不为贫穷怠乎道。夫骥一日而千里，驽马十驾则亦及之矣。故跬步而不休，跛鳖千里；累土而不辍，丘山崇成；厌其源，开其渎，江河可竭；一进一退，一左一右，六骥不致。彼人之才性之相县也，岂若跛鳖之与六骥足哉？然而跛鳖致之，六骥不致，是无他故焉，或为之、或不为尔！道虽迩，不行不至；事虽小，不为不成。其为人也多暇日者，其出人不远矣。"
                },
                {
                    name: "荀子·荣辱",
                    content: "憍泄者，人之殃也；恭俭者，偋五兵也。虽有戈矛之刺，不如恭俭之利也。故与人善言，暖于布帛；伤人之言，深于矛戟。故薄薄之地，不得履之，非地不安也。危足无所履者，凡在言也。巨涂则让，小涂则殆，虽欲不谨，若云不使。快快而亡者，怒也；察察而残者，忮也；博而穷者，訾也；清之而俞浊者，口也；豢之而俞瘠者，交也；辩而不说者，争也；直立而不见知者，胜也；廉而不见贵者，刿也；勇而不见惮者，贪也；信而不见敬者，好剸行也。此小人之所务而君子之所不为也。斗者，忘其身者也，忘其亲者也，忘其君者也。行其少顷之怒而丧终身之躯，然且为之，是忘其身也；家室立残，亲戚不免乎刑戮，然且为之，是忘其亲也；君上之所恶也，刑法之所大禁也，然且为之，是忘其君也。忧忘其身，内忘其亲，上忘其君，是刑法之所不舍也，圣王之所不畜也。乳彘不触虎，乳狗不远游，不忘其亲也。人也，忧忘其身，内忘其亲，上忘其君，则是人也而曾狗彘之不若也。凡斗者，必自以为是而以人为非也。己诚是也，人诚非也，则是己君子而人小人也；以君子与小人相贼害也。忧以忘其身，内以忘其亲，上以忘其君，岂不过甚矣哉！是人也，所谓“以狐父之戈钅属牛矢”也。将以为智邪？则愚莫大焉；将以为利邪？则害莫大焉；将以为荣邪？则辱莫大焉；将以为安邪？则危莫大焉。人之有斗，何哉？我欲属之狂惑疾病邪？则不可，圣王又诛之。我欲属之鸟鼠禽兽邪？则不可，其形体又人，而好恶多同。人之有斗，何哉？我甚丑之！有狗彘之勇者，有贾盗之勇者，有小人之勇者，有士君子之勇者：争饮食，无廉耻，不知是非，不辟死伤，不畏众强，恈恈然唯利饮食之见，是狗彘之勇也。为事利，争货财，无辞让，果敢而振，猛贪而戾，恈恈然唯利之见，是贾盗之勇也。轻死而暴，是小人之勇也。义之所在，不倾于权，不顾其利，举国而与之不为改视，重死持义而不桡，是士君子之勇也。鲦䱁者，浮阳之鱼也，胠于沙而思水，则无逮矣。寡于患而欲谨，则无益矣。自知者不怨人，知命者不怨天；怨人者穷，怨天者无志。失之己，反之人，岂不迂乎哉！荣辱之大分，安危利害之常体：先义而后利者荣，先利而后义者辱；荣者常通，辱者常穷；通者常制人，穷者常制于人：是荣辱之大分也。材悫者常安利，荡悍者常危害；安利者常乐易，危害者常忧险；乐易者常寿长，忧险者常夭折：是安危利害之常体也。夫天生蒸民，有所以取之：志意致修，德行致厚，智虑致明，是天子之所以取天下也。政令法，举措时，听断公，上则能顺天子之命，下则能保百姓，是诸侯之所以取国家也。志行修，临官治，上则能顺上，下则能保其职，是士大夫之所以取田邑也。循法则、度量、刑辟、图籍，不知其义，谨守其数，慎不敢损益也；父子相传，以持王公，是故三代虽亡，治法犹存，是官人百吏之所以取禄秩也。孝弟原悫，軥录疾力，以敦比其事业而不敢怠傲，是庶人之所以取暖衣饱食，长生久视，以免于刑戮也。饰邪说，文奸言，为倚事，陶诞、突盗，惕、悍、憍、暴，以偷生反侧于乱世之间，是奸人之所以取危辱死刑也。其虑之不深，其择之不谨，其定取舍楛僈，是其所以危也。材性知能，君子小人一也；好荣恶辱，好利恶害，是君子小人之所同也。若其所以求之之道则异矣。小人也者，疾为诞而欲人之信己也，疾为诈而欲人之亲己也，禽兽之行而欲人之善己也；虑之难知也，行之难安也，持之难立也，成则必不得其所好，必遇其所恶焉。故君子者，信矣，而亦欲人之信己也；忠矣，而亦欲人之亲己也；修正治辨矣，而亦欲人之善己也。虑之易知也，行之易安也，持之易立也，成则必得其所好，必不遇其所恶焉。是故穷则不隐，通则大明，身死而名弥白。小人莫不延颈举踵而愿曰：“知虑材性，固有以贤人矣！”夫不知其与己无以异也。则君子注错之当，而小人注错之过也。故孰察小人之知能，足以知其有余，可以为君子之所为也。譬之越人安越，楚人安楚，君子安雅。是非知能材性然也，是注错习俗之节异也。仁义德行，常安之术也，然而未必不危也；污僈、突盗，常危之术也，然而未必不安也。故君子道其常而小人道其怪。凡人有所一同：饥而欲食，寒而欲暖，劳而欲息，好利而恶害，是人之所生而有也，是无待而然者也，是禹、桀之所同也。目辨白黑美恶，耳辨声音清浊，口辨酸咸甘苦，鼻辨芬芳腥臊，骨体肤理辨寒暑疾养，是又人之所常生而有也，是无待而然者也，是禹、桀之所同也。可以为尧、禹，可以为桀、跖，可以为工匠，可以为农贾，在势注错习俗之所积耳。是又人之所生而有也，是无待而然者也，是禹、桀之所同也。为尧、禹则常安荣，为桀、跖则常危辱；为尧、禹则常愉佚，为工匠、农贾则常烦劳；然而人力为此而寡为彼，何也？曰：陋也。尧、禹者，非生而具者也，夫起于变故，成乎修为，待尽而后备者也。人之生固小人，无师无法则唯利之见耳。人之生固小人，又以遇乱世，得乱俗，是以小重小也，以乱得乱也。君子非得势以临之，则无由得开内焉。今是人之口腹，安知礼义？安知辞让？安知廉耻隅积？亦呥呥而噍，乡乡而饱已矣。人无师无法，则其心正其口腹也。今使人生而未尝睹刍豢稻粱也，惟菽藿糟糠之为睹，则以至足为在此也，俄而粲然有秉刍豢稻粱而至者，则瞲然视之曰：“此何怪也？”彼臭之而嗛于鼻，尝之而甘于口，食之而安于体，则莫不弃此而取彼矣。今以夫先王之道，仁义之统，以相群居，以相持养，以相藩饰，以相安固邪？以夫桀、跖之道，是其为相县也，几直夫刍豢稻粱之县糟糠尔哉！然而人力为此而寡为彼，何也？曰：陋也。陋也者，天下之公患也，人之大殃大害也。故曰：仁者好告示人。告之示之，靡之儇之，鈆之重之，则夫塞者俄且通也，陋者俄且僩也，愚者俄且知也。是若不行，则汤、武在上曷益？桀、纣在上曷损？汤、武存，则天下从而治，桀、纣存，则天下从而乱。如是者，岂非人之情固可与如此，可与如彼也哉！人之情，食欲有刍豢，衣欲有文绣，行欲有舆马，又欲夫余财蓄积之富也；然而穷年累世不知不足，是人之情也。今人之生也，方知畜鸡狗猪彘，又蓄牛羊，然而食不敢有酒肉；余刀布，有囷窌，然而衣不敢有丝帛；约者有筐箧之藏，然而行不敢有舆马。是何也？非不欲也，几不长虑顾后，而恐无以继之故也。于是又节用御欲，收敛蓄藏以继之也。是于己长虑顾后，几不甚善矣哉！今夫偷生浅知之属，曾此而不知也，粮食大侈，不顾其后，俄则屈安穷矣，是其所以不免于冻饿，操瓢囊为沟壑中瘠者也。况夫先王之道，仁义之统，《诗》《书》《礼》《乐》之分乎！彼固为天下之大虑也，将为天下生民之属长虑顾后而保万世也，其氵不长矣，其温厚矣，其功盛姚远矣，非顺孰修为之君子莫之能知也。故曰：短绠不可以汲深井之泉，知不几者不可与及圣人之言。夫《诗》《书》《礼》《乐》之分，固非庸人之所知也。故曰：一之而可再也，有之而可久也，广之而可通也，虑之而可安也，反鈆察之而俞可好也。以治情则利，以为名则荣，以群则和，以独则足，乐意者其是邪？夫贵为天子，富有天下，是人情之所同欲也。然则从人之欲则势不能容，物不能赡也。故先王案为之制礼义以分之，使有贵贱之等，长幼之差，知愚、能不能之分，皆使人载其事，而各得其宜。然后使悫禄多少厚薄之称，是夫群居和一之道也。故仁人在上，则农以力尽田，贾以察尽财，百工以巧尽械器，士大夫以上至于公侯，莫不以仁厚知能尽官职，夫是之谓至平。故或禄天下而不自以为多，或监门、御旅、抱关、击柝而不自以为寡。故曰：“斩而齐，枉而顺，不同而一。”夫是之谓人伦。诗曰：“受小共大共，为下国骏蒙。”此之谓也。"
                },
                {
                    name: "曾子·修身齐家治国平天下",
                    content: "古之欲明明德于天下者，先治其国；欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知，致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。自天子以至于庶人，壹是皆以修身为本。"
                },
                {
                    name:"王阳明·知行合一",
                    content:'知为行之始，行为知之成。知行合一，致良知'
                },
                {
                    name:"王阳明·圣人之道",
                    content:'圣人之道，吾性自足，向之求理于事物者误也。'
                },
                {
                    name:"王阳明·心即理",
                    content:'心外无物、心外无事、心外无理。'
                },
                {
                    name:"王阳明·四诀",
                    content:'无善无恶心之体，有善有恶意之动，知善知恶是良知，为善去恶是格物。'
                },
            ]
        },
            {
            author:"道家",
            article:[
                {
                    name:"道德·道经·第一章-道可道，非常道；名可名，非常名",
                    content:"道可道，非常道；名可名，非常名。无名天地之始，有名万物之母。故常无，欲以观其妙；常有，欲以观其徼。此两者同出而异名，同谓之玄，玄之又玄，众妙之门。",
                },
                {
                    name:"道德经·道经·第四章-和其光，同其尘",
                    content:"道冲，而用之或不盈。渊兮，似万物之宗。挫其锐，解其纷，和其光，同其尘。湛兮，似或存。吾不知谁之子，象帝之先。",
                },
                {
                    name:"道德经·道经·第五章-天地不仁，以万物为刍狗",
                    content:"天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。天地之间，其犹橐籥乎？虚而不屈，动而愈出。多言数穷，不如守中。",
                },
                {
                    name:"道德经·道经·第八章-上善若水，水善利万物而不争",
                    content:"上善若水，水善利万物而不争。处众人之所恶，故几于道。居善地，心善渊，与善仁，言善信，政善治，事善能，动善时。夫唯不争，故无尤。",
                },
                {
                    name:"道德经·道经·第二十五章-人法地，地法天，天法道，道法自然",
                    content:"有物混成，先天地生，寂兮寥兮，独立而不改，周行而不殆，可以为天地母。吾不知其名，字之曰道，强为之名曰大。大曰逝，逝曰远，远曰反。故道大，天大，地大，人亦大。域中有四大，而人居其一焉。人法地，地法天，天法道，道法自然。",
                },
                {
                    name:"道德经·德经·第四十一章-大器晚成",
                    content:"上士闻道，勤而行之；中士闻道，若存若亡；下士闻道，大笑之。不笑不足以为道。故建言有之：明道若昧，进道若退，夷道若颣。上德若谷，大白若辱，广德若不足，建德若偷，质真若渝；大方无隅；大器免成；大音希声；大象无形；道隐无名。夫唯道，善始且善成。",
                },
                {
                    name:"道德经·德经·第四十二章-道生一，一生二，二生三，三生万物",
                    content:"道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤、寡、不穀，而王公以为称。故物或损之而益，或益之而损。人之所教，我亦教之。强梁者不得其死，吾将以为教父。",
                },
                {
                    name:"道德经·德经·第四十五章-大成若缺，其用不弊",
                    content:"大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈，大巧若拙，大辩若讷。躁胜寒，静胜热。清静为天下正。",
                },
                {
                    name:"道德经·德经·第六十四章-千里之行，始于足下",
                    content:"其安易持，其未兆易谋；其脆易泮，其微易散。为之于未有，治之于未乱。合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。为者败之，执者失之。是以圣人无为，故无败，无执故无失。民之从事，常于几成而败之。慎终如始，则无败事。是以圣人欲不欲，不贵难得之货，学不学，复众人之所过，以辅万物之自然而不敢为。",
                },
                {
                    name:"道德经·德经·第六十七章-我有三宝，持而保之。一曰慈，二曰俭，三曰不敢为天下先",
                    content:"天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫！我有三宝，持而保之。一曰慈，二曰俭，三曰不敢为天下先。慈故能勇；俭故能广；不敢为天下先，故能成器长。今舍慈且勇；舍俭且广；舍后且先；死矣！夫慈以战则胜，以守则固。天将救之，以慈卫之。",
                },
                {
                    name:"道德经·德经·第七十七章-天之道，损有余而补不足",
                    content:"天之道，其犹张弓欤？高者抑之，下者举之；有余者损之，不足者补之。天之道，损有余而补不足。人之道，则不然，损不足以奉有余。孰能有余以奉天下，唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤邪。",
                },
                {
                    name:"庄子·内篇·逍遥游-若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉！故曰：至人无己，神人无功，圣人无名",
                    content:"北冥有鱼，其名为鲲。鲲之大，不知其几千里也。化而为鸟，其名为鹏。鹏之背，不知其几千里也。怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。《齐谐》者，志怪者也。《谐》之言曰：“鹏之徙于南冥也，水击三千里，抟扶摇而上者九万里，去以六月息者也。”野马也，尘埃也，生物之以息相吹也。天之苍苍，其正色邪？其远而无所至极邪？其视下也，亦若是则已矣。且夫水之积也不厚，则其负大舟也无力。覆杯水于坳堂之上，则芥为之舟。置杯焉则胶，水浅而舟大也。风之积也不厚，则其负大翼也无力。故九万里则风斯在下矣，而后乃今培风；背负青天而莫之夭阏者，而后乃今将图南。蜩与学鸠笑之曰：“我决起而飞，抢榆枋而止，时则不至，而控于地而已矣，奚以之九万里而南为？”适莽苍者，三餐而反，腹犹果然；适百里者，宿舂粮；适千里者，三月聚粮。之二虫又何知！小知不及大知，小年不及大年。奚以知其然也？朝菌不知晦朔，蟪蛄不知春秋，此小年也。楚之南有冥灵者，以五百岁为春，五百岁为秋；上古有大椿者，以八千岁为春，八千岁为秋，此大年也。而彭祖乃今以久特闻，众人匹之，不亦悲乎！汤之问棘也是已：穷发之北，有冥海者，天池也。有鱼焉，其广数千里，未有知其修者，其名为鲲。有鸟焉，其名为鹏，背若泰山，翼若垂天之云，抟扶摇羊角而上者九万里，绝云气，负青天，然后图南，且适南冥也。斥鴳笑之曰：“彼且奚适也？我腾跃而上，不过数仞而下，翱翔蓬蒿之间，此亦飞之至也，而彼且奚适也？”此小大之辩也。故夫知效一官，行比一乡，德合一君，而征一国者，其自视也，亦若此矣。而宋荣子犹然笑之。且举世誉之而不加劝，举世非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。彼其于世，未数数然也。虽然，犹有未树也。夫列子御风而行，泠然善也，旬有五日而后反。彼于致福者，未数数然也。此虽免乎行，犹有所待者也。若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉！故曰：至人无己，神人无功，圣人无名。尧让天下于许由，曰：“日月出矣，而爝火不息，其于光也，不亦难乎！时雨降矣，而犹浸灌，其于泽也，不亦劳乎！夫子立而天下治，而我犹尸之，吾自视缺然。请致天下。”许由曰：“子治天下，天下既已治也，而我犹代子，吾将为名乎？名者，实之宾也，吾将为宾乎？鹪鹩巢于深林，不过一枝；偃鼠饮河，不过满腹。归休乎君，予无所用天下为！庖人虽不治庖，尸祝不越樽俎而代之矣。”肩吾问于连叔曰：“吾闻言于接舆，大而无当，往而不反。吾惊怖其言犹河汉而无极也，大有径庭，不近人情焉。”连叔曰：“其言谓何哉？”“曰‘藐姑射之山，有神人居焉。肌肤若冰雪，绰约若处子；不食五谷，吸风饮露；乘云气，御飞龙，而游乎四海之外；其神凝，使物不疵疠而年谷熟。’吾以是狂而不信也。”连叔曰：“然，瞽者无以与乎文章之观，聋者无以与乎钟鼓之声。岂唯形骸有聋盲哉？夫知亦有之。是其言也，犹时女也。之人也，之德也，将旁礴万物以为一，世蕲乎乱，孰弊弊焉以天下为事！之人也，物莫之伤，大浸稽天而不溺，大旱金石流、土山焦而不热。是其尘垢粃糠，将犹陶铸尧舜者也，孰肯以物为事！”宋人资章甫而适诸越，越人断发文身，无所用之。尧治天下之民，平海内之政。往见四子藐姑射之山，汾水之阳，窅然丧其天下焉。惠子谓庄子曰：“魏王贻我大瓠之种，我树之成而实五石。以盛水浆，其坚不能自举也。剖之以为瓢，则瓠落无所容。非不呺然大也，吾为其无用而掊之。”庄子曰：“夫子固拙于用大矣。宋人有善为不龟手之药者，世世以洴澼絖为事。客闻之，请买其方百金。聚族而谋之曰：‘我世世为洴澼絖，不过数金。今一朝而鬻技百金，请与之。’客得之，以说吴王。越有难，吴王使之将。冬，与越人水战，大败越人，裂地而封之。能不龟手一也，或以封，或不免于洴澼絖，则所用之异也。今子有五石之瓠，何不虑以为大樽而浮乎江湖，而忧其瓠落无所容？则夫子犹有蓬之心也夫！”惠子谓庄子曰：“吾有大树，人谓之樗。其大本臃肿而不中绳墨，其小枝卷曲而不中规矩。立之涂，匠者不顾。今子之言，大而无用，众所同去也。”庄子曰：“子独不见狸狌乎？卑身而伏，以候敖者；东西跳梁，不避高下；中于机辟，死于罔罟。今夫斄牛，其大若垂天之云。此能为大矣，而不能执鼠。今子有大树，患其无用，何不树之于无何有之乡，广莫之野，彷徨乎无为其侧，逍遥乎寝卧其下。不夭斤斧，物无害者，无所可用，安所困苦哉！”",
                },
                {
                    name:"庄子·内篇·齐物论-天地与我并生，而万物与我为一",
                    content:"南郭子綦隐机而坐，仰天而嘘，嗒焉似丧其耦。颜成子游立侍乎前，曰：“何居乎？形固可使如槁木，而心固可使如死灰乎？今之隐机者，非昔之隐机者也？”子綦曰：“偃，不亦善乎，而问之也！今者吾丧我，汝知之乎？汝闻人籁而未闻地籁，汝闻地籁而不闻天籁夫！”子游曰：“敢问其方。”子綦曰：“夫大块噫气，其名为风。是唯无作，作则万窍怒呺。而独不闻之翏翏乎？山林之畏隹，大木百围之窍穴，似鼻，似口，似耳，似枅，似圈，似臼，似洼者，似污者。激者、謞者、叱者、吸者、叫者、譹者、宎者，咬者，前者唱于而随者唱喁，泠风则小和，飘风则大和，厉风济则众窍为虚。而独不见之调调之刁刁乎？”子游曰：“地籁则众窍是已，人籁则比竹是已，敢问天籁。”子綦曰：“夫吹万不同，为而使其自己也。咸其自取，怒者其谁邪？”大知闲闲，小知閒閒。大言炎炎，小言詹詹。其寐也魂交，其觉也形开。与接为构，日以心斗。缦者、窖者、密者。小恐惴惴，大恐缦缦。其发若机栝，其司是非之谓也；其留如诅盟，其守胜之谓也；其杀如秋冬，以言其日消也；其溺之所为之，不可使复之也；其厌也如缄，以言其老洫也；近死之心，莫使复阳也。喜怒哀乐，虑叹变慹，姚佚启态。乐出虚，蒸成菌。日夜相代乎前而莫知其所萌。已乎，已乎！旦暮得此，其所由以生乎！非彼无我，非我无所取。是亦近矣，而不知其所为使。若有真宰，而特不得其眹。可行己信，而不见其形，有情而无形。百骸、九窍、六藏、赅而存焉，吾谁与为亲？汝皆说之乎？其有私焉？如是皆有为臣妾乎？其臣妾不足以相治乎？其递相为君臣乎？其有真君存焉！如求得其情与不得，无益损乎其真。一受其成形，不亡以待尽。与物相刃相靡，其行尽如驰而莫之能止，不亦悲乎！终身役役而不见其成功，苶然疲役而不知其所归，可不哀邪！人谓之不死，奚益！其形化，其心与之然，可不谓大哀乎？人之生也，固若是芒乎？其我独芒，而人亦有不芒者乎？夫随其成心而师之，谁独且无师乎？奚必知代而心自取者有之？愚者与有焉！未成乎心而有是非，是今日适越而昔至也。是以无有为有。无有为有，虽有神禹且不能知，吾独且奈何哉！夫言非吹也，言者有言。其所言者特未定也。果有言邪？其未尝有言邪？其以为异于鷇音，亦有辩乎？其无辩乎？道恶乎隐而有真伪？言恶乎隐而有是非？道恶乎往而不存？言恶乎存而不可？道隐于小成，言隐于荣华。故有儒墨之是非，以是其所非而非其所是。欲是其所非而非其所是，则莫若以明。物无非彼，物无非是。自彼则不见，自知则知之。故曰：彼出于是，是亦因彼。彼是方生之说也。虽然，方生方死，方死方生；方可方不可，方不可方可；因是因非，因非因是。是以圣人不由而照之于天，亦因是也。是亦彼也，彼亦是也。彼亦一是非，此亦一是非，果且有彼是乎哉？果且无彼是乎哉？彼是莫得其偶，谓之道枢。枢始得其环中，以应无穷。是亦一无穷，非亦一无穷也。故曰：莫若以明。以指喻指之非指，不若以非指喻指之非指也；以马喻马之非马，不若以非马喻马之非马也。天地一指也，万物一马也。可乎可，不可乎不可。道行之而成，物谓之而然。恶乎然？然于然。恶乎可？可于可。恶乎不可？不可于不可。恶乎不然？不然于不然。物固有所然，物固有所可。无物不然，无物不可。故为是举莛与楹，厉与西施，恢诡谲怪，道通为一。其分也，成也；其成也，毁也。凡物无成与毁，复通为一。唯达者知通为一，为是不用而寓诸庸。庸也者，用也；用也者，通也；通也者，得也；适得而几矣。因是已。已而不知其然，谓之道。劳神明为一而不知其同也，谓之“朝三”。何谓“朝三”？狙公赋芧，曰：“朝三而暮四。”众狙皆怒。曰：“然则朝四而暮三。”众狙皆悦。名实未亏而喜怒为用，亦因是也。是以圣人和之以是非而休乎天钧，是之谓两行。古之人，其知有所至矣。恶乎至？有以为未始有物者，至矣，尽矣，不可以加矣！其次以为有物矣，而未始有封也。其次以为有封焉，而未始有是非也。是非之彰也，道之所以亏也。道之所以亏，爱之所以成。果且有成与亏乎哉？果且无成与亏乎哉？有成与亏，故昭氏之鼓琴也；无成与亏，故昭氏之不鼓琴也。昭文之鼓琴也，师旷之枝策也，惠子之据梧也，三者之知几乎！皆其盛者也，故载之末年。唯其好之也，以异于彼，其好之也，欲以明之。彼非所明而明之，故以坚白之昧终。而其子又以文之纶终，终身无成。若是而可谓成乎，虽我亦成也；若是而不可谓成乎，物与我无成也。是故滑疑之耀，圣人之所图也。为是不用而寓诸庸，此之谓“以明”。今且有言于此，不知其与是类乎？其与是不类乎？类与不类，相与为类，则与彼无以异矣。虽然，请尝言之：有始也者，有未始有始也者，有未始有夫未始有始也者；有有也者，有无也者，有未始有无也者，有未始有夫未始有无也者。俄而有无矣，而未知有无之果孰有孰无也。今我则已有有谓矣，而未知吾所谓之其果有谓乎？其果无谓乎？夫天下莫大于秋毫之末，而太山为小；莫寿乎殇子，而彭祖为夭。天地与我并生，而万物与我为一。既已为一矣，且得有言乎？既已谓之一矣，且得无言乎？一与言为二，二与一为三。自此以往，巧历不能得，而况其凡乎！故自无适有，以至于三，而况自有适有乎！无适焉，因是已！夫道未始有封，言未始有常，为是而有畛也。请言其畛：有左有右，有伦有义，有分有辩，有竞有争，此之谓八德。六合之外，圣人存而不论；六合之内，圣人论而不议；春秋经世先王之志，圣人议而不辩。故分也者，有不分也；辩也者，有不辩也。曰：“何也？”“圣人怀之，众人辩之以相示也。故曰：辩也者，有不见也。”夫大道不称，大辩不言，大仁不仁，大廉不嗛，大勇不忮。道昭而不道，言辩而不及，仁常而不成，廉清而不信，勇忮而不成。五者圆而几向方矣！故知止其所不知，至矣。孰知不言之辩，不道之道？若有能知，此之谓天府。注焉而不满，酌焉而不竭，而不知其所由来，此之谓葆光。故昔者尧问于舜曰：“吾欲伐宗脍、胥、敖，南面而不释然。其故何也？”舜曰：“夫三子者，犹存乎蓬艾之间。若不释然何哉！昔者十日并出，万物皆照，而况德之进乎日者乎！”啮缺问乎王倪曰：“子知物之所同是乎？”曰：“吾恶乎知之！”“子知子之所不知邪？”曰：“吾恶乎知之！”“然则物无知邪？”曰：“吾恶乎知之！虽然，尝试言之：庸讵知吾所谓知之非不知邪？庸讵知吾所谓不知之非知邪？且吾尝试问乎女：民湿寝则腰疾偏死，鳅然乎哉？木处则惴栗恂惧，猨猴然乎哉？三者孰知正处？民食刍豢，麋鹿食荐，蝍蛆甘带，鸱鸦耆鼠，四者孰知正味？猨猵狙以为雌，麋与鹿交，鳅与鱼游。毛嫱丽姬，人之所美也；鱼见之深入，鸟见之高飞，麋鹿见之决骤，四者孰知天下之正色哉？自我观之，仁义之端，是非之涂，樊然淆乱，吾恶能知其辩！”啮缺曰：“子不知利害，则至人固不知利害乎？”王倪曰：“至人神矣！大泽焚而不能热，河汉冱而不能寒，疾雷破山、飘风振海而不能惊。若然者，乘云气，骑日月，而游乎四海之外，死生无变于己，而况利害之端乎！”瞿鹊子问乎长梧子曰：“吾闻诸夫子：圣人不从事于务，不就利，不违害，不喜求，不缘道，无谓有谓，有谓无谓，而游乎尘垢之外。夫子以为孟浪之言，而我以为妙道之行也。吾子以为奚若？”长梧子曰：“是黄帝之所听荧也，而丘也何足以知之！且女亦大早计，见卵而求时夜，见弹而求鸮炙。予尝为女妄言之，女以妄听之。奚旁日月，挟宇宙，为其脗合，置其滑涽，以隶相尊？众人役役，圣人愚芚，参万岁而一成纯。万物尽然，而以是相蕴。予恶乎知说生之非惑邪！予恶乎知恶死之非弱丧而不知归者邪！丽之姬，艾封人之子也。晋国之始得之也，涕泣沾襟。及其至于王所，与王同匡床，食刍豢，而后悔其泣也。予恶乎知夫死者不悔其始之蕲生乎？梦饮酒者，旦而哭泣；梦哭泣者，旦而田猎。方其梦也，不知其梦也。梦之中又占其梦焉，觉而后知其梦也。且有大觉而后知此其大梦也，而愚者自以为觉，窃窃然知之。“君乎！牧乎！”固哉！丘也与女皆梦也，予谓女梦亦梦也。是其言也，其名为吊诡。万世之后而一遇大圣知其解者，是旦暮遇之也。既使我与若辩矣，若胜我，我不若胜，若果是也？我果非也邪？我胜若，若不吾胜，我果是也？而果非也邪？其或是也？其或非也邪？其俱是也？其俱非也邪？我与若不能相知也。则人固受其黮暗，吾谁使正之？使同乎若者正之，既与若同矣，恶能正之？使同乎我者正之，既同乎我矣，恶能正之？使异乎我与若者正之，既异乎我与若矣，恶能正之？使同乎我与若者正之，既同乎我与若矣，恶能正之？然则我与若与人俱不能相知也，而待彼也邪？”化声之相待，若其不相待。和之以天倪，因之以曼衍，所以穷年也。“何谓和之以天倪？”曰：“是不是，然不然。是若果是也，则是之异乎不是也亦无辩；然若果然也，则然之异乎不然也亦无辩。忘年忘义，振于无竟，故寓诸无竟。”罔两问景曰：“曩子行，今子止；曩子坐，今子起。何其无特操与？”景曰：“吾有待而然者邪？吾所待又有待而然者邪？吾待蛇蚹蜩翼邪？恶识所以然？恶识所以不然？”昔者庄周梦为胡蝶，栩栩然胡蝶也。自喻适志与！不知周也。俄然觉，则蘧蘧然周也。不知周之梦为胡蝶与？胡蝶之梦为周与？周与胡蝶则必有分矣。此之谓物化。",
                },
                {
                    name:"庄子·内篇·养生主-吾生也有涯，而知也无涯。以有涯随无涯，殆已",
                    content:"吾生也有涯，而知也无涯。以有涯随无涯，殆已！已而为知者，殆而已矣！为善无近名，为恶无近刑，缘督以为经，可以保身，可以全生，可以养亲，可以尽年。庖丁为文惠君解牛，手之所触，肩之所倚，足之所履，膝之所踦，砉然响然，奏刀騞然，莫不中音。合于《桑林》之舞，乃中《经首》之会。文惠君曰：“嘻，善哉！技盍至此乎？”庖丁释刀对曰：“臣之所好者道也，进乎技矣。始臣之解牛之时，所见无非全牛者；三年之后，未尝见全牛也；方今之时，臣以神遇而不以目视，官知止而神欲行。依乎天理，批大郤，导大窾，因其固然。技经肯綮之未尝，而况大軱乎！良庖岁更刀，割也；族庖月更刀，折也；今臣之刀十九年矣，所解数千牛矣，而刀刃若新发于硎。彼节者有间而刀刃者无厚，以无厚入有间，恢恢乎其于游刃必有余地矣。是以十九年而刀刃若新发于硎。虽然，每至于族，吾见其难为，怵然为戒，视为止，行为迟，动刀甚微，謋然已解，如土委地。提刀而立，为之而四顾，为之踌躇满志，善刀而藏之。”文惠君曰：“善哉！吾闻庖丁之言，得养生焉。”公文轩见右师而惊曰：“是何人也？恶乎介也？天与？其人与？”曰：“天也，非人也。天之生是使独也，人之貌有与也。以是知其天也，非人也。”泽雉十步一啄，百步一饮，不蕲畜乎樊中。神虽王，不善也。老聃死，秦佚吊之，三号而出。弟子曰：“非夫子之友邪？”曰：“然。”“然则吊焉若此可乎？”曰：“然。始也吾以为其人也，而今非也。向吾入而吊焉，有老者哭之，如哭其子；少者哭之，如哭其母。彼其所以会之，必有不蕲言而言，不蕲哭而哭者。是遁天倍情，忘其所受，古者谓之遁天之刑。适来，夫子时也；适去，夫子顺也。安时而处顺，哀乐不能入也，古者谓是帝之县解。”指穷于为薪，火传也，不知其尽也。",
                },
                {
                    name:"庄子·内篇·人间世-知其不可奈何而安之若命",
                    content:"颜回见仲尼，请行。曰：“奚之？”曰：“将之卫。”曰：“奚为焉？”曰：“回闻卫君，其年壮，其行独。轻用其国而不见其过。轻用民死，死者以国量，乎泽若蕉，民其无如矣！回尝闻之夫子曰：‘治国去之，乱国就之。医门多疾。’愿以所闻思其则，庶几其国有瘳乎！”仲尼曰：“嘻，若殆往而刑耳！夫道不欲杂，杂则多，多则扰，扰则忧，忧而不救。古之至人，先存诸己而后存诸人。所存于己者未定，何暇至于暴人之所行！且若亦知夫德之所荡而知之所为出乎哉？德荡乎名，知出乎争。名也者，相轧也；知也者争之器也。二者凶器，非所以尽行也。且德厚信矼，未达人气；名闻不争，未达人心。而强以仁义绳墨之言術暴人之前者，是以人恶有其美也，命之曰灾人。灾人者，人必反灾之。若殆为人灾夫。且苟为人悦贤而恶不肖，恶用而求有以异？若唯无诏，王公必将乘人而斗其捷。而目将荧之，而色将平之，口将营之，容将形之，心且成之。是以火救火，以水救水，名之曰益多。顺始无穷，若殆以不信厚言，必死于暴人之前矣！且昔者桀杀关龙逄，纣杀王子比干，是皆修其身以下伛拊人之民，以下拂其上者也，故其君因其修以挤之。是好名者也。昔者尧攻丛枝、胥、敖，禹攻有扈。国为虚厉，身为刑戮。其用兵不止，其求实无已，是皆求名实者也，而独不闻之乎？名实者，圣人之所不能胜也，而况若乎！虽然，若必有以也，尝以语我来。”颜回曰：“端而虚，勉而一，则可乎？”曰：“恶！恶可！夫以阳为充孔扬，采色不定，常人之所不违，因案人之所感，以求容与其心，名之曰日渐之德不成，而况大德乎！将执而不化，外合而内不訾，其庸讵可乎！”“然则我内直而外曲，成而上比。内直者，与天为徒。与天为徒者，知天子之与己，皆天之所子，而独以己言蕲乎而人善之，蕲乎而人不善之邪？若然者，人谓之童子，是之谓与天为徒。外曲者，与人之为徒也。擎跽曲拳，人臣之礼也。人皆为之，吾敢不为邪？为人之所为者，人亦无疵焉，是之谓与人为徒。成而上比者，与古为徒。其言虽教，谪之实也，古之有也，非吾有也。若然者，虽直而不病，是之谓与古为徒。若是则可乎？”仲尼曰：“恶！恶可！大多政法而不谍。虽固，亦无罪。虽然，止是耳矣，夫胡可以及化！犹师心者也。”颜回曰：“吾无以进矣，敢问其方。”仲尼曰：“斋，吾将语若。有心而为之，其易邪？易之者，皞天不宜。”颜回曰：“回之家贫，唯不饮酒不茹荤者数月矣。如此则可以为斋乎？”曰：“是祭祀之斋，非心斋也。”回曰：“敢问心斋。”仲尼曰：“若一志，无听之以耳而听之以心；无听之以心而听之以气。听止于耳，心止于符。气也者，虚而待物者也。唯道集虚。虚者，心斋也”颜回曰：“回之未始得使，实自回也；得使之也，未始有回也，可谓虚乎？”夫子曰：“尽矣！吾语若：若能入游其樊而无感其名，入则鸣，不入则止。无门无毒，一宅而寓于不得已则几矣。绝迹易，无行地难。为人使易以伪，为天使难以伪。闻以有翼飞者矣，未闻以无翼飞者也；闻以有知知者矣，未闻以无知知者也。瞻彼阕者，虚室生白，吉祥止止。夫且不止，是之谓坐驰。夫徇耳目内通而外于心知，鬼神将来舍，而况人乎！是万物之化也，禹、舜之所纽也，伏戏、几蘧之所行终，而况散焉者乎！”叶公子高将使于齐，问于仲尼曰：“王使诸梁也甚重。齐之待使者，盖将甚敬而不急。匹夫犹未可动也，而况诸侯乎！吾甚栗之。子常语诸梁也曰：‘凡事若小若大，寡不道以欢成。事若不成，则必有人道之患；事若成，则必有阴阳之患。若成若不成而后无患者，唯有德者能之。’吾食也执粗而不臧，爨无欲清之人。今吾朝受命而夕饮冰，我其内热与！吾未至乎事之情而既有阴阳之患矣！事若不成，必有人道之患，是两也。为人臣者不足以任之，子其有以语我来！”仲尼曰：“天下有大戒二：其一命也，其一义也。子之爱亲，命也，不可解于心；臣之事君，义也，无适而非君也，无所逃于天地之间。是之谓大戒。是以夫事其亲者，不择地而安之，孝之至也；夫事其君者，不择事而安之，忠之盛也；自事其心者，哀乐不易施乎前，知其不可奈何而安之若命，德之至也。为人臣子者，固有所不得已。行事之情而忘其身，何暇至于悦生而恶死！夫子其行可矣！丘请复以所闻：凡交近则必相靡以信，远则必忠之以言。言必或传之。夫传两喜两怒之言，天下之难者也。夫两喜必多溢美之言，两怒必多溢恶之言。凡溢之类妄，妄则其信之也莫，莫则传言者殃。故法言曰：‘传其常情，无传其溢言，则几乎全。’且以巧斗力者，始乎阳，常卒乎阴，泰至则多奇巧；以礼饮酒者，始乎治，常卒乎乱，泰至则多奇乐。凡事亦然，始乎谅，常卒乎鄙；其作始也简，其将毕也必巨。言者，风波也；行者，实丧也。夫风波易以动，实丧易以危。故忿设无由，巧言偏辞。兽死不择音，气息勃然于是并生心厉。剋核太至，则必有不肖之心应之而不知其然也。苟为不知其然也，孰知其所终！故法言曰：‘无迁令，无劝成。过度益也。’迁令劝成殆事。美成在久，恶成不及改，可不慎与！且夫乘物以游心，托不得已以养中，至矣。何作为报也！莫若为致命，此其难者？”颜阖将傅卫灵公大子，而问于蘧伯玉曰；“有人于此，其德天杀。与之为无方则危吾国，与之为有方则危吾身。其知适足以知人之过，而不知其所以过。若然者，吾奈之何？”蘧伯玉曰：“善哉问乎！戒之，慎之，正女身哉！形莫若就，心莫若和。虽然，之二者有患。就不欲入，和不欲出。形就而入，且为颠为灭，为崩为蹶；心和而出，且为声为名，为妖为孽。彼且为婴儿，亦与之为婴儿；彼且为无町畦，亦与之为无町畦；彼且为无崖，亦与之为无崖；达之，入于无疵。汝不知夫螳螂乎？怒其臂以当车辙，不知其不胜任也，是其才之美者也。戒之，慎之，积伐而美者以犯之，几矣！汝不知夫养虎者乎？不敢以生物与之，为其杀之之怒也；不敢以全物与之，为其决之之怒也。时其饥饱，达其怒心。虎之与人异类，而媚养己者，顺也；故其杀者，逆也。夫爱马者，以筐盛矢，以蜃盛溺。适有蚊虻仆缘，而拊之不时，则缺衔毁首碎胸。意有所至而爱有所亡。可不慎邪？”匠石之齐，至于曲辕，见栎社树。其大蔽牛，絜之百围，其高临山十仞而后有枝，其可以舟者旁十数。观者如市，匠伯不顾，遂行不辍。弟子厌观之，走及匠石，曰：‘自吾执斧斤以随夫子，未尝见材如此其美也。先生不肯视，行不辍，何邪？”曰：“已矣，勿言之矣！散木也。以为舟则沉，以为棺椁则速腐，以为器则速毁，以为门户则液瞒，以为柱则蠹，是不材之木也。无所可用，故能若是之寿。”匠石归，栎社见梦曰：“女将恶乎比予哉？若将比予于文木邪？夫楂梨橘柚果蓏之属，实熟则剥，剥则辱。大枝折，小枝泄。此以其能苦其生者也。故不终其天年而中道夭，自掊击于世俗者也。物莫不若是。且予求无所可用久矣！几死，乃今得之，为予大用。使予也而有用，且得有此大也邪？且也若与予也皆物也，奈何哉其相物也？而几死之散人，又恶知散木！”匠石觉而诊其梦。弟子曰：“趣取无用，则为社何邪？”曰：“密！若无言！彼亦直寄焉！以为不知己者诟厉也。不为社者，且几有翦乎！且也彼其所保与众异，而以义喻之，不亦远乎！”南伯子綦游乎商之丘，见大木焉，有异：结驷千乘，隐将芘其所藾。子綦曰：“此何木也哉！此必有异材夫！”仰而视其细枝，则拳曲而不可以为栋梁；俯而视其大根，则轴解而不可以为棺椁；舐其叶，则口烂而为伤；嗅之则使人狂酲三日而不已。子綦曰“此果不材之木也，以至于此其大也。嗟乎神人，以此不材。”宋有荆氏者，宜楸柏桑。其拱把而上者，求狙猴之杙斩之；三围四围，求高名之丽者斩之；七围八围，贵人富商之家求禅傍者斩之。故未终其天年而中道之夭于斧斤，此材之患也。故解之以牛之白颡者，与豚之亢鼻者，与人有痔病者，不可以适河。此皆巫祝以知之矣，所以为不祥也。此乃神人之所以为大祥也。支离疏者，颐隐于齐，肩高于顶，会撮指天，五管在上，两髀为胁。挫针治繲，足以餬口；鼓荚播精，足以食十人。上征武士，则支离攘臂于其间；上有大役，则支离以有常疾不受功；上与病者粟，则受三锺与十束薪。夫支离者其形者，犹足以养其身，终其天年，又况支离其德者乎！孔子适楚，楚狂接舆游其门曰：“凤兮凤兮，何如德之衰也。来世不可待，往世不可追也。天下有道，圣人成焉；天下无道，圣人生焉。方今之时，仅免刑焉！福轻乎羽，莫之知载；祸重乎地，莫之知避。已乎，已乎！临人以德。殆乎，殆乎！画地而趋。迷阳迷阳，无伤吾行。吾行郤曲，无伤吾足。”山木，自寇也；膏火，自煎也。桂可食，故伐之；漆可用，故割之。人皆知有用之用，而莫知无用之用也。",
                },
                {
                    name:"庄子·内篇·大宗师-知天之所为，知人之所为者，至矣！知天之所为者，天而生也；知 人之所为者，以其知之所知以养其知之所不知，终其天年而不中道夭 者，是知之盛也",
                    content:"知天之所为，知人之所为者，至矣！知天之所为者，天而生也；知 人之所为者，以其知之所知以养其知之所不知，终其天年而不中道夭 者，是知之盛也。虽然，有患：夫知有所待而后当，其所待者特未定 也。庸讵知吾所谓天之非人乎？所谓人之非天乎？且有真人而后有真 知。何谓真人？古之真人，不逆寡，不雄成，不谟士。若然者，过而弗 悔，当而不自得也。若然者，登高不栗，入水不濡，入火不热，是知 之能登假于道者也若此。古之真人，其寝不梦，其觉无忧，其食不甘，其息深深。真人之息 以踵，众人之息以喉。屈服者，其嗌言若哇。其耆欲深者，其天机浅 。古之真人，不知说生，不知恶死。其出不欣，其入不距。翛然而往， 翛然而来而已矣。不忘其所始，不求其所终。受而喜之，忘而复之。 是之谓不以心捐道，不以人助天，是之谓真人。若然者，其心志，其 容寂，其颡頯。凄然似秋，暖然似春，喜怒通四时，与物有宜而莫知 其极。故圣人之用兵也，亡国而不失人心。利泽施乎万世，不为爱人。 故乐通物，非圣人也；有亲，非仁也；天时，非贤也；利害不通，非 君子也；行名失己，非士也；亡身不真，非役人也。若狐不偕、务光、 伯夷、叔齐、箕子、胥余、纪他、申徒狄，是役人之役，适人之适， 而不自适其适者也。古之真人，其状义而不朋，若不足而不承；与乎其觚而不坚也，张 乎其虚而不华也；邴邴乎其似喜也，崔崔乎其不得已也，滀乎进我色 也，与乎止我德也，广乎其似世也，謷乎其未 可制也，连乎其似好闭也，悗乎忘其言也。以刑为体，以礼为翼，以 知为时，以德为循。以刑为体者，绰乎其杀也；以礼为翼者，所以行 于世也；以知为时者，不得已于事也；以德为循者，言其与有足者至 于丘也，而人真以为勤行者也。故其好之也一，其弗好之也一。其一 也一，其不一也一。其一与天为徒，其不一与人为徒，天与人不相胜 也，是之谓真人。死生，命也；其有夜旦之常，天也。人之有所不得与，皆物之情也 。彼特以天为父，而身犹爱之，而况其卓乎！人特以有君为愈乎己， 而身犹死之，而况其真乎！泉涸，鱼相与处于陆，相呴以湿，相濡以沫，不如相忘于江湖。与 其誉尧而非桀也，不如两忘而化其道。夫大块载我以形，劳我以生，佚我以老，息我以死。故善吾生者， 乃所以善吾死也。夫藏舟于壑，藏山于泽，谓之固矣！然而夜半有力 者负之而走，昧者不知也。藏小大有宜，犹有所循。若夫藏天下于天 下而不得所循，是恒物之大情也。特犯人之形而犹喜之。若人之形者 ，万化而未始有极也，其为乐可胜计邪？故圣人将游于物之所不得循 而皆存。善妖善老，善始善终，人犹效之，而况万物之所系而一化之 所待乎！夫道有情有信，无为无形；可传而不可受，可得而不可见；自本自 根，未有天地，自古以固存；神鬼神帝，生天生地；在太极之先而不 为高，在六极之下而不为深，先天地生而不为久，长于上古而不为老 。豨韦氏得之，以挈天地；伏戏氏得之，以袭气母；维斗得之，终古 不忒；日月得之，终古不息；勘坏得之，以袭昆仑；冯夷得之，以游 大川；肩吾得之，以处大山；黄帝得之，以登云天；颛顼得之，以处 玄宫；禺强得之，立乎北极；西王母得之，坐乎少广，莫知其始，莫 知其终；彭祖得之，上及有虞，下及及五伯；傅说得之，以相武丁， 奄有天下，乘东维、骑箕尾而比于列星。南伯子葵问乎女偊曰：“子之年长矣，而色若孺子，何也？”曰： “吾闻道矣。”南伯子葵曰：“道可得学邪？”曰：“恶！恶可！子 非其人也。夫卜梁倚有圣人之才而无圣人之道，我有圣人之道而无圣 人之才。吾欲以教之，庶几其果为圣人乎？不然，以圣人之道告圣人 之才，亦易矣。吾犹守而告之，参日而后能外天下；已外天下矣，吾 又守之，七日而后能外物；已外物矣，吾又守之，九日而后能外生； 已外生矣，而后能朝彻；朝彻而后能见独；见独而后能无古今；无古 今而后能入于不死不生。杀生者不死，生生者不生。其为物无不将也， 无不迎也，无不毁也，无不成也。其名为撄宁。撄宁也者，撄而后成 者也。”南伯子葵曰：“子独恶乎闻之？”曰：“闻诸副墨之子，副墨之子 闻诸洛诵之孙，洛诵之孙闻之瞻明，瞻明闻之聂许，聂许闻之需役， 需役闻之于讴，于讴闻之玄冥，玄冥闻之参寥，参寥闻之疑始。”子祀、子舆、子犁、子来四人相与语曰：“孰能以无为首，以生为 脊，以死为尻；孰知死生存亡之一体者，吾与之友矣！”四人相视而 笑，莫逆于心，遂相与为友。俄而子舆有病，子祀往问之。曰：“伟 哉，夫造物者将以予为此拘拘也。”曲偻发背，上有五管，颐隐于齐 ，肩高于顶，句赘指天，阴阳之气有沴，其心闲而无事，胼（左“足”右“鲜”）而鉴于井，曰：“嗟乎！夫造物者又将 以予为此拘拘也。”子祀曰：“女恶之乎？”曰：“亡，予何恶！浸假而化予之左臂以 为鸡，予因以求时夜；浸假而化予之右臂以为弹，予因以求鸮炙；浸 假而化予之尻以为轮，以神为马，予因以乘之，岂更驾哉！且夫得者， 时也；失者，顺也。安时而处顺，哀乐不能入也，此古之所谓县解也， 而不能自解者，物有结之。且夫物不胜天久矣，吾又何恶焉！”俄而子来有病，喘喘然将死。其妻子环而泣之。子犁往问之，曰： “叱！避！无怛化！”倚其户与之语曰：“伟哉造化！又将奚以汝为 ？将奚以汝适？以汝为鼠肝乎？以汝为虫臂乎？”子来曰：“父母于 子，东西南北，唯命之从。阴阳于人，不翅于父母。彼近吾死而我不 听，我则悍矣，彼何罪焉？夫大块以载我以形，劳我以生，佚我以老 ，息我以死。故善吾生者，乃所以善吾死也。今大冶铸金，金踊跃曰 ：‘我且必为镆铘！’大冶必以为不祥之金。今一犯人之形而曰：‘ 人耳！人耳！’夫造化者必以为不祥之人。今一以天地为大炉，以造 化为大冶，恶乎往而不可哉！”成然寐，蘧然觉。子桑户、孟子反、子琴张三人相与友曰：“孰能相与于无相与，相 为于无相为；孰能登天游雾，挠挑无极，相忘以生，无所穷终！”三 人相视而笑，莫逆于心，遂相与友。莫然有间，而子桑户死，未葬。孔子闻之，使子贡往侍事焉。或编 曲，或鼓琴，相和而歌曰：“嗟来桑户乎！嗟来桑户乎！而已反其真 ，而我犹为人猗！”子贡趋而进曰：“敢问临尸而歌，礼乎？”二人 相视而笑曰：“是恶知礼意！”子贡反，以告孔子曰：“彼何人者邪 ？修行无有而外其形骸，临尸而歌，颜色不变，无以命之。彼何人者 邪？”孔子曰：“彼游方之外者也，而丘游方之内者也。外内不相及 ，而丘使女往吊之，丘则陋矣！彼方且与造物者为人，而游乎天地之 一气。彼以生为附赘县疣，以死为决（疒丸）溃痈。夫若然者，又恶知死生先后之所在！假于异物 ，托于同体；忘其肝胆，遗其耳目；反复终始，不知端倪；芒然彷徨乎尘垢之外，逍遥乎无为之业。彼又恶能愦愦然为世俗之礼，以观众 人之耳目哉！”子贡曰：“然则夫子何方之依？”孔子曰：“丘，天之戮民也。虽 然，吾与汝共之。”子贡曰：“敢问其方？”孔子曰：“鱼相造乎水 ，人相造乎道。相造乎水者，穿池而养给；相造乎道者，无事而生定 。故曰：鱼相忘乎江湖，人相忘乎道术。”子贡曰：“敢问畸人？” 曰：“畸人者，畸于人而侔于天。故曰：天之小人，人之君子；人之 君子，天之小人也。”颜回问仲尼曰：“孟孙才，其母死，哭泣无涕，中心不戚，居丧不 哀。无是三者，以善处丧盖鲁国，固有无其实而得其名者乎？回壹怪 之。”仲尼曰：“夫孟孙氏尽之矣，进于知矣，唯简之而不得，夫已 有所简矣。孟孙氏不知所以生，不知所以死。不知就先，不知就后。 若化为物，以待其所不知之化已乎。且方将化，恶知不化哉？方将不 化，恶知已化哉？吾特与汝，其梦未始觉者邪！且彼有骇形而无损心 ，有旦宅而无情死。孟孙氏特觉，人哭亦哭，是自其所以乃。且也相 与‘吾之’耳矣，庸讵知吾所谓‘吾之’乎？且汝梦为鸟而厉乎天， 梦为鱼而没于渊。不识今之言者，其觉者乎？其梦者乎？造适不及笑 ，献笑不及排，安排而去化，乃入于寥天一。”意而子见许由，许由曰：“尧何以资汝？”意而子曰：“尧谓我： 汝必躬服仁义而明言是非。”许由曰：“而奚来为轵？夫尧既已黥汝 以仁义，而劓汝以是非矣。汝将何以游夫遥荡恣睢转徙之涂乎？”意而子曰：“虽然，吾愿游于其藩。”许由曰：“不然。夫盲者无 以与乎眉目颜色之好，瞽者无以与乎青黄黼黻之观。”意而子曰：“ 夫无庄之失其美，据梁之失其力，黄帝之亡其知，皆在炉捶之间耳。 庸讵知夫造物者之不息我黥而补我劓，使我乘成以随先生邪？”许由 曰：“噫！未可知也。我为汝言其大略：吾师乎！吾师乎！赍万物而 不为义，泽及万世而不为仁，长于上古而不为老，覆载天地、刻雕众 形而不为巧。此所游已！颜回曰：“回益矣。”仲尼曰：“何谓也？”曰：“回忘仁义矣。”曰：“可矣，犹未也。”他日，复见，曰：“回益矣。”曰：“何谓也？”曰：“回忘礼乐矣。”曰：“可矣，犹未也。”他日，复见，曰：“回益矣。”曰：“何谓也？”曰：“回坐忘矣。”仲尼蹴然曰：“何谓坐忘？”颜回曰：“堕肢体，黜聪明，离形去智，同于大通，此谓坐忘。”仲尼曰：“同则无好也，化则无常也。而果其贤乎！丘也请从而后也。”子舆与子桑友。而霖雨十日，子舆曰：“子桑殆病矣！”裹饭而往 食之。至子桑之门，则若歌若哭，鼓琴曰：“父邪！母邪！天乎！人 乎！”有不任其声而趋举其诗焉。子舆入，曰：“子之歌诗，何故若 是？”曰：“吾思夫使我至此极者而弗得也。父母岂欲吾贫哉？天无 私覆，地无私载，天地岂私贫我哉？求其为之者而不得也！然而至此极者，命也夫！”",
                },
                {
                    name:"庄子·外篇·知北游-人生天地之间，若白驹之过隙，忽然而已",
                    content:"知北游于玄水之上，登隐弅之丘，而适遭无为谓焉。知谓无为谓曰：“予欲有问乎若：何思何虑则知道？何处何服则安道？何从何道则得道？”三问而无为谓不答也。非不答，不知答也。知不得问，反于白水之南，登狐阕之上，而睹狂屈焉。知以之言也问乎狂屈。狂屈曰：“唉！予知之，将语若，中欲言而忘其所欲言。”知不得问，反于帝宫，见黄帝而问焉。黄帝曰：“无思无虑始知道，无处无服始安道，无从无道始得道。”知问黄帝曰：“我与若知之，彼与彼不知也，其孰是邪？”黄帝曰：“彼无为谓真是也，狂屈似之，我与汝终不近也。夫知者不言，言者不知，故圣人行不言之教。道不可致，德不可至。仁可为也，义可亏也，礼相伪也。故曰：‘失道而后德，失德而后仁，失仁而后义，失义而后礼。’礼者，道之华而乱之首也。故曰：‘为道者日损，损之又损之，以至于无为。无为而无不为也。’今已为物也，欲复归根，不亦难乎！其易也其唯大人乎！生也死之徒，死也生之始，孰知其纪！人之生，气之聚也。聚则为生，散则为死。若死生为徒，吾又何患！故万物一也。是其所美者为神奇，其所恶者为臭腐。臭腐复化为神奇，神奇复化为臭腐。故曰：‘通天下一气耳。’圣人故贵一。”知谓黄帝曰：“吾问无为谓，无为谓不应我，非不我应，不知应我也；吾问狂屈，狂屈中欲告我而不我告，非不我告，中欲告而忘之也；今予问乎若，若知之，奚故不近？”黄帝曰：“彼其真是也，以其不知也；此其似之也，以其忘之也；予与若终不近也，以其知之也。”狂屈闻之，以黄帝为知言。天地有大美而不言，四时有明法而不议，万物有成理而不说。圣人者，原天地之美而达万物之理。是故至人无为，大圣不作，观于天地之谓也。今彼神明至精，与彼百化。物已死生方圆，莫知其根也。扁然而万物，自古以固存。六合为巨，未离其内；秋豪为小，待之成体；天下莫不沉浮，终身不故；阴阳四时运行，各得其序；惛然若亡而存；油然不形而神；万物畜而不知：此之谓本根，可以观于天矣！啮缺问道乎被衣，被衣曰：“若正汝形，一汝视，天和将至；摄汝知，一汝度，神将来舍。德将为汝美，道将为汝居。汝瞳焉如新生之犊而无求其故。”言未卒，啮缺睡寐。被衣大说，行歌而去之，曰：“形若槁骸，心若死灰，真其实知，不以故自持。媒媒晦晦，无心而不可与谋。彼何人哉！”舜问乎丞：“道可得而有乎？”曰：“汝身非汝有也，汝何得有夫道！”舜曰：“吾身非吾有也，孰有之哉？”曰：“是天地之委形也；生非汝有，是天地之委和也；性命非汝有，是天地之委顺也；子孙非汝有，是天地之委蜕也。故行不知所往，处不知所持，食不知所味。天地之强阳气也，又胡可得而有邪！”孔子问于老聃曰：“今日晏闲，敢问至道。”老聃曰：“汝齐戒，疏瀹而心，澡雪而精神，掊击而知。夫道，窨然难言哉！将为汝言其崖略：夫昭昭生于冥冥，有伦生于无形，精神生于道，形本生于精，而万物以形相生。故九窍者胎生，八窍者卵生。其来无迹，其往无崖，无门无房，四达之皇皇也。邀于此者，四肢强，思虑恂达，耳目聪明。其用心不劳，其应物无方，天不得不高，地不得不广，日月不得不行，万物不得不昌，此其道与！且夫博之不必知，辩之不必慧，圣人以断之矣！若夫益之而不加益，损之而不加损者，圣人之所保也。渊渊乎其若海，魏魏乎其终则复始也。运量万物而不匮。则君子之道，彼其外与！万物皆往资焉而不匮。此其道与！“中国有人焉，非阴非阳，处于天地之间，直且为人，将反于宗。自本观之，生者，喑噫物也。虽有寿夭，相去几何？须臾之说也，奚足以为尧、桀之是非！果蓏有理，人伦虽难，所以相齿。圣人遭之而不违，过之而不守。调而应之，德也；偶而应之，道也。帝之所兴，王之所起也。“人生天地之间，若白驹之过隙，忽然而已。注然勃然，莫不出焉；油然寥然，莫不入焉。已化而生，又化而死。生物哀之，人类悲之。解其天韬，堕其天帙。纷乎宛乎，魂魄将往，乃身从之。乃大归乎！不形之形，形之不形，是人之所同知也，非将至之所务也，此众人之所同论也。彼至则不论，论则不至；明见无值，辩不若默；道不可闻，闻不若塞：此之谓大得。”东郭子问于庄子曰：“所谓道，恶乎在？”庄子曰：“无所不在。”东郭子曰：“期而后可。”庄子曰：“在蝼蚁。”曰：“何其下邪？”曰：“在稊稗。”曰：“何其愈下邪？”曰：“在瓦甓。”曰：“何其愈甚邪？”曰：“在屎溺。”东郭子不应。庄子曰：“夫子之问也，固不及质。正、获之问于监市履狶也，‘每下愈况’。汝唯莫必，无乎逃物。至道若是，大言亦然。周遍咸三者，异名同实，其指一也。尝相与游乎无有之宫，同合而论，无所终穷乎！尝相与无为乎！澹澹而静乎！漠而清乎！调而闲乎！寥已吾志，无往焉而不知其所至，去而来不知其所止。吾往来焉而不知其所终，彷徨乎冯闳，大知入焉而不知其所穷。物物者与物无际，而物有际者，所谓物际者也。不际之际，际之不际者也。谓盈虚衰杀，彼为盈虚非盈虚，彼为衰杀非衰杀，彼为本末非本末，彼为积散非积散也。”妸荷甘与神农同学于老龙吉。神农隐几，阖户昼瞑。妸荷甘日中奓户而入，曰：“老龙死矣！”神农隐几拥杖而起，嚗然放杖而笑，曰：“天知予僻陋谩诞，故弃予而死。已矣，夫子无所发予之狂言而死矣夫！”弇堈吊闻之，曰：“夫体道者，天下之君子所系焉。今于道，秋豪之端万分未得处一焉，而犹知藏其狂言而死，又况夫体道者乎！视之无形，听之无声，于人之论者，谓之冥冥，所以论道而非道也。”于是泰清问乎无穷，曰：“子知道乎？”无穷曰：“吾不知。”又问乎无为，无为曰：“吾知道。”曰：“子之知道，亦有数乎？”曰：“有。”曰：“其数若何？”无为曰：“吾知道之可以贵、可以贱、可以约、可以散，此吾所以知道之数也。”泰清以之言也问乎无始，曰：“若是，则无穷之弗知与无为之知，孰是而孰非乎？”无始曰：“不知深矣，知之浅矣；弗知内矣，知之外矣。”于是泰清仰而叹曰：“弗知乃知乎，知乃不知乎！孰知不知之知？”无始曰：“道不可闻，闻而非也；道不可见，见而非也；道不可言，言而非也！知形形之不形乎！道不当名。”无始曰：“有问道而应之者，不知道也；虽问道者，亦未闻道。道无问，问无应。无问问之，是问穷也；无应应之，是无内也。以无内待问穷，若是者，外不观乎宇宙，内不知乎大初。是以不过乎昆仑，不游乎太虚。”光曜问乎无有曰：“夫子有乎？其无有乎？”光曜不得问而孰视其状貌：窨然空然。终日视之而不见，听之而不闻，搏之而不得也。光曜曰：“至矣，其孰能至此乎！予能有无矣，而未能无无也。及为无有矣，何从至此哉！”大马之捶钩者，年八十矣，而不失豪芒。大马曰：“子巧与！有道与？”曰：“臣有守也。臣之年二十而好捶钩，于物无视也，非钩无察也。”是用之者假不用者也，以长得其用，而况乎无不用者乎！物孰不资焉！冉求问于仲尼曰：“未有天地可知邪？”仲尼曰：“可。古犹今也。”冉求失问而退。明日复见，曰：“昔者吾问‘未有天地可知乎？’夫子曰：‘可。古犹今也。’昔日吾昭然，今日吾昧然。敢问何谓也？”仲尼曰：“昔之昭然也，神者先受之；今之昧然也，且又为不神者求邪！无古无今，无始无终。未有子孙而有孙子可乎？”冉求未对。仲尼曰：“已矣，末应矣！不以生生死，不以死死生。死生有待邪？皆有所一体。有先天地生者物邪？物物者非物，物出不得先物也，犹其有物也。犹其有物也无已！圣人之爱人也终无已者，亦乃取于是者也。”颜渊问乎仲尼曰：“回尝闻诸夫子曰：‘无有所将，无有所迎。’回敢问其游。”仲尼曰：“古之人外化而内不化，今之人内化而外不化。与物化者，一不化者也。安化安不化？安与之相靡？必与之莫多。狶韦氏之囿，黄帝之圃，有虞氏之宫，汤武之室。君子之人，若儒墨者师，故以是非相赍也，而况今之人乎！圣人处物不伤物。不伤物者，物亦不能伤也。唯无所伤者，为能与人相将迎。山林与，皋壤与，使我欣欣然而乐与！乐未毕也，哀又继之。哀乐之来，吾不能御，其去弗能止。悲夫，世人直为物逆旅耳！夫知遇而不知所不遇，知能能而不能所不能。无知无能者，固人之所不免也。夫务免乎人之所不免者，岂不亦悲哉！至言去言，至为去为。齐知之，所知则浅矣！”",
                },
                {
                    name:"庄子·外篇·徐无鬼-农夫无草莱之事则不比；商贾无市井之事则不比",
                    content:"徐无鬼因女商见魏武侯，武侯劳之曰：“先生病矣，苦于山林之劳，故乃肯见于寡人。”徐无鬼曰：“我则劳于君，君有何劳于我！君将盈耆欲，长好恶，则性命之情病矣；君将黜耆欲，牵好恶，则耳目病矣。我将劳君，君有何劳于我！”武侯超然不对。少焉，徐无鬼曰：“尝语君吾相狗也：下之质，执饱而止，是狸德也；中之质，若视日；上之质，若亡其一。吾相狗又不若吾相马也。吾相马：直者中绳，曲者中钩，方者中矩，圆者中规。是国马也，而未若天下马也。天下马有成材，若卹若失，若丧其一。若是者，超轶绝尘，不知其所。”武侯大悦而笑。徐无鬼出，女商曰：“先生独何以说吾君乎？吾所以说吾君者，横说之则以《诗》、《书》、《礼》、《乐》，从说则以《金板》、《六韬》，奉事而大有功者不可为数，而吾君未尝启齿。今先生何以说吾君？使吾君说若此乎？”徐无鬼曰：“吾直告之吾相狗马耳。”女商曰：“若是乎？”曰：“子不闻夫越之流人乎？去国数日，见其所知而喜；去国旬月，见所尝见于国中者喜；及期年也，见似人者而喜矣。不亦去人滋久，思人滋深乎？夫逃虚空者，藜藋柱乎鼪鼬之径，良位其空，闻人足音跫然而喜矣，又况乎昆弟亲戚之謦欬其侧者乎！久矣夫，莫以真人之言謦欬吾君之侧乎！”徐无鬼见武侯，武侯曰：“先生居山林，食芧栗，厌葱韭，以宾寡人，久矣夫！今老邪？其欲干酒肉之味邪？其寡人亦有社稷之福邪？”徐无鬼曰：“无鬼生于贫贱，未尝敢饮食君之酒肉，将来劳君也。”君曰：“何哉！奚劳寡人？”曰：“劳君之神与形。”武侯曰：“何谓邪？”徐无鬼曰：“天地之养也一，登高不可以为长，居下不可以为短。君独为万乘之主，以苦一国之民，以养耳目鼻口，夫神者不自许也。夫神者，好和而恶奸。夫奸，病也，故劳之。唯君所病之何也？”武侯曰：“欲见先生久矣！吾欲爱民而为义偃兵，其可乎？”徐无鬼曰：“不可。爱民，害民之始也；为义偃兵，造兵之本也。君自此为之，则殆不成。凡成美，恶器也。君虽为仁义，几且伪哉！形固造形，成固有伐，变固外战。君亦必无盛鹤列于丽谯之间，无徒骥于锱坛之宫，无藏逆于得，无以巧胜人，无以谋胜人，无以战胜人。夫杀人之士民，兼人之土地，以养吾私与吾神者，其战不知孰善？胜之恶乎在？君若勿已矣！修胸中之诚以应天地之情而勿撄。夫民死已脱矣，君将恶乎用夫偃兵哉！黄帝将见大隗乎具茨之山，方明为御，昌寓骖乘，张若、谐朋前马，昆阍、滑稽后车。至于襄城之野，七圣皆迷，无所问涂。适遇牧马童子，问涂焉，曰：“若知具茨之山乎？”曰：“然。”“若知大隗之所存乎？”曰：“然。”黄帝曰：“异哉小童！非徒知具茨之山，又知大隗之所存。请问为天下。”小童曰：“夫为天下者，亦若此而已矣，又奚事焉！予少而自游于六合之内，予适有瞀病，有长者教予曰：‘若乘日之车而游于襄城之野。’今予病少痊，予又且复游于六合之外。夫为天下亦若此而已。予又奚事焉！”黄帝曰：“夫为天下者，则诚非吾子之事，虽然，请问为天下。”小童辞。黄帝又问。小童曰：“夫为天下者，亦奚以异乎牧马者哉！亦去其害马者而已矣！”黄帝再拜稽首，称天师而退。知士无思虑之变则不乐；辩士无谈说之序则不乐；察士无凌谇之事则不乐：皆囿于物者也。招世之士兴朝；中民之士荣官；筋力之士矜難；勇敢之士奋患；兵革之士乐战；枯槁之士宿名；法律之士广治；禮教之士敬容；仁义之士贵际。农夫无草莱之事则不比；商贾无市井之事则不比；庶人有旦暮之业则劝；百工有器械之巧则壮。钱财不积则贪者忧，权势不尤则夸者悲，势物之徒乐变。遭时有所用，不能无为也，此皆顺比于岁，不物于易者也。驰其形性，潜之万物，终身不反，悲夫！庄子曰：“射者非前期而中谓之善射，天下皆羿也，可乎？”惠子曰：“可。”庄子曰：“天下非有公是也，而各是其所是，天下皆尧也，可乎？”惠子曰：“可。”庄子曰：“然则儒墨杨秉四，与夫子为五，果孰是邪？或者若鲁遽者邪？其弟子曰：‘我得夫子之道矣！吾能冬爨鼎而夏造冰矣！’鲁遽曰：‘是直以阳召阳，以阴召阴，非吾所谓道也。吾示子乎吾道。’于是乎为之调瑟，废一于堂，废一于室，鼓宫宫动，鼓角角动，音律同矣！夫或改调一弦，于五音无当也，鼓之，二十五弦皆动，未始异于声而音之君已！且若是者邪！”惠子曰∶“今乎儒墨杨秉，且方与我以辩，相拂以辞，相镇以声，而未始吾非也，则奚若矣？”庄子曰：“齐人蹢子于宋者，其命阍也不以完；其求钘钟也以束缚；其求唐子也而未始出域：有遗类矣！夫楚人寄而蹢阍者；夜半于无人之时而与舟人斗，未始离于岑而足以造于怨也。”庄子送葬，过惠子之墓，顾谓从者曰：“郢人垩慢其鼻端若蝇翼，使匠人斫之。匠石运斤成风，听而斫之，尽垩而鼻不伤，郢人立不失容。宋元君闻之，召匠石曰：‘尝试为寡人为之。’匠石曰：‘臣则尝能斫之。虽然，臣之质死久矣！’自夫子之死也，吾无以为质矣，吾无与言之矣！”管仲有病，桓公问之曰：“仲父之病病矣，可不讳云，至于大病，则寡人恶乎属国而可？”管仲曰：“公谁欲与？”公曰：“鲍叔牙。”曰：“不可。其为人洁廉，善士也；其于不己若者不比之；又一闻人之过，终身不忘。使之治国，上且钩乎君，下且逆乎民。其得罪于君也将弗久矣！”公曰：“然则孰可？”对曰：“勿已则隰朋可。其为人也，上忘而下畔，愧不若黄帝，而哀不己若者。以德分人谓之圣；以财分人谓之贤。以贤临人，未有得人者也；以贤下人，未有不得人者也。其于国有不闻也，其于家有不见也。勿已则隰朋可。”吴王浮于江，登乎狙之山，众狙见之，恂然弃而走，逃于深蓁。有一狙焉，委蛇攫囗（“搔”字以“爪”代“虫”音ｚａｏ３），见巧乎王。王射之，敏给搏捷矢。王命相者趋射之，狙执死。王顾谓其友颜不疑曰：“之狙也，伐其巧、恃其便以敖予，以至此殛也。戒之哉！嗟乎！无以汝色骄人哉？”颜不疑归而师董梧，以锄其色，去乐辞显，三年而国人称之。南伯子綦隐几而坐，仰天而嘘。颜成子入见曰：“夫子，物之尤也。形固可使若槁骸，心固可使若死灰乎？”曰：“吾尝居山穴之中矣。当是时也，田禾一睹我而齐国之众三贺之。我必先之，彼故知之；我必卖之，彼故鬻之。若我而不有之，彼恶得而知之？若我而不卖之，彼恶得而鬻之？嗟乎！我悲人之自丧者；吾又悲夫悲人者；吾又悲夫悲人之悲者；其后而日远矣！”仲尼之楚，楚王觞之。孙叔敖执爵而立。市南宜僚受酒而祭，曰：“古之人乎！于此言已。”曰：“丘也闻不言之言矣，未之尝言，于此乎言之：市南宜僚弄丸而两家之难解；孙叔敖甘寝秉羽而郢人投兵；丘愿有喙三尺。”彼之谓不道之道，此之谓不言之辩。故德总乎道之所一，而言休乎知之所不知，至矣。道之所一者，德不能同也。知之所不能知者，辩不能举也。名若儒墨而凶矣。故海不辞东流，大之至也。圣人并包天地，泽及天下，而不知其谁氏。是故生无爵，死无谥，实不聚，名不立，此之谓大人。狗不以善吠为良，人不以善言为贤，而况为大乎！夫为大不足以为大，而况为德乎！夫大备矣，莫若天地。然奚求焉，而大备矣！知大备者，无求，无失，无弃，不以物易己也。反己而不穷，循古而不摩，大人之诚！子綦有八子，陈诸前，召九方歅曰：“为我相吾子，孰为祥。”九方囗曰：“梱也为祥。”子綦瞿然喜曰：“奚若？”曰：“梱也，将与国君同食以终其身。”子綦索然出涕曰：“吾子何为以至于是极也？”九方囗曰：“夫与国君同食，泽及三族，而况父母乎！今夫子闻之而泣，是御福也。子则祥矣，父则不祥。”子綦曰：“歅，汝何足以识之。而梱祥邪？尽于酒肉，入于鼻口矣，而何足以知其所自来！吾未尝为牧而牂生于奥，未尝好田而鹑生于宎，若勿怪，何邪？吾所与吾子游者，游于天地，吾与之邀乐于天，吾与之邀食于地。吾不与之为事，不与之为谋，不与之为怪。吾与之乘天地之诚而不以物与之相撄，吾与之一委蛇而不与之为事所宜。今也然有世俗之偿焉？凡有怪征者必有怪行。殆乎！非我与吾子之罪，几天与之也！吾是以泣也。”无几何而使梱之于燕，盗得之于道，全而鬻之则难，不若刖之则易。于是乎刖而鬻之于齐，适当渠公之街，然身食肉而终。啮缺遇许由曰：“子将奚之？”曰：“将逃尧。”曰：“奚谓邪？”曰：“夫尧畜畜然仁，吾恐其为天下笑。后世其人与人相食与！夫民不难聚也，爱之则亲，利之则至，誉之则劝，致其所恶则散。爱利出乎仁义，捐仁义者寡，利仁义者众。夫仁义之行，唯且无诚，且假乎禽贪者器。是以一人之断制天下，譬之犹一覕也。夫尧知贤人之利天下也，而不知其贼天下也。夫唯外乎贤者知之矣。”有暖姝者，有濡需者，有卷娄者。所谓暖姝者，学一先生之言，则暖暖姝姝而私自说也，自以为足矣，而未知未始有物也。是以谓暖姝者也。濡需者，豕虱是也，择疏鬣长毛，自以为广宫大囿。奎蹄曲隈，乳间股脚，自以为安室利处。不知屠者之一旦鼓臂布草操烟火，而己与豕俱焦也。此以域进，此以域退，此其所谓濡需者也。卷娄者，舜也。羊肉不慕蚁，蚁慕羊肉，羊肉羶也。舜有羶行，百姓悦之，故三徙成都，至邓之虚而十有万家。尧闻舜之贤，举之童土之地，曰：“冀得其来之泽。”舜举乎童土之地，年齿长矣，聪明衰矣，而不得休归，所谓卷娄者也。是以神人恶众至，众至则不比，不比则不利也。故无所甚亲，无所甚疏，抱德炀和，以顺天下，此谓真人。于蚁弃知，于鱼得计，于羊弃意。以目视目，以耳听耳，以心复心。若然者，其平也绳，其变也循。古之真人！以天待之，不以人入天，古之真人！得之也生，失之也死；得之也死，失之也生：药也。其实堇也，桔梗也，鸡雍也，豕零也，是时为帝者也，何可胜言！句践也以甲楯三千栖于会稽，唯种也能知亡之所以存，唯种也不知其身之所以愁。故曰：鸱目有所适，鹤胫有所节，解之也悲。故曰：风之过，河也有损焉；日之过，河也有损焉；请只风与日相与守河，而河以为未始其撄也，恃源而往者也。故水之守土也审，影之守人也审，物之守物也审。故目之于明也殆，耳之于聪也殆，心之于殉也殆，凡能其于府也殆，殆之成也不给改。祸之长也兹萃，其反也缘功，其果也待久。而人以为己宝，不亦悲乎！故有亡国戮民无已，不知问是也。故足之于地也践，虽践，恃其所不蹍而后善博也；人之知也少，虽少，恃其所不知而后知天之所谓也。知大一，知大阴，知大目，知大均，知大方，知大信，知大定，至矣！大一通之，大阴解之，大目视之，大均缘之，大方体之，大信稽之，大定持之。尽有天，循有照，冥有枢，始有彼。则其解之也似不解之者，其知之也似不知之也，不知而后知之。其问之也，不可以有崖，而不可以无崖。颉滑有实，古今不代，而不可以亏，则可不谓有大扬搉乎！阖不亦问是已，奚惑然为！以不惑解惑，复于不惑，是尚大不惑。",
                },
            ]
        },
            {
            author:"墨家",
            article: [
                {
                    name:"墨子·第十四章·兼爱上",
                    content:"圣人以治天下为事者也，必知乱之所自起，焉能治之；不知乱之所自起，则不能治。譬之如医之攻人之疾者然：必知疾之所自起，焉能攻之；不知疾之所自起，则弗能攻。治乱者何独不然？必知乱之所自起，焉能治之；不知乱之斯自起，则弗能治。圣人以治天下为事者也，不可不察乱之所自起。当察乱何自起？起不相爱。臣子之不孝君父，所谓乱也。子自爱，不爱父，故亏父而自利；弟自爱，不爱兄，故亏兄而自利；臣自爱，不爱君，故亏君而自利，此所谓乱也。虽父之不慈子，兄之不慈弟，君之不慈臣，此亦天下之所谓乱也。父自爱也，不爱子，故亏子而自利；兄自爱也，不爱弟，故亏弟而自利；君自爱也，不爱臣，故亏臣而自利。是何也？皆起不相爱。虽至天下之为盗贼者亦然：盗爱其室，不爱其异室，故窃异室以利其室。贼爱其身，不爱人，故贼人以利其身。此何也？皆起不相爱。虽至大夫之相乱家，诸侯之相攻国者亦然：大夫各爱其家，不爱异家，故乱异家以利其家。诸侯各爱其国，不爱异国，故攻异国以利其国，天下之乱物，具此而已矣。察此何自起？皆起不相爱。若使天下兼相爱，爱人若爱其身，犹有不孝者乎？视父兄与君若其身，恶施不孝？犹有不慈者乎？视弟子与臣若其身，恶施不慈？故不孝不慈亡有。犹有盗贼乎？故视人之室若其室，谁窃？视人身若其身，谁贼？故盗贼亡有。犹有大夫之相乱家、诸侯之相攻国者乎？视人家若其家，谁乱？视人国若其国，谁攻？故大夫之相乱家、诸侯之相攻国者亡有。若使天下兼相爱，国与国不相攻，家与家不相乱，盗贼无有，君臣父子皆能孝慈，若此，则天下治。故圣人以治天下为事者，恶得不禁恶而劝爱？故天下兼相爱则治，交相恶则乱。故子墨子曰：“不可以不劝爱人者，此也。”"
                },
                {
                    name:"墨子·第十五章·兼爱中",
                    content:"子墨子言曰：“仁人之所以为事者，必兴天下之利，除去天下之害，以此为事者也。”然则天下之利何也？天下之害何也？子墨子言曰：“今若国之与国之相攻，家之与家之相篡，人之与人之相贼，君臣不惠忠，父子不慈孝，兄弟不和调，此则天下之害也。”然则崇此害亦何用生哉？以不相爱生邪？子墨子言：“以不相爱生。”今诸侯独知爱其国，不爱人之国，是以不惮举其国，以攻人之国。今家主独知爱其家，而不爱人之家，是以不惮举其家，以篡人之家。今人独知爱其身，不爱人之身，是以不惮举其身，以贼人之身。是故诸侯不相爱，则必野战；家主不相爱，则必相篡；人与人不相爱，则必相贼；君臣不相爱，则不惠忠；父子不相爱，则不慈孝；兄弟不相爱，则不和调。天下之人皆不相爱，强必执弱，富必侮贫，贵必敖贱，诈必欺愚。凡天下祸篡怨恨，其所以起者，以不相爱生也，是以仁者非之。既以非之，何以易之？子墨子言曰：“以兼相爱、交相利之法易之。”然则兼相爱、交相利之法，将奈何哉？子墨子言：“视人之国，若视其国；视人之家，若视其家；视人之身，若视其身。是故诸侯相爱，则不野战；家主相爱，则不相篡；人与人相爱，则不相贼；君臣相爱，则惠忠；父子相爱，则慈孝；兄弟相爱，则和调。天下之人皆相爱，强不执弱，众不劫寡，富不侮贫，贵不敖贱，诈不欺愚。凡天下祸篡怨恨，可使毋起者，以相爱生也，是以仁者誉之。”然而今天下之士君子曰：“然！乃若兼则善矣；虽然，天下之难物于故也。”子墨子言曰：“天下之士君子，特不识其利、辩其故也。今若夫攻城野战，杀身为名，此天下百姓之所皆难也。苟君说之，则士众能为之。况于兼相爱、交相利，则与此异！夫爱人者，人必从而爱之；利人者，人必从而利之；恶人者，人必从而恶之；害人者，人必从而害之。此何难之有？特上弗以为政，士不以为行故也。”昔者晋文公好士之恶衣，故文公之臣，皆牂羊之裘，韦以带剑，练帛之冠，入以见于君，出以践于朝。是其故何也？君说之，故臣为之也。昔者楚灵王好士细要，故灵王之臣，皆以一饭为节，胁息然后带，扶墙然后起。比期年，朝有黧黑之色。是其故何也?君说之，故臣能之也。昔越王勾践好士之勇，教驯其臣和合之，焚舟失火，试其士曰：“越国之宝尽在此！”越王亲自鼓其士而进之。士闻鼓音，破碎乱行，蹈火而死者，左右百人有余，越王击金而退之。是故子墨子言曰：“乃若夫少食、恶衣、杀身而为名，此天下百姓之所皆难也，若苟君说之，则众能为之；况兼相爱、交相利，与此异矣！夫爱人者，人亦从而爱之；利人者，人亦从而利之；恶人者，人亦从而恶之；害人者，人亦从而害之。此何难之有焉？特君不以为政，而士不以为行故也。然而今天下之士君子曰：“然！乃若兼则善矣；虽然，不可行之物也。譬若挈太山越河、济也。”子墨子言：“是非其譬也。夫挈太山而越河、济，可谓毕劫有力矣。自古及今，未有能行之者也；况乎兼相爱、交相利，则与此异，古者圣王行之。”何以知其然？古者禹治天下，西为西河渔窦，以泄渠、孙、皇之水。北为防、原、派、注后之邸，噱池之窦洒为底柱，凿为龙门，以利燕代胡貉与西河之民。东为漏大陆，防孟诸之泽，洒为九浍，以楗东土之水，以利冀州之民。南为江、汉、淮、汝，东流之注五湖之处，以利荆楚、干、越与南夷之民。此言禹之事，吾今行兼矣。昔者文王之治西土，若日若月，乍光于四方，于西土。不为大国侮小国，不为众庶侮鳏寡，不为暴势夺穑人黍稷狗彘。天屑临文王慈，是以老而无子者，有所得终其寿；连独无兄弟者，有所杂于生人之闲间，少失其父母者，有所放依而长。此文王之事，则吾今行兼矣。昔者武王将事太山，隧传曰：“泰山，有道曾孙周王有事。大事既获，仁人尚作，以祗商、夏、蛮夷丑貉。虽有周亲，不若仁人，万方有罪，维予一人。”此言武王之事，吾今行兼矣。是故子墨子言曰：“今天下之士君子，忠实欲天下之富，而恶其贫；欲天下之治，而恶其乱，当兼相爱、交相利。此圣王之法，天下之治道也，不可不务为也。”"
                },
                {
                    name:"墨子·第十六章·兼爱下",
                    content:"子墨子言曰：“仁人之事者，必务求兴天下之利，除天下之害。”然当今之时，天下之害孰为大？曰：若大国之攻小国也，大家之乱小家也，强之劫弱，众之暴寡，诈之谋愚，贵之敖贱，此天下之害也。又与为人君者之不惠也，臣者之不忠也，父者之不慈也，子者之不孝也，此又天下之害也。又与今人之贱人，执其兵刃毒药水火，以交相亏贼，此又天下之害也。姑尝本原若众害之所自生。此胡自生？此自爱人、利人生与？即必曰：“非然也。”必曰：“从恶人、贼人生。”分名乎天下，恶人而贼人者，兼与？别与？即必曰：“别也。”然即之交别者，果生天下之大害者与？是故别非也。子墨子曰：“非人者必有以易之，若非人而无以易之，譬之犹以水救水也，其说将必无可矣。”是故子墨子曰：“兼以易别。”然即兼之可以易别之故何也？曰：藉为人之国，若为其国，夫谁独举其国，以攻人之国者哉？为彼者，由为己也。为人之都，若为其都，夫谁独举其都以伐人之都者哉？为彼者犹为己也。为人之家，若为其家，夫谁独举其家以乱人之家者哉？为彼者犹为己也。然即国都不相攻伐，人家不相乱贼，此天下之害与？天下之利与？即必曰天下之利也。姑尝本原若众利之所自生，此胡自生？此自恶人贼人生与？即必曰：“非然也。”必曰：“从爱人利人生。”分名乎天下爱人而利人者，别与？兼与？即必曰：“兼也。”然即之交兼者，果生天下之大利与？是故子墨子曰:“兼是也。”且乡吾本言曰：“仁人之是者，必务求兴天下之利，除天下之害。今吾本原兼之所生，天下之大利者也；今吾本原别之所生，天下之大害者也。是故子墨子曰：“别非而兼是者。”出乎若方也。今吾将正求与天下之利而取之，以兼为正，是以聪耳明目相与视听乎？是以股肱毕强相为动宰乎？而有道肆相教诲，是以老而无妻子者，有所侍养以终其寿；幼弱孤童之无父母者，有所放依以长其身。今唯毋以兼为正，即若其利也。不识天下之士，所以皆闻兼而非者，其故何也？然而天下之士，非兼者之言，犹未止也。曰：“即善矣!虽然，岂可用哉？”子墨子曰:“用而不可，虽我亦将非之；且焉有善而不可用者。”姑尝两而进之。谁以为二士，使其一士者执别，使其一士者执兼。是故别士之言曰：“吾岂能为吾友之身，若为吾身？为吾友之亲，若为吾亲？”是故退睹其友，饥即不食，寒即不衣，疾病不侍养，死丧不葬埋。别士之言若此，行若此。兼士之言不然，行亦不然。曰：“吾闻高士于天下者，必为其友之身，若为其身；为其友之亲，若为其亲。然后可以为高士于天下。”是故退睹其友，饥则食之，寒则衣之，疾病侍养之，死丧葬埋之，兼士之言若此，行若此。若之二士者，言相非而行相反与？当使若二士者，言必信，行必果，使言行之合，犹合符节也，无言而不行也。然即敢问：今有平原广野于此，被甲婴胄，将往战，死生之权未可识也；又有君大夫之远使于巴、越、齐、荆，往来及否，未可识也。然即敢问：不识将恶也，家室，奉承亲戚、提挈妻子而寄托之，不识于兼之有是乎？于别之有是乎？我以为当其于此也，天下无愚夫愚妇，虽非兼之人，必寄托之于兼之有是也。此言而非兼，择即取兼，即此言行费也。不识天下之士，所以皆闻兼而非之者，其故何也？然而天下之士，非兼者之言，犹未止也。曰：“意可以择士，而不可以择君乎？”姑尝两而进之，谁以为二君，使其一君者执兼，使其一君者执别。是故别君之言曰：“吾恶能为吾万民之身，若为吾身？此泰非天下之情也。人之生乎地上之无几何也，譬之犹驰驷而过隙也。”是故退睹其万民，饥即不食，寒即不衣，疲病不侍养，死丧不葬埋。别君之言若此，行若此。兼君之言不然，行亦不然，曰：“吾闻为明君于天下者，必先万民之身，后为其身，然后可以为明君于天下。”是故退睹其万民，饥即食之，寒即衣之，疾病侍养之，死丧葬埋之。兼君之言若此，行若此。然即交若之二君者，言相非而行相反与？常使若二君者，言必信，行必果，使言行之合，犹合符节也，无言而不行也。然即敢问：今岁有疠疫，万民多有勤苦冻馁，转死沟壑中者，既已众矣。不识将择之二君者，将何从也？我以为当其于此也，天下无愚夫愚妇，虽非兼者，必从兼君是也。言而非兼，择即取兼，此言行拂也。不识天下所以皆闻兼而非之者，其故何也？然而天下之士非兼者之言，犹未止也。曰:“兼即仁矣，义矣；虽然，岂可为哉？吾譬兼之不可为也，犹挈泰山以超江、河也。故兼者，直愿之也，夫岂可为之物哉？”子墨子曰：“夫挈泰山以超江、河，自古之及今，生民而来，未尝有也。今若夫兼相爱、交相利，此自先圣六王者亲行之。”何知先圣六王之亲行之也？子墨子曰：“吾非与之并世同时，亲闻其声，见其色也；以其所书于竹帛、镂于金石、琢于盘盂，传遗后世子孙者知之。”泰誓曰：“文王若日若月乍照，光于四方，于西土。”即此言文王之兼爱天下之博大也；譬之日月，兼照天下之无有私也。即此文王兼也；虽子墨子之所谓兼者，于文王取法焉！且不唯《泰誓》为然，虽《禹誓》即亦犹是也。禹曰：“济济有众，咸听朕言！非惟小子，敢行称乱。蠢此有苗，用天之罚。若予既率而群对诸群，以征有苗。”禹之征有苗也，非以求以重富贵，干福禄，乐耳目也；以求兴天下之利，除天下之害。即此禹兼也；虽子墨子之所谓兼者，于禹求焉。且不唯《禹誓》为然，虽《汤说》即亦犹是也。汤曰：“惟予小子履，敢用玄牡。告于上天后曰：今天大旱，即当朕身屦，未知得罪于上下。有善不敢蔽，有罪不敢赦，简在帝心，万方有罪，即当朕身；朕身有罪，无及万方。”即此言汤贵为天子，富有天下，然且不惮以身为牺牲，以词说于上帝鬼神。即此汤兼也；虽子墨子之所谓兼者，于汤取法焉。且不惟誓命与汤说为然，《周诗》即亦犹是也。《周诗》曰：“王道荡荡，不偏不党；王道平平，不党不偏。其直若矢，其易若底。君子之所履，小人之所视。”若吾言非语道之谓也，古者文、武为正均分，赏贤罚暴，勿有亲戚弟兄之所阿。即此文、武兼也，虽子墨子之所谓兼者，于文、武取法焉。不识天下之人，所以皆闻兼而非之者，其故何也？然而天下之非兼者之言，犹未止。曰：“意不忠亲之利，而害为孝乎？”子墨子曰：“姑尝本原之孝子之为亲度者。吾不识孝子之为亲度者，亦欲人爱、利其亲与？意欲人之恶、贼其亲与？以说观之，即欲人之爱、利其亲也。然即吾恶先从事即得此？若我先从事乎爱利人之亲，然后人报我以爱利吾亲乎？意我先从事乎恶人之亲，然后人报我以爱利吾亲乎？即必吾先从事乎爱利人之亲，然后人报我以爱利吾亲也。然即之交孝子者，果不得已乎？毋先从事爱利人之亲与？意以天下之孝子为遇，而不足以为正乎？姑尝本原之。先王之所书，《大雅》之所道曰：“无言而不雠，无德而不报，投我以桃，报之以李。”即此言爱人者必见爱也，而恶人者必见恶也。不识天下之士，所以皆闻兼而非之者，其故何也？意以为难而不可为邪？尝有难此而可为者，昔荆灵王好小要，当灵王之身，荆国之士饭不逾乎一，固据而后兴，扶垣而后行。故约食为其难为也，然后为而灵王说之；未逾于世而民可移也，即求以乡其上也。昔者越王句践好勇，教其士臣三年，以其知为未足以知之也，焚舟失火，鼓而进之，其士偃前列，伏水火而死有不可胜数也。当此之时，不鼓而退也，越国之士，可谓颤矣。故焚身为其难为也，然后为之，越王说之，未逾于世，而民可移也，即求以乡其上也。昔者晋文公好粗服。当文公之时，晋国之士，大布之衣，牂羊之裘，练帛之冠，且粗之屦，入见文公，出以践之朝。故粗服为其难为也，然后为，而文公说之，未逾于世，而民可移也，即求以乡其上也。是故约食焚舟粗服，此天下之至难为也，然后为而上说之，未逾于世，而民可移也。何故也？即求以乡其上也。今若夫兼相爱、交相利，此其有利，且易为也，不可胜计也，我以为则无有上说之者而已矣。苟有上说之者，劝之以赏誉，威之以刑罚，我以为人之于就兼相爱、交相利也，譬之犹火之就上、水之就下也，不可防止于天下。故兼者，圣王之道也，王公大人之所以安也，万民衣食之所以足也，故君子莫若审兼而务行之。为人君必惠，为人臣必忠；为人父必慈，为人子必孝，为人兄必友，为人弟必悌。故君子莫若欲为惠君、忠臣、慈父、孝子、友兄、悌弟，当若兼之，不可不行也，此圣王之道，而万民之大利也。"
                },
                {
                    name:"墨子·第十七章·非攻上",
                    content:"今有一人，入人园圃，窃其桃李，众闻则非之，上为政者，得则罚之，此何也？以亏人自利也。至攘人犬豕鸡豚，其不义又甚入人园圃窃桃李。是何故也？以亏人愈多，其不仁兹甚，罪益厚。至入人栏厩，取人马牛者，其不仁又甚攘人犬豕鸡豚，此何故也？以其亏人愈多。苟亏人愈多，其不仁兹甚，罪益厚。至杀不辜人也，拖其衣裘，取戈剑者，其不义，又甚入人栏厩取人马牛。此何故也？以其亏人愈多。苟亏人愈多，其不仁兹甚矣，罪益厚。当此，天下之君子皆知而非之，谓之不义。今至大为攻国，则弗知非，从而誉之，谓之义。此可谓知义与不义之别乎？杀一人，谓之不义，必有一死罪矣。若以此说往，杀十人，十重不义，必有十死罪矣；杀百人，百重不义，必有百死罪矣。当此，天下之君子皆知而非之，谓之不义。今至大为不义攻国，则弗知非，从而誉之，谓之义，情不知其不义也，故书其言以遗后世。若知其不义也，夫奚说书其不义以遗后世哉？ 今有人于此，少见黑曰黑，多见黑曰白，则以此人为不知白黑之辩矣；少尝苦曰苦，多尝苦曰甘，则必以此人为不知甘苦之辩矣。今小为非，则知而非之；大为非攻国，则不知非，从而誉之，谓之义。此可谓知义与不义之辩乎？是以知天下之君子也，辩义与不义之乱也。"
                },
                {
                    name:"墨子·第十八章·非攻中",
                    content:"子墨子言曰：“古者王公大人为政于国家者，情欲誉之审，赏罚之当，刑政之不过失……。”是故子墨子曰：“古者有语：谋而不得，则以往知来，以见知隐。谋若此可得而知矣。”今师徒唯毋兴起，冬行恐寒，夏行恐暑，此不可以冬夏为者也。春则废民耕稼树艺，秋则废民获敛。今唯毋废一时，则百姓饥寒冻馁而死者，不可胜数。今尝计军上：竹箭、羽旄、幄幕、甲盾、拨劫，往而靡弊腑冷不反者，不可胜数。又与矛、戟、戈、剑、乘车，其列住碎拆靡弊而不反者，不可胜数。与其牛马，肥而往，瘠而反，往死亡而不反者，不可胜数。与其涂道之修远，粮食辍绝而不继，百姓死者，不可胜数也。与其居处之不安，食饭之不时，肌饱之不节，百姓之道疾病而死者，不可胜数。丧师多不可胜数，丧师尽不可胜计，则是鬼神之丧其主后，亦不可胜数。国家发政，夺民之用，废民之利，若此甚众，然而何为为之？曰：“我贪伐胜之名，及得之利，故为之。”子墨子言曰：“计其所自胜，无所可用也；计其所得，反不如所丧者之多。”今攻三里之城，七里之郭，攻此不用锐，且无杀，而徒得此然也？杀人多必数于万，寡必数于千，然后三里之城，七里之郭且可得也。今万乘之国，虚数于千，不胜而入；广衍数于万，不胜而辟。然则土地者，所有余也；王民者，所不足也。今尽王民之死，严下上之患，以争虚城，则是弃所不足，而重所有余也。为政若此，非国之务者也。饰攻战者言曰：“南则荆、吴之王，北则齐、晋之君，始封于天下之时，其土地之方，未至有数百里也；人徒之众，未至有数十万人也。以攻战之故，土地之博，至有数千里也；人徒之众，至有数百万人。故当攻战而不可为也。”子墨子言曰：“虽四五国则得利焉，犹谓之非行道也。譬若医之药人之有病者然，今有医于此，和合其祝药之于天下之有病者而药之。万人食此，若医四五人得利焉，犹谓之非行药也。故孝子不以食其亲，忠臣不以食其君。古者封国于天下，尚者以耳之所闻，近者以目之所见，以攻战亡者，不可胜数。”何以知其然也？东方有莒之国者，其为国甚小，闲于大国之闲，不敬事于大，大国亦弗之从而爱利，是以东者越人夹削其壤地，西者齐人兼而有之。计莒之所以亡于齐、越之间者，以是攻战也。虽南者陈、蔡，其所以亡于吴、越之间者，亦以攻战。虽北者且不一著何，其所以亡于燕代、胡貊之闲者，亦以攻战也。是故子墨子言曰：“古者王公大人，情欲得而恶失，欲安而恶危，故当攻战，而不可不非。”饰攻战者之言曰：“彼不能收用彼众，是故亡；我能收用我众，以此攻战于天下，谁敢不宾服哉！”子墨子言曰：“子虽能收用子之众，子岂若古者吴阖闾哉？”古者吴阖闾教七年，奉甲执兵，奔三百里而舍焉。次注林，出于冥隘之径，战于柏举，中楚国而朝宋与及鲁。至夫差之身，北而攻齐，舍于汶上，战于艾陵，大败齐人，而葆之大山；东而攻越，济三江五湖，而葆之会稽。九夷之国莫不宾服。于是退不能赏孤，施舍群萌，自恃其力，伐其功，誉其志，怠于教遂。筑姑苏之台，七年不成。及若此，则吴有离罢之心。越王勾践视吴上下不相得，收其众以复其雠，入北郭，徙大内，围王宫，而吴国以亡。昔者晋有六将军，而智伯莫为强焉。计其土地之博，人徒之众，欲以抗诸侯，以为英名，攻战之速，故差论其爪牙之士，皆列其舟车之众，以攻中行氏而有之。以其谋为既已足矣，又攻兹范氏而大败之，并三家以为一家而不止，又围赵襄子于晋阳。及若此，则韩、魏亦相从而谋曰：“古者有语：唇亡则齿寒。赵氏朝亡，我夕从之，赵氏夕亡，我朝从之。诗曰：鱼水不务，陆将何及乎！是以三主之君，一心戳力，辟门除道，奉甲兴士，韩、魏自外，赵氏自内，击智伯大败之。”是故子墨子言曰：“古者有语曰：君子不镜于水，而镜于人。镜于水，见面之容；镜于人，则知吉与凶。今以攻战为利，则盖尝鉴之于智伯之事乎？此其为不吉而凶，既可得而知矣。”"
            },
                {
                    name:"墨子·第十九章·非攻下",
                    content:"子墨子言曰：今天下之所誉善者，其说将何哉？为其上中天之利，而中中鬼之利，而下中人之利，故誉之与？意亡非为其上中天之利，而中中鬼之利，而下中人之利，故誉之与？虽使下愚之人，必曰：“将为其上中天之利，而中中鬼之利，而下中人之利，故誉之。”今天下之同意者，圣王之法也，今天下之诸侯，将犹多皆免攻伐并兼，则是有誉义之名，而不察其实也。此譬犹盲者之与人，同命白黑之名，而不能分其物也，则岂谓有别哉！是故古之知者之为天下度也，必顺虑其义而后为之行。是以动，则不疑速通。成得其所欲，而顺天、鬼、百姓之利，则知者之道也。是故古之仁人有天下者，必反大国之说，一天下之和，总四海之内。焉率天下之百姓，以农、臣事上帝、山川、鬼神。利人多，功故又大，是以天赏之，鬼富之，人誉之，使贵为天子，富有天下，名参乎天地，至今不废，此则知者之道也，先王之所以有天下者也。今王公大人、天下之诸侯则不然。将必皆差论其爪牙之士，皆列其舟车之卒伍，于此为坚甲利兵，以往攻伐无罪之国。入其国家边境，芟刈其禾稼，斩其树木，堕其城郭，以湮其沟池，攘杀其牲口，燔溃其祖庙，劲杀其万民，覆其老弱，迁其重器，卒进而柱乎斗，曰：“死命为上，多杀次之，身伤者为下；又况失列北桡乎哉？罪死无赦！”以惮其众。夫无兼国覆军，贼虐万民，以乱圣人之绪。意将以为利天乎？夫取天之人，以攻天之邑，此刺杀天民，剥振神之位，倾覆社稷，攘杀其牲□，则此上不中天之利矣。意将以为利鬼乎？夫杀之人，灭鬼神之主，废灭先王，贼虐万民，百姓离散，则此中不中鬼之利矣。意将以为利人乎？夫杀之人为利人也博矣！又计其费此－－为周生之本，竭天下百姓之财用，不可胜数也，则此下不中人之利矣。今夫师者之相为不利者也，曰：“将不勇，士不分，兵不利，教不习，师不众，率不利和，威不圉，害之不久，争之不疾，孙之不强。植心不坚，与国诸侯疑。与国诸侯疑，则敌生虑而意羸矣。偏具此物，而致从事焉，则是国家失卒，而百姓易务也。今不尝观其说好攻伐之国，若使中兴师，君子，庶人也，必且数千，徒倍十万，然后足以师而动矣。久者数岁，速者数月。是上不暇听治，士不暇治其官府，农夫不暇稼穑，妇人不暇纺绩织纴，则是国家失卒，而百姓易务也。然而又与其车马之罢毙也，幔幕帷盖，三军之用，甲兵之备，五分而得其一，则犹为序疏矣。然而又与其散亡道路，道路辽远，粮食不继，傺食饮之时，厕役以此饥寒冻馁疾病而转死沟壑中者，不可胜计也。此其为不利于人也，天下之害厚矣。而王公大人，乐而行之。则此乐贼灭天下之万民也，岂不悖哉？今天下好战之国，齐、晋、楚、越，若使此四国者得意于天下，此皆十倍其国之众，而未能食其地也，是人不足而地有余也。今又以争地之故，而反相贼也，然则是亏不足，而重有余也。今逮夫好攻伐之君，又饰其说，以非子墨子曰：“以攻伐之为不义，非利物与？昔者禹征有苗，汤伐桀，武王伐纣，此皆立为圣王，是何故也？”子墨子曰：“子未察吾言之类，未明其故者也。彼非所谓“攻”，谓“诛”也。昔者三苗大乱，天命殛之，日妖宵出，雨血三朝，龙生于庙，犬哭乎市，夏冰，地坼及泉，五谷变化，民乃大振。高阳乃命玄宫，禹亲把天之瑞令，以征有苗。四电诱祗，有神人面鸟身，若瑾以侍，搤矢有苗之祥。苗师大乱，后乃遂几。禹既巳克有三苗，焉磨为山川，别物上下，卿制大极，而神民不违，天下乃静，则此禹之所以征有苗也。逮至乎夏王桀，天有（车告）命，日月不时，寒暑杂至，五谷焦死，鬼呼国，鹤鸣十夕余。天乃命汤于镳宫：“用受夏之大命。夏德大乱，予既卒其命于天矣，往而诛之，必使汝堪之。”汤焉敢奉率其众，是以乡有夏之境，帝乃使阴暴毁有夏之城，少少有神来告曰：“夏德大乱，往攻之，予必使汝大堪之。予既受命于天，天命融隆火，于夏之城闲西北之隅。”汤奉桀众以克有，属诸侯于薄，荐章天命，通于四方，而天下诸侯莫敢不宾服，则此汤之所以诛桀也。逮至乎商王纣，天不序其德，祀用失时，兼夜中十日，雨土于薄，九鼎迁止，妇妖宵出，有鬼宵吟，有女为男，天雨肉，棘生乎国道，王兄自纵也。赤鸟衔珪，降周之岐社，曰：“天命周文王，伐殷有国。”泰颠来宾，河出绿图，地出乘黄。武王践功，梦见三神曰：“予既沈渍殷纣于酒德矣，往攻之，予必使汝大堪之”武王乃攻狂夫，反商之周，天赐武王黄鸟之旗。王既巳克殷，成帝之来，分主诸神，祀纣先王，通维四夷，而天下莫不宾。焉袭汤之绪，此即武王之所以诛纣也。若以此三圣王者观之，则非所谓“攻”也，所谓“诛”也”则夫好攻伐之君又饰其说，以非子墨子曰：“子以攻伐为不义，非利物与？昔者楚熊丽，始讨此睢山之间，越王繄亏，出自有遽，始邦于越；唐叔与吕尚邦齐、晋。此皆地方数百里，今以并国之故，四分天下而有之，是故何也？子墨子曰：“子未察吾言之类，未明其故者也。古者天子之始封诸侯也，万有余；今以并国之故，万国有余皆灭，而四国独立。此譬犹医之药万有余人，而四人愈也，则不可谓良医矣。”则夫好攻伐之君又饰其说，曰：“我非以金玉、子女、壤地为不足也，我欲以义名立于天下，以德求诸侯也。”子墨子曰：“今若有能以义名立于天下，以德求诸侯者，天下之服，可立而待也。夫天下处攻伐久矣，譬若傅子之为马然。今若有能信效先利天下诸侯者，大国之不义也，则同忧之；大国之攻小国也，则同救之，小国城郭之不全也，必使修之，布粟之绝则委之，币帛不足则共之。以此效大国，则小国之君说。人劳我逸，则我甲兵强。宽以惠，缓易急，民必移。易攻伐以治我国，攻必倍。量我师举之费，以争诸侯之毙，则必可得而序利焉。督以正，义其名，必务宽吾众，信吾师，以此授诸侯之师，则天下无敌矣，其为下不可胜数也。此天下之利，而王公大人不知而用，则此可谓不知利天下之臣务矣。是故子墨子曰：“今且天下之王公大人士君子，中情将欲求兴天下之利，除天下之害，当若繁为攻伐，此实天下之巨害也。今欲为仁义，求为上士，尚欲中圣王之道，下欲中国家百姓之利，故当若“非攻”之为说，而将不可不察者此也！”"
                },
            ]
        },
    ]
    }
]